[
    "tipe" => "petunjuk",
    "data" => "
        <p>يُحكى أنّ رجلا عجوزًا كان يعيش في قرية بعيدة، وكان أتعس شخص على وجه الأرض، حتى أنّ كلّ سكان القرية سئموا منه، لأنه كان محبطًا على الدوام، ولا يتوقّف عن التذمر والشكوى، ولم يكن يمرّ يوم دون أن تراه في مزاج سيء. وكلّما تقدّم به السنّ، ازداد كلامه سوءًا وسلبية.  كان سكّان القرية ينجنّبونه قدر الإمكان، فسوء حظّه أصبح مُعديًا. ويستحيل أن يحافظ أيّ شخص على سعادته بالقرب منه. لقد كان ينشر مشاعر الحزن والتعاسة لكلّ من حوله. </p>
        <p>لكن، وفي أحد الأيام وحينما بلغ العجوز من العمر ثمانين عامًا، حدث شيء غريب، وبدأت إشاعة عجيبة في الانتشار: </p>
        <p>"الرجل العجوز سعيد اليوم، إنه لا يتذمّر من شيء، والابتسامة ترتسم على محيّاه، بل إن ملامح وجهه قد أشرقت وتغيّرت!" </p>
        <p> تجمّع القرويون عند منزل العجوز، وبادره أحدهم بالسؤال: - "ما الذي حدث لك؟" وهنا أجاب العجوز: - "لا شيء مهمًّا...لقد قضيتُ من عمري 80 عامًا أطارد السعادة بلا طائل. ثمّ قرّرت بعدها أن أعيش من دونها، وأن أستمتع بحياتي وحسب، لهذا السبب أنا سعيد الآن!" </p>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 1,
        "soal" => " لماذا سئم أهل القرية للعجوز؟ ",
        "pilihan" => [
            "لأنه كان مغصونا على الدوام",
            "لأنه كان متسامحا على الدوام",
            "لأنه كان محبطًا على الدوام",
            "لأنه كان مغنيا على الدوام",
        ]
        "jawaban" => "لأنه كان محبطًا على الدوام",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 2,
        "soal" => "كيف كان العجوز إذا زاد منه العمر؟",
        "pilihan" => [
            "ازداد صحاته",
            "ازداد كلامه حلوة",
            "ازداد صالحا  ",
            "ازداد كلامه سوءًا وسلبية",
        ]
        "jawaban" => "ازداد كلامه سوءًا وسلبية",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 3,
        "soal" => "لماذا يبعد عنه سكان القرية؟ ",
        "pilihan" => [
            "ينشر مشاعر الحزن والمزاح لكلّ من حوله",
            "ينشر مشاعر الحزن والتعاسة لكلّ من حوله",
            "ينشر مشاعر الفرح والتعاسة لكلّ من حوله",
            "ينشر مشاعر الحزن والسعادة لكلّ من حوله",
        ]
        "jawaban" => "ينشر مشاعر الحزن والتعاسة لكلّ من حوله",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 4,
        "soal" => "المرادف من كلمة "بادر" .... ",
        "pilihan" => [
            "أسلف",
            "أوجد",
            "سارع",
            "استمتع",
        ]
        "jawaban" => "سارع",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 5,
        "soal" => "المضاد من كلمة "بادر" .... ",
        "pilihan" => [
            "آجل",
            "عاجل",
            "سارع",
            "منع",
        ]
        "jawaban" => "آجل",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 6,
        "soal" => "متى تغير صفة العجوز؟",
        "pilihan" => [
            "قبل بلغ ٨٠ من عمره",
            "عند بلغ ٨٠ من عمره",
            "قبيل بلغ ٨٠ من عمره",
            "عند بلغ ٧٠ من عمره",
        ]
        "jawaban" => "عند بلغ ٨٠ من عمره",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 7,
        "soal" => "العبرة من القصة السابقة هي....",
        "pilihan" => [
            "لا تطارد السعادة",
            "لا تكن عجوزا",
            "لا تقارب بالعجوز",
            "لا تقابل السعادة",
        ]
        "jawaban" => "لا تطارد السعادة",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p>نشأ الرشيد في بيت ملك، وأُعد ليتولى المناصب القيادية في الخلافة، وعهد به أبوه الخليفة “المهدي"  إلى من يقوم على أمره تهذيبًا وتعليمًا وتثقيفًا، وحسبك أن يكون من بين أساتذة الأمير الصغير “الكسائي”، والمفضل الضبي، وهما مَن هما علمًا ولغة وأدبًا، حتى إذا اشتد عوده واستقام أمره، ألقى به أبوه في ميادين الجهاد، وجعل حوله القادة الأكفاء، يتأسى بهم، ويتعلم من تجاربهم وخبراتهم، فخرج في عام (165 هـ / 781م) على رأس حملة عسكرية ضد الروم، وعاد محملاً بأكاليل النصر، فكوفئ على ذلك بأن اختاره أبوه وليًا ثانيًا للعهد بعد أخيه موسى الهادي.</p>
        <p>وكانت الفترة التي سبقت خلافته يحوطه في أثنائها عدد من الشخصيات السياسية والعسكرية، من أمثال “يحيى بن خالد البرمكي”، و”الربيع بن يونس”، و”يزيد بن مزيد الشيباني” و”الحسن بن قحطبة الطائي”، و”يزيد بن أسيد السلمي”، وهذه الكوكبة من الأعلام كانت أركان دولته حين آلت إليه الخلافة، ونهضوا معه بدولته حتى بلغت ما بلغت من التألق والازدهار.</p>
        <p>تمت البيعة للرشيد بالخلافة في (14 من شهر ربيع الأول 170هـ / 14 من سبتمبر 786م)، بعد وفاة أخيه موسى الهادي، وبدأ عصر زاهر كان واسطة العقد في تاريخ الدولة العباسية التي دامت أكثر من خمسة قرون، ارتقت فيه العلوم، وسمت الفنون والآداب، وعمَّ الرخاء ربوع الدولة.</p>
        <p>وكانت الدولة العباسية حين آلت خلافتها إليه مترامية الأطراف تمتد من وسط أسيا حتى المحيط الأطلنطي، مختلفة البيئات، متعددة العادات والتقاليد، معرضة لظهور الفتن والثورات، تحتاج إلى قيادة حكيمة وحازمة يفرض سلطانها الأمن والسلام، وتنهض سياستها بالبلاد. وكان الرشيد أهلاً لهذه المهمة الصعبة في وقت كانت فيه وسائل الاتصال شاقة، ومتابعة الأمور مجهدة، وساعده على إنجاز مهمته أنه أحاط نفسه بكبار القادة والرجال من ذوي القدرة والكفاءة، ويزداد إعجابك بالرشيد حين تعلم أنه أمسك بزمام هذه الدولة العظيمة وهو في نحو الخامسة والعشرين من عمره، فأخذ بيدها إلى ما أبهر الناس من مجدها وقوتها وازدهار حضارتها.</p>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 8,
        "soal" => "المرادف من كلمة "أب".... ",
        "pilihan" => [
            "ولد",
            "والد",
            "بعل",
            "وابل",
        ]
        "jawaban" => "والد",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 9,
        "soal" => "من هو "الكسائي"؟",
        "pilihan" => [
            "صاحب هارون الرشيد",
            "مترجم هارون الرشيد",
            "معلم هارون الرشيد",
            "متعلم هارون الرشيد",
        ]
        "jawaban" => "معلم هارون الرشيد",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 10,
        "soal" => "المضاد من كلمة "العود" .....",
        "pilihan" => [
            "الانتقال",
            "الرجوع",
            "الثبات",
            "الذهاب",
        ]
        "jawaban" => "الذهاب",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 11,
        "soal" => "متى تولى هارون الرشيد الخلافة؟",
        "pilihan" => [
            "٧٨١ م",
            "١٧٢ هـ",
            "٧٨٦ م",
            "١٦٥ هـ",
        ]
        "jawaban" => "٧٨٦ م",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 12,
        "soal" => "موسى الهادي، هو ...... هارون الرشيد.",
        "pilihan" => [
            "عم",
            "معلم",
            "أخو",
            "ولد",
        ]
        "jawaban" => "أخو",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 13,
        "soal" => "كيف كانت الدولة العباسية في عهد هارون الرشيد؟",
        "pilihan" => [
            "متبثرا",
            "مكسورا",
            "مطمئنا",
            "متخلفا",
        ]
        "jawaban" => "مطمئنا",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 14,
        "soal" => "ويزداد إعجابك بالرشيد حين تعلم أنه أمسك بزمام هذه الدولة العظيمة وهو في نحو ....... من عمره. ",
        "pilihan" => [
            "٢٥",
            "٣٥",
            "١٥",
            "٤٥",
        ]
        "jawaban" => "٢٥",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 15,
        "soal" => "المرادف من كلمة "الفترة".... ",
        "pilihan" => [
            "الوقت",
            "الزمان",
            "العصر",
            "الراحة",
        ]
        "jawaban" => "الزمان",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 16,
        "soal" => "ما الشخصية المفضلة في هذه القصة؟ ",
        "pilihan" => [
            "المهدي",
            "الكسائي",
            "موسى الهادي",
            "هارون الرشيد",
        ]
        "jawaban" => "هارون الرشيد",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 17,
        "soal" => "ما العنوان المناسب للقصة السابقة؟",
        "pilihan" => [
            "سيرة هارون الرشيد",
            "خلافة هارون الرشيد",
            "إعجاب هارون الرشيد",
            "قضايا هارون الرشيد",
        ]
        "jawaban" => "سيرة هارون الرشيد",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p>يُحكى أنه كان في الغابة قردان صديقان أحدهما منحوس والأخر محظوظ بكل الأشياء، وفي يوم من الأيام اتفق القردان على أن يذهبا إلى مزرعة على مقربة منهما لجلب الموز وتناوله، ووضعا خطة لذلك تقتضي أن يبقى القرد المنحوس على الأرض فيما يصعد القرد المحظوظ إلى شجرة الموز ليقطفه ويلقيه للمنحوس في الأسفل، رأى المزارع القردان وهما يسرقان الموز فأمسك القرد المنحوس وأبرحه ضرباً فيما هرب القرد المحظوظ وهو يمسك قطف الموز، وفي المرة الثانية تكرر ما حصل وأبرح المزارع القرد المنحوس ضرباً أيضاً، إلى أن قرر القردان أن يتبادلا الأدوار. فصعد القرد المنحوس ليقطف الموز هذه المرة، فيما بقي المحظوظ على الأرض، وعندما رآهما المزارع أمسك القرد المحظوظ ليضربه، إلّا أنّه قرر أن يضرب القرد الموجود في أعلى الشجرة هذه المرة لا الموجود في أسفلها كما يفعل دائما، وبذلك أُبرح القرد المنحوس ضرباً للمرة الثالثة على التوالي فيما فرّ القرد المحظوظ ضاحكاً.</p>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 18,
        "soal" => "أين يعيش منحوس؟",
        "pilihan" => [
            "الغابة",
            "المزرعة",
            "حديقة الحيوان",
            "الحظيرة",
        ]
        "jawaban" => "الغابة",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 19,
        "soal" => "بما اتفق القردان؟",
        "pilihan" => [
            "بأن يأكلا مرتبا",
            "بأن يناما هادئا",
            "بأن يتبادلا الأدوار",
            "بأن يدورا الغابة",
        ]
        "jawaban" => "بأن يتبادلا الأدوار",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 20,
        "soal" => "أين نبت الموز؟",
        "pilihan" => [
            "في الغابة",
            "في المزرعة",
            "في الحديقة",
            "في الحقل",
        ]
        "jawaban" => "في المزرعة",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 21,
        "soal" => "لماذا ذهب القردان إلى المزرعة؟",
        "pilihan" => [
            "لأخذ النبات",
            "لجلب الموز",
            "لحوار مع المزارع",
            "لتجول",
        ]
        "jawaban" => "لجلب الموز",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 22,
        "soal" => "المضاد من كلمة "هرب" ....",
        "pilihan" => [
            "وقع",
            "جرى",
            "سارع",
            "واجه",
        ]
        "jawaban" => "واجه",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 23,
        "soal" => "من يضرب القرد المنحوس؟ ",
        "pilihan" => [
            "الراعي ",
            "المحظوظ",
            "المزارع",
            "الداعي",
        ]
        "jawaban" => "المزارع",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 24,
        "soal" => "لماذا ضُرب المنحوس؟",
        "pilihan" => [
            "لأنه ضحك على الموز",
            "لأنه نظر الموز",
            "لأنه نبت الموز",
            "لأنه سرق الموز",
        ]
        "jawaban" => "لأنه سرق الموز",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 25,
        "soal" => "كيف كان يفرّ المحظوظ في نهاية الأمر؟",
        "pilihan" => [
            "متسائما",
            "مضحكا",
            "محزنا",
            "متبادلا",
        ]
        "jawaban" => "مضحكا",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p>غاب موسى -عليه السلام- عن قومه أربعين يوماً، وكان بنو إسرائيل قد انتظروا عشرين يوماً، وظنّوا أنّه لن يعود، فظهر رجلٌ منهم يُدعى السامريّ، وصنع لهم عجلاً من الحليّ، وادّعى أنّه إلهُهم، وأنّ عليهم عبادته، ففُتِن القوم، وعبدوه من دون الله، ويُشار إلى أنّ هارون -عليه السلام- كان قد نهاهم عن ذلك، وأمرهم بالرجوع عن فِعلهم، وحثّهم على عبادة الله ربّ العالَمين، فلم يستجيبوا له، بل اشتدّ تمسُّكهم بعبادة العجل، فلمّا عاد موسى -عليه السلام- بما وعدهم، ووجدهم على حالهم، عاتبَ أخاه هارون -عليه السلام-، فأخبره أنّهم استضعفوه، وكادوا يقتلونه، فلم يقوَ على رَدعهم، ثمّ ذهب موسى إلى السامريّ، فسأله عن فِعلته، فكان ردّه أنّه يملك ما لا يملكه بنو إسرائيل من بصيرةٍ، فما كان من موسى -عليه السلام- إلّا أن حرَّقَ العجل، ونسفَ رماده نَسفاً، وأخبره أنّ له عقوبة في الدُّنيا، وفي الآخرة، قال -تعالى-: (قَالَ فَاذْهَبْ فَإِنَّ لَكَ فِي الْحَيَاةِ أَنْ تَقُولَ لَا مِسَاسَ ۖ وَإِنَّ لَكَ مَوْعِدًا لَنْ تُخْلَفَهُ ۖ وَانْظُرْ إِلَىٰ إِلَٰهِكَ الَّذِي ظَلْتَ عَلَيْهِ عَاكِفًا ۖ لَنُحَرِّقَنَّهُ ثُمَّ لَنَنْسِفَنَّهُ فِي الْيَمِّ نَسْفًا)؛ فلا إله إلّا الله وحده.</p>"
]
[
    "tipe" => "soal",
    "data" => [
        "no" => 26,
        "soal" => "كم مدة غاب موسى عن قومه؟",
        "pilihan" => [
            "أقل من شهر",
            "زاد من شهرين",
            "أكثر من شهرين",
            "أكثر من شهر",
        ]
        "jawaban" => "أكثر من شهر",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 27,
        "soal" => "من هو السامريّ؟",
        "pilihan" => [
            "أخو موسى عليه السلام",
            "رجل من بني إسرائيل",
            "جند فرعون",
            "خليل الله",
        ]
        "jawaban" => "رجل من بني إسرائيل",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 28,
        "soal" => "كيف معاملة بنو إسرائيل هارون عليه السلام؟",
        "pilihan" => [
            "يطيعونه",
            "يسمعوه",
            "ينكرونه",
            "يسجدونه",
        ]
        "jawaban" => "ينكرونه",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 29,
        "soal" => "من صنع عجلا بينهم؟",
        "pilihan" => [
            "السامري",
            "القاضي",
            "موسى عليه السلام",
            "هارون عليه السلام",
        ]
        "jawaban" => "السامري",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 30,
        "soal" => "كيف ظنّ بنو إسرائيل عن موسى عليه السلام؟",
        "pilihan" => [
            "أنه مات",
            "أنه جائع",
            "أنه لن يعود",
            "أنه في غمراة الموت",
        ]
        "jawaban" => "أنه لن يعود",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 31,
        "soal" => "كيف كان معاملة موسى بهارون عليهما السلام بعد رجوعه؟",
        "pilihan" => [
            "غضب له",
            "رضي له",
            "ضربه",
            "خاصمه",
        ]
        "jawaban" => "غضب له",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 32,
        "soal" => "لماذا فعل السامري عن أمر؟",
        "pilihan" => [
            "لأنه رجل من بني إسرائيل",
            "لأنه عنده بصيرة",
            "لأنه عنده عجلا",
            "لأنهم صدقوا بهم",
        ]
        "jawaban" => "لأنه عنده بصيرة",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p>كان جحا يتسوّق ذات يوم فجاء رجل من الخلف وصفعه على خده، فالتفت إليه جحا وأراد أن يتعارك معه ولكنّ الرجل اعتذر بشدة قائلاً: إني آسف يا سيدي فقد ظننتك فلاناً، فلم يقبل جحا هذا العذر وأصرّ على محاكمته ولمّا علا صياحهما اقترح الناس أن يذهبا إلى القاضي ليحكم بينهما، فذهبا إلى القاضي، وصادف أن يكون ذلك القاضي قريباً للجاني ولمّا سمع القاضي القصة غمز لقريبه بعينه (يعني لا تقلق فسأخلصك من هذه الورطة)، ثمّ أصدر حكمه بأن يدفع الرجل لجحا مبلغ 20 ديناراً كعقوبة على ضربه.</p>
        <p> فقال الرجل: ولكن يا سيدي القاضي ليس معي شيئا الآن، فقال القاضي وهو يغمز له أذهب واحضرها حالاً وسينتظرك جحا عندي حتى تحضرها، فذهب الرجل وجلس جحا في مجلس القاضي ينتظر غريمه حتى يحضر المال، ومرت الساعات ولم يحضر الرجل، ففهم جحا الخدعة خاصة أنًه كان يبحث عن تفسير لتلك الغمزات التي وجهها القاضي لغريمه، فلما أدرك جحا أنّه خُدع من قِبل القاضي وقريبه قام وتوجّه إلى القاضي وصفعه على خده صفعة طارت منها عمامته وقال له: إذا أحضر غريمي الـ 20 ديناراً فخذها لك حلالاً طيباً وانصرف.</p>"
]
[
    "tipe" => "soal",
    "data" => [
        "no" => 33,
        "soal" => "لماذا غضب جحا إلى رجل؟",
        "pilihan" => [
            "لأنه قد نصحه",
            "لأنه قد سمعه",
            "لأنه قد التفت له",
            "لأنه قد ضربه",
        ]
        "jawaban" => "لأنه قد ضربه",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 34,
        "soal" => "إلى من توجه جحا والرجل؟",
        "pilihan" => [
            "الرئيس",
            "الراعي",
            "القاضي",
            "الملك",
        ]
        "jawaban" => "القاضي",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 35,
        "soal" => "لماذا تأذر الرجل إلى جحا؟",
        "pilihan" => [
            "لأنه أخطأ",
            "لأنه يتجب",
            "لأنه أمام القاضي",
            "لأن من رجل ثري",
        ]
        "jawaban" => "لأنه أخطأ",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 36,
        "soal" => "هل دفع الرجل غريم جحا؟ ",
        "pilihan" => [
            "نعم، دفع الرجل غريم جحا",
            "لا، لن دفع الرجل غريم جحا",
            "نعم، دفع الرجل غريم جحا",
            "لا، ما دفع الرجل غريم جحا",
        ]
        "jawaban" => "لا، ما دفع الرجل غريم جحا",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 37,
        "soal" => "من خدع في القصة السابقة؟",
        "pilihan" => [
            "جحا",
            "الرجل",
            "القاضي",
            "الناس",
        ]
        "jawaban" => "القاضي",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 38,
        "soal" => "أين تعمل القاضي؟",
        "pilihan" => [
            "في الكسرى",
            "في القصر",
            "في المحكمة",
            "في السوق",
        ]
        "jawaban" => "في المحكمة",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p> قُتل عمر بن الخطاب -رضي الله عنه- وهو خليفة المسلمين وأمير المؤمنين، حين كان يؤمّ المسلمين في صلاة الفجر، وحصل ذلك حين استوت الصفوف للصلاة، وكبّر عمر -رضي الله عنه- لبدء الصلاة، فانطلق رجلٌ بسرعةٍ كبيرةٍ بين الصفوف، فطعن عمر -رضي الله عنه-، وشقّ بطنه، وكان أبو لؤلؤة المجوسي، ثمّ فرّ هارباً يطعن كلّ من يلاقي في طريقه، فقتل غير عمر سبعة رجالٍ، وجرح أحد عشر رجلاً، ثمّ رمى عليه أحد الرجال كساءً، فأمسك به، فنحر أبو لؤلؤة نفسه ومات، وبعد مرور فترةٍ وجيزةٍ مات عمر -رضي الله عنه-.</p>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 39,
        "soal" => "ما الموضوع المناسب للقصة السابقة؟",
        "pilihan" => [
            "شجاع عمر بن الخطاب",
            "استشهاد عمر بن الخطاب",
            "صفة عمر بن الخطاب",
            "كرمة عمر بن الخطاب",
        ]
        "jawaban" => "استشهاد عمر بن الخطاب",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 40,
        "soal" => "متى قتل عمر بن الخطاب؟",
        "pilihan" => [
            "عند الصبح",
            "عند الظهر",
            "عند المساء",
            "عند الليل",
        ]
        "jawaban" => "عند الصبح",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 41,
        "soal" => "كيف كان وفاة عمر بن الخطاب؟",
        "pilihan" => [
            "بضرب ",
            "بحرب",
            "بطعن",
            "بشجاع",
        ]
        "jawaban" => "بطعن",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 42,
        "soal" => "من هو أبو لؤلؤة المجوسي؟",
        "pilihan" => [
            "المأموم",
            "الإمام",
            "القاتل",
            "المقتول",
        ]
        "jawaban" => "القاتل",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 43,
        "soal" => "كم عدد المقتول في ذالك الفجر؟",
        "pilihan" => [
            "سبعة رجال",
            "ثمانية رجال",
            "تسعة رجال",
            "عشرة رجال",
        ]
        "jawaban" => "ثمانية رجال",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 44,
        "soal" => "كيف كان عمر في ذالك الفجر؟",
        "pilihan" => [
            "كان إماما",
            "كان مأموما",
            "كان مؤذنا",
            "كان منفردا",
        ]
        "jawaban" => "كان إماما",
    ],
],
[
    "tipe" => "petunjuk",
    "data" => "
        <p>يحكى أنّ شاباً ثرثاراً رأي شيخاً كبيراً ذو دقن طويلة غزاها الشيب يجلس مرّة على باب سوق، فأراد هذا الشاب أن يبدأ معه حديثاً يسليه به، فأتى إليه وسلّم عليه وقال له: هل بسؤال ياعم؟ فقال له الشيخ الكبير: تفضّل يا بني، فقال الشاب: أتضع ذقنك هذه فوق اللحاف عند نومك يا عمّاه أم تحته؟ سكت العجوز برهة ولم يعرف لسؤال هذا الشاب جواباً؛ ذلك لأنّه لم يتفطّن لما يفعله به عند نومه من قبل، لكّنه وعده أن يلاحظ ما هو فاعل به عندما ينام الليلة، وفي الصباح انطلق العجوز باحثاً عن الشاب في السوق بكل عزمه، ولمّا لقيه سلّم عليه وانهال عليه ضرباً وقال له: أربعون عاماً وأنا أحمل ذقني أينما حللت ولا أشعر منه بثِقل لا في نوم، ولا في طعام ولا في شراب، أمّا الليلة فقد جافاني النوم ولم أعرف له طريق، إن رفعتها فوق اللحاف أحسست بأنني مشنوق، وإن وضعتها تحت اللحاف أحسست بأنني مخنوق، فاذهب لا بارك الله في أعدائك ولا سلّطك بثرثرتك هذه على أحد.</p>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 45,
        "soal" => "لماذا أراد الشاب أن يتكلم بشيخ؟",
        "pilihan" => [
            " تسلية به",
            " مزاحا له",
            " خوفا منه",
            " تعظيما له",
        ]
        "jawaban" => " تسلية به",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 46,
        "soal" => "لماذا سكت الشيخ؟",
        "pilihan" => [
            "لأنه صائم",
            "لأنه مريض",
            "لأنه لم يعرف الإجابة",
            "لأنه لم يفهم السؤال",
        ]
        "jawaban" => "لأنه لم يعرف الإجابة",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 47,
        "soal" => "من يكون ثرثارا في القصة السابقة؟",
        "pilihan" => [
            "الشاب",
            "العجوز",
            "الشيخ",
            "الناس",
        ]
        "jawaban" => "الشاب",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 48,
        "soal" => "المضاد من كلمة "ثقيل"... ",
        "pilihan" => [
            "جاف",
            "خفيف",
            "ضخل",
            "ضحم",
        ]
        "jawaban" => "خفيف",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 49,
        "soal" => "المرادف من كلمة "سكت" ....",
        "pilihan" => [
            "صام",
            "أجب",
            "عامر",
            "صمت",
        ]
        "jawaban" => "صمت",
    ],
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 50,
        "soal" => "أين المكان الذي حدث  القصة السابقة ؟",
        "pilihan" => [
            "القرية",
            "البلاد",
            "السوق",
            "المنزل",
        ]
        "jawaban" => "السوق",
    ],
],
