[
    "tipe" => "petunjuk",
    "data" => "<center><b>القسم الثاني : فهم التراكيب والتعبيرات</b></center>"
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 1
        "soal" => "يسرق اللص شيئا ثم يقرّ ويحمل ما يأخذه. "ما" في الجملة السابقة؟",
        "pilihan" => [
            "النافي",
            "الموصول",
            "الاستفهام",
            "التعجب",
        ],
        "jawaban" => "الموصول",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 2
        "soal" => "صلى المسلمون في اليوم واليلة سبع عسرة ....",
        "pilihan" => [
            "ركعةٍ",
            "ركعاتٍ",
            "ركعةً",
            "ركعاتٌ",
        ],
        "jawaban" => "ركعةً",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 3
        "soal" => "يقيس البائع النسيج ... متر.",
        "pilihan" => [
            "على",
            "ب",
            "مع",
            "في",
        ],
        "jawaban" => "ب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 4
        "soal" => "سوف يرجع أبي من مكة ....",
        "pilihan" => [
            "في الأسبوع القديم",
            "في الأسبوع القادم",
            "في الشهر الماضي",
            "في يوم الأمس",
        ],
        "jawaban" => "في الأسبوع القادم",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 5
        "soal" => "كان الفلاح في المزرعة الكبيرة. الخبر في هذه الجملة ؟",
        "pilihan" => [
            "كان",
            "في المزرعة الكبيرة",
            "المزرعة",
            "الفلاح",
        ],
        "jawaban" => "في المزرعة الكبيرة",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 6
        "soal" => "اتصل علي ... محمد البارحة.",
        "pilihan" => [
            "مع",
            "على",
            "في",
            "ب",
        ],
        "jawaban" => "ب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 7
        "soal" => "نحن نزور المريض وندعو ....",
        "pilihan" => [
            "معه",
            "فيه",
            "عنه",
            "له",
        ],
        "jawaban" => "له",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 8
        "soal" => "يحمي الجندي وطنه ويحرص .... سلامته. ",
        "pilihan" => [
            "مع",
            "على",
            "في",
            "ب",
        ],
        "jawaban" => "على",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 9
        "soal" => "يسمح المدرس لتلاميذه النزهة. كلمة "النزهة" في الجملة السابقة ؟",
        "pilihan" => [
            "مضاف إليه",
            "فاعل",
            "خبر",
            "مفعول به",
        ],
        "jawaban" => "مفعول به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 10
        "soal" => "من يجتهد في التعلم ينجح في الإمتحان. "من" في الجملة السابقة ؟",
        "pilihan" => [
            "تعجبية",
            "موصولة",
            "شرط",
            "استفهام",
        ],
        "jawaban" => "شرط",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 11
        "soal" => "حفظ التلاميذ عشرين سورة. كلمة "عشرين" ؟",
        "pilihan" => [
            "خبر",
            "مفعول به",
            "حال",
            "فاعل",
        ],
        "jawaban" => "مفعول به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 12
        "soal" => "إنّ لله تسعة وتسعين اسما. كلمة "اسما" ؟",
        "pilihan" => [
            "مفعول به",
            "حال",
            "تمييز",
            "مفعول لأجله",
        ],
        "jawaban" => "تمييز",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 13
        "soal" => "لم تطلع الشمس في هذه الساعة. فعل تطلع في الجملة السابقة، فعل مضارع صحيح الآخر :",
        "pilihan" => [
            "منصوب وعلامة نصبه فتحة ظاهرة في آخره",
            "مرفوع وعلامة رفعه ضمة ظاهرة فى لآخره",
            "مجزوم وعلامة جزمه حذف النون",
            "مجزوم وعلامة جزمه السكون",
        ],
        "jawaban" => "مجزوم وعلامة جزمه السكون",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 14
        "soal" => "كل هذه الجملة صحيحة ما عاد ؟",
        "pilihan" => [
            "يصب المرء الماء في الكوب",
            "أنتِ تكوين الملابس ",
            "تصفو السماء ويضيع الغيم",
            "تسمح المدرس لطالبه المريض الرجوع",
        ],
        "jawaban" => "تسمح المدرس لطالبه المريض الرجوع",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 15
        "soal" => "كلا المسلمين مجد. كلمة "كلا"",
        "pilihan" => [
            "مبتدأ مرفوع بالألف",
            "خبر مقدم مرفوع بالألف",
            "مبتدأ مرفوع بالضمة المقدرة",
            "مبتدأ مرفوع بحذف النون",
        ],
        "jawaban" => "مبتدأ مرفوع بالألف",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 16
        "soal" => "أنا أمد الحبل ثم أجر به عربتي. كلمة "الحبل" ....",
        "pilihan" => [
            "مرفوع بالضمة",
            "منوب بالفتحة",
            "مجرور بالكسرة",
            "مجرور بالفتحة",
        ],
        "jawaban" => "منوب بالفتحة",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 17
        "soal" => "يتساوم المشتري والبائع عن الثمن. كلمة "المشتري" ...",
        "pilihan" => [
            "مرفوع بالضمة",
            "مرفوع بالضمة المقدرة",
            "مرفوع بحذف النون",
            "مرفوع بحذف حرف العلة",
        ],
        "jawaban" => "مرفوع بالضمة المقدرة",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 18
        "soal" => "تترقّى الأمة .... البناء والإصلاح. ",
        "pilihan" => [
            "من",
            "ب",
            "على",
            "في",
        ],
        "jawaban" => "في",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 19
        "soal" => "..... القبيلة والقبيلة الأخرى.",
        "pilihan" => [
            "تنازع",
            "نازع",
            "تتنازع",
            "نزع",
        ],
        "jawaban" => "تتنازع",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 20
        "soal" => ".... الولد المصباح. ",
        "pilihan" => [
            "يشعل",
            "تشعل",
            "تشعلان",
            "أُشعل",
        ],
        "jawaban" => "يشعل",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 21
        "soal" => ".... التلامسذ سؤالا.",
        "pilihan" => [
            "يجيبون",
            "تجيب",
            "يجيب",
            "يجبن",
        ],
        "jawaban" => "يجيب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 22
        "soal" => "نستعين ... الله في كل أمر.",
        "pilihan" => [
            "على ",
            "ب",
            "من",
            "في",
        ],
        "jawaban" => "ب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 23
        "soal" => ".... المسافر الحذاء في سفره.",
        "pilihan" => [
            "يمسك",
            "يستعمل",
            "يحرس",
            "يندم",
        ],
        "jawaban" => "يستعمل",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 24
        "soal" => "رأيت عديد من المتكلمين في الندوة العالمية. العديد في هذه الجملة تعني ؟",
        "pilihan" => [
            "ماهر",
            "نابغة",
            "قليل",
            "كثير",
        ],
        "jawaban" => "كثير",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 25
        "soal" => "هو ..... الطلاب في هذا الفصل.",
        "pilihan" => [
            "ماهر",
            "ماهرة",
            "أمهر",
            "أماهر",
        ],
        "jawaban" => "أمهر",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 26
        "soal" => "أن – لك – الدروس – تجتهد – في –ينبغي ",
        "pilihan" => [
            "أن تجتهد لك في الدروس ينبغي",
            "تجتهد في الدروس أن ينبغي لك",
            "ينبغي لك أن تجتهد في الدروس",
            "ينبغي أن تجتهد في الدروس لك",
        ],
        "jawaban" => "ينبغي لك أن تجتهد في الدروس",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 27
        "soal" => "المالك – وفدا – أربعين – من – بعث – القصر",
        "pilihan" => [
            "المالك بعث وفدا من أربعين القصر ",
            "بعث المالك أربعين وفدا من القصر",
            "بعث المالك أربعين القصر من وفدا",
            "المالك بعث أربعين القصر من وفدا",
        ],
        "jawaban" => "بعث المالك أربعين وفدا من القصر",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 28
        "soal" => "رسالة – خبرا – تأتي – فيها - أخي – أجيد – من – مهما ",
        "pilihan" => [
            "تأتي أخي خبر رسالة فيها خبرا من مهما",
            "تأتي خبر من رسالة أجيد فيها أخي مهما",
            "تأتي رسالة من أخي أجيد خبرا مهما فيها",
            "تأتي رسالة من أخي أجيد فيها خبرا مهما",
        ],
        "jawaban" => "تأتي رسالة من أخي أجيد فيها خبرا مهما",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 29
        "soal" => "إذا غابت الشمس أتى ...",
        "pilihan" => [
            "الأسد",
            "النور",
            "الظلام",
            "الملائكة",
        ],
        "jawaban" => "الظلام",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 30
        "soal" => "أودع أستاذي حين أراد السفر للحج. كلمة "أستاذي".....",
        "pilihan" => [
            "فاعل",
            "نائب الفاعل",
            "مفعول به",
            "خبر",
        ],
        "jawaban" => "مفعول به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 31
        "soal" => "تُخْتَبَرُ مهارة التلميذ في الإختبار. كلمة "مهارة"......",
        "pilihan" => [
            "فاعل",
            "نائب الفاعل",
            "مفعول به",
            "خبر",
        ],
        "jawaban" => "نائب الفاعل",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 32
        "soal" => "يزن التاجر سلعة بالجرام. كلمة "سلعة"....",
        "pilihan" => [
            "مفعول به",
            "مفعول مطلق",
            "تمييز",
            "حال",
        ],
        "jawaban" => "مفعول به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 33
        "soal" => "تضع المرأة الزهرية ... المنضدة.",
        "pilihan" => [
            "من",
            "ل ",
            "على",
            "في",
        ],
        "jawaban" => "على",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 34
        "soal" => "يصف الطبيب الدواء ... المريض. ",
        "pilihan" => [
            "من",
            "ل ",
            "على",
            "في",
        ],
        "jawaban" => "ل ",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 35
        "soal" => "يُسقى الزرع ماء كافيا. كلمة "كافيا"....",
        "pilihan" => [
            "حال ",
            "تمييز ",
            "بدل",
            "نعت",
        ],
        "jawaban" => "نعت",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 36
        "soal" => "ما رأيتُك عدة شهور. مفرد من "شهور"",
        "pilihan" => [
            "شهو",
            "شهر",
            "شهرة",
            "أشهر",
        ],
        "jawaban" => "شهر",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 37
        "soal" => "للرجل قلنسوة ...",
        "pilihan" => [
            "أسود",
            "سوداء",
            "سواد",
            "سودان",
        ],
        "jawaban" => "سوداء",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 38
        "soal" => "من لم يذق مُرّ تعلم ساعة، تجرع ذل الجهل طول حياته. كلمة "مرّ"....",
        "pilihan" => [
            "فعل ماض",
            "فعل أمر",
            "مفعو به",
            "خبر",
        ],
        "jawaban" => "مفعو به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 39
        "soal" => "كتب أحمد ستة .....",
        "pilihan" => [
            "كتابا",
            "كتب",
            "كتبا",
            "كتاب",
        ],
        "jawaban" => "كتب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 40
        "soal" => "من الأنبياء ثلاثمائة وخمسة عشر رجلا. كلمة "رجلا" ....",
        "pilihan" => [
            "مفعول به",
            "تمييز",
            "حال ",
            "بدل",
        ],
        "jawaban" => "تمييز",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 41
        "soal" => "عليٌّ <u>طالب</u> إندونيسي؟",
        "pilihan" => [
            "مبتدأ",
            "خبر",
            "مبتدأ مؤخر",
            "خبر مقدم",
        ],
        "jawaban" => "خبر",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 42
        "soal" => "يدرس حسن العلوم <u>الإسلامية</u> في الجامعة. ما إعراب الكلمة التي تحتحها خط؟",
        "pilihan" => [
            "مرفوع",
            "منصوب",
            "مجرور",
            "مجزوم",
        ],
        "jawaban" => "منصوب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 43
        "soal" => "ثم كسى العظام <u>لحمـا</u>",
        "pilihan" => [
            "نعت، منصوب",
            "مفعول مطلق، منصوب",
            "تمييز، منصوب",
            "مبتدأ، مرفوع",
        ],
        "jawaban" => "تمييز، منصوب",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 44
        "soal" => "يتكلم حسن باللغة العربية <u>جيدا</u>",
        "pilihan" => [
            "مفعول به",
            "مفعول فيه",
            "مبتدأ مؤخر",
            "مفعول مطلق",
        ],
        "jawaban" => "مفعول مطلق",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 45
        "soal" => "من ترك <u>نسكا</u> فعليه دم",
        "pilihan" => [
            "مفعول به",
            "مفعول فيه",
            "مبتدأ مؤخر",
            "حال",
        ],
        "jawaban" => "مفعول به",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 46
        "soal" => "صلِ قائمـا فإن لم تستطع <u>فقاعدا</u> فإن لم تستطع فعلى جنب",
        "pilihan" => [
            "مفعول به",
            "مفعول فيه",
            "مبتدأ مؤخر",
            "حال",
        ],
        "jawaban" => "حال",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 47
        "soal" => "صلى المسلمون كل يوم خمس مرات <u>ابتغاء</u> مرضاة الله",
        "pilihan" => [
            "مفعول مطلق",
            "مفعول فيه",
            "مفعول له",
            "مفعول به",
        ],
        "jawaban" => "مفعول له",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 48
        "soal" => "فأما من أوتي <u>كتابه</u> بيمينه",
        "pilihan" => [
            "فاعل",
            "نائب الفاعل",
            "خبر",
            "مفعول به",
        ],
        "jawaban" => "نائب الفاعل",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 49
        "soal" => "كان <u>عثمـان</u> بن عفان من أوائل المسلمين إسلاما",
        "pilihan" => [
            "خبر كان",
            "مفعول مقدم",
            "مبتدأ",
            "اسم كان",
        ],
        "jawaban" => "اسم كان",
    ]
],
[
    "tipe" => "soal",
    "data" => [
        "no" => 50
        "soal" => "كان عثمـان بن عفان من أوائل المسلمين <u>إسلاما</u>",
        "pilihan" => [
            "اسم كان",
            "تمييز",
            "صفة",
            "خبر كان",
        ],
        "jawaban" => "تمييز",
    ]
],
