<?php

defined('BASEPATH') OR exit('No direct script access allowed');

class Soal_model extends CI_Model {
    public function get_soal_istimav1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>إختبار اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>
                "
            ],
            [
                "tipe" => "audio",
                "data" => "v1 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الإثنين",
                        "بالحافلة",
                        "نعم هو يذهب إلى الجامعة",
                        "لأنه طالب مجتهد",
                    ],
                    "jawaban" => "بالحافلة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "سأكون مدرسا",
                        "نعم ، أخي تاجر",
                        "لا هو تاجر",
                        "أبي طبيب",
                    ],
                    "jawaban" => "سأكون مدرسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "هذا دكتور إبراهيم",
                        "نعم هو محاضر",
                        "في الأسبوع القادم",
                        "نعم، في الجامعة",
                    ],
                    "jawaban" => "في الأسبوع القادم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "الممرض",
                        "الطبيب",
                        "الشرطى",
                        "الفلاح",
                    ],
                    "jawaban" => "الفلاح"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "معاني القرآن الكريم",
                        "سور القرآن الكريم",
                        "أسماء القرآن الكريم",
                        "إعجاز القرآن",
                    ],
                    "jawaban" => "معاني القرآن الكريم"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "لا يتناول الغداء",
                        "يتناول العشاء",
                        "لا يتناول الفطور",
                        "يتناول الفطور",
                    ],
                    "jawaban" => "لا يتناول الفطور"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "وصل المسافرون المطار و لم تصل الطائرة",
                        "وصلت الطائرة و يصل المسافرون",
                        "وصل المسافرون المطار بعد مغادرة الطائرة",
                        "ركب المسافرون الطائرة و غادروا المطار",
                    ],
                    "jawaban" => "وصل المسافرون المطار بعد مغادرة الطائرة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "مكارم الأخلاق",
                        "الأخلاق",
                        "غرض البعث",
                        "الرسول",
                    ],
                    "jawaban" => "غرض البعث"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "بدأ الإمتحان في السابعة و النصف",
                        "بدأ الإمتحان في الثامنة و النصف",
                        "بدأ الإمتحان في التاسعة تماما",
                        "بدأ الإمتحان في السابعة إلا النصف",
                    ],
                    "jawaban" => "بدأ الإمتحان في السابعة و النصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "الشبكة الدولية",
                        "السفن",
                        "الطائرات",
                        "الحافلة",
                    ],
                    "jawaban" => "الشبكة الدولية"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "النظافة",
                        "النوم مبكرا",
                        "الوضوء",
                        "الاغتسال بعد النوم",
                    ],
                    "jawaban" => "النظافة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "لأن القرد نظر إليهم",
                        "لأن القرد في رقبته سلسلة",
                        "لأن القرد كان يرقص",
                        "لأن القرد أخذ العصا",
                    ],
                    "jawaban" => "لأن القرد كان يرقص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "أن الله يحبّ المؤمن الضعيف أكثر من القويّ",
                        "أن الله يحبّ المؤمن القوي أكثر من الضعيف",
                        "المؤمن الضعيف مثل المؤمن القويّ",
                        "أن الله يحبّ المؤمن",
                    ],
                    "jawaban" => "أن الله يحبّ المؤمن القوي أكثر من الضعيف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "مريض",
                        "ممرض",
                        "صيدلي",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طالب",
                        "دكتور",
                        "مريض",
                    ],
                    "jawaban" => "دكتور"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "طلب مبلغا كبيرا من المال",
                        "لم يشتر الحاسوب",
                        "عنده مبلغ كبير",
                    ],
                    "jawaban" => "لم يشتر الحاسوب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "الطعام مفيد",
                        "العملُ مهمٌّ",
                        "المالُ فيه خير",
                        "اتّباع بالأنبياء مهم",
                    ],
                    "jawaban" => "العملُ مهمٌّ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "ليلة التي خير من ألف شهر",
                        "شهر رمضان",
                        "نزول القران",
                        "ليلة القدر",
                    ],
                    "jawaban" => "شهر رمضان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "الحادية عشرة",
                        "الحادية عشرة والنصف",
                        "الثانية عشرة والنصف",
                        "الثانية عشرة إلا النصف",
                    ],
                    "jawaban" => "الثانية عشرة والنصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "خمسين مسافرا",
                        "ستين مسافرا",
                        "خمسة و عشرين مسافرا",
                        "عشرين مسافرا",
                    ],
                    "jawaban" => "خمسين مسافرا"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "الطلاب سوف يواجهون الامتحان",
                        "نصيحة المدرس لطلابه قبل الامتحان",
                        "الطلاب يدرسون بجهد",
                        "المدرس سوف يواجه الامتحان",
                    ],
                    "jawaban" => "نصيحة المدرس لطلابه قبل الامتحان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "السادسة",
                        "الثامنة",
                        "التاّسعة",
                        "السابعة",
                    ],
                    "jawaban" => "السابعة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "المدينة المنوّرة",
                        "جدّة",
                        "مكّة المكرمة",
                        "المنزل",
                    ],
                    "jawaban" => "مكّة المكرمة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "عبد الرحمن و أبوه",
                        "أبو عبد الرحمن",
                        "عبد الرحمن",
                        "أم عبد الرّحمن",
                    ],
                    "jawaban" => "أبو عبد الرحمن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في مكان الاستئجار",
                        "في جاكرتا",
                        "في البيت",
                    ],
                    "jawaban" => "في مكان الاستئجار"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم أربعين، استمع إلى الحوارات ثم اختر أنسب جواب بعد كل تعبير :</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak2.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "يعمل الآن طبيبا",
                        "يعمل مهندسا",
                        "لا يعمل",
                        "يعمل مدرسا",
                    ],
                    "jawaban" => "لا يعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "أربع و عشرون سنةً",
                        "ستة وعشرون سنةً",
                        "خمس	و عشرون سنةً",
                        "سبعة و عشرون سنةً",
                    ],
                    "jawaban" => "ستة وعشرون سنةً"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "في السوق",
                        "في المطعم",
                        "في الفصل",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المكتبة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "دول الشرق",
                        "دول الشرق الأوسط",
                        "الدول النامية",
                        "الدول الغربية",
                    ],
                    "jawaban" => "الدول النامية"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة الثامنة",
                        "في الساعة السابعة",
                        "في الساعة التاسعة",
                    ],
                    "jawaban" => "في الساعة الثامنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في السوق",
                        "في المستشفى",
                    ],
                    "jawaban" => "في المطعم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مريض",
                        "يصلي الصبح",
                        "لا يعرف الملعب الرياضي",
                        "سيزور أحد أصدقائه",
                    ],
                    "jawaban" => "سيزور أحد أصدقائه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاث سنوات",
                        "خمس سنوات",
                        "سنتين",
                        "أربع  سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم أربعة وثلاثين  إلى سبعة وثلاثين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak3.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "عمل أبيه",
                        "عمل أخيه",
                        "عمل جده",
                        "اختيار المهنة",
                    ],
                    "jawaban" => "اختيار المهنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طياّر",
                        "مهندس",
                        "مدرّس",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "مهندسا",
                        "مدرّسا",
                        "طياّرا",
                        "طبيبا",
                    ],
                    "jawaban" => "مدرّسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "الطّبّ",
                        "التّعليم",
                        "الطّيران",
                        "الهندسة",
                    ],
                    "jawaban" => "الطّيران"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ثمانية وثلاثين  إلى اثنين وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak4.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "رجل وزوجته",
                        "امرأة وابنتها",
                        "أمّ وابنتها",
                        "امرأة وأختها",
                    ],
                    "jawaban" => "أمّ وابنتها"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "وضع الماء في اللبن",
                        "وضع اللبن في الماء",
                        "بيع اللبن في السوق",
                        "بيع اللبن في بيت عمر",
                    ],
                    "jawaban" => "وضع الماء في اللبن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "الله",
                        "الابنة",
                        "الأمّ",
                        "الأخت",
                    ],
                    "jawaban" => "الابنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "زوج المرأة",
                        "الأب",
                        "عمر",
                        "الله",
                    ],
                    "jawaban" => "عمر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة",
                        "الأمّ",
                        "عمر",
                        "لا أحد",
                    ],
                    "jawaban" => "لا أحد"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center> للإجابة عن الأسئلة من رقم ثلاثة وأربعين إلى خمسة وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "حياة الناس",
                        "فوائد السفر",
                        "بلاد العالم",
                        "السفارة",
                    ],
                    "jawaban" => "فوائد السفر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "أربع قارات",
                        "ست قارات",
                        "خمس قارات",
                        "قارات كثيرة",
                    ],
                    "jawaban" => "خمس قارات"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "السفر",
                        "الأمم الأخرى",
                        "الإستماع",
                        "القراءة",
                    ],
                    "jawaban" => "السفر"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين  إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak6.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في لندن",
                        "في بلده",
                        "في الطائرة",
                    ],
                    "jawaban" => "في لندن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "هو في استقبال صديقه",
                        "ليذهب إلى المستشفى",
                        "للعمل",
                        "للتَنَزُّه",
                    ],
                    "jawaban" => "للعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "هو مشغول في المكتب",
                        "هو لا يريد السفر",
                        "ستتأخر طائرته",
                        "هو مريض",
                    ],
                    "jawaban" => "ستتأخر طائرته"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "للسفر إلى لندن",
                        "لاستقبال صديقه",
                        "ليأخذ تذكرة الطائرة",
                        "لطلب العمل",
                    ],
                    "jawaban" => "لاستقبال صديقه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "صباح الغد",
                        "مساء اليوم",
                        "بعد الظهر",
                        "هذه الليلة",
                    ],
                    "jawaban" => "صباح الغد"
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'اشترى أحمد سبعة ...',
                    "pilihan" => [
                        "كتبٍ",
                        "كتابا",
                        "كتابٍ",
                        "كتابٌ"
                    ],
                    "jawaban" => "كتبٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'الإتحاد أساس النجاح. الإتحاد في هذه الجملة تكون ؟',
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "مبتدأ",
                        "خبر"
                    ],
                    "jawaban" => "مبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'نشأت اللغة العربية في جزيرة العرب قبل الإسلام.إعراب  "الإسلام" في هذه الجملة؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "مجرور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كان في المدرسة أستاذ مَشْهُوْرٌ. اسم كان في هذه الجملة ؟',
                    "pilihan" => [
                        "كان",
                        "في المدرسة",
                        "المدرس",
                        "أستاذ"
                    ],
                    "jawaban" => "أستاذ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'لا شكّ أن اللغة العربية ..... في ديننا للمسلمين والمسلمات.',
                    "pilihan" => [
                        "لغةً مهمةً",
                        "لغةٍ مهمةٍ",
                        "لغةَ مهمةٍ",
                        "لغةٌ مهمةٌ"
                    ],
                    "jawaban" => "لغةٌ مهمةٌ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني ........؟',
                    "pilihan" => [
                        "جديدا",
                        "جديدٍ",
                        "جديدةً",
                        "جديدةٍ"
                    ],
                    "jawaban" => "جديدةً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => '........ مشكلة الأفراد في مواجهة الحياة',
                    "pilihan" => [
                        "تختلف",
                        "يختلف",
                        "أختلف",
                        "نختلف"
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'صاد الرجل الأسماك الكثيرة هذه الليلة. کلمة <b>الكثيرة</b> فی الجملة السابقة؟',
                    "pilihan" => [
                        "مضاف إلیه",
                        "مفعول",
                        "توكيد",
                        "نعت"
                    ],
                    "jawaban" => "نعت"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'لا أصدق بما قاله عدنان عن هذا الخبر. "ما" فی الجملة السابقة؟',
                    "pilihan" => [
                        "تعجبیة",
                        "موصولة",
                        "استفهامیة",
                        "نافیة"
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'قال تعالی: (قال رب إنی وهن العظم منی و اشتعل الرأس شیبا. کلمة (شیبا) ؟',
                    "pilihan" => [
                        "منصوب",
                        "مرفوع",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'قال تعالی: ( إن الإنسان خلق هلوعا. کلمة (هلوعا) هي؟',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "اسم إن",
                        "تمییز"
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'مرحلة الشباب أهم <u>مرحلة</u> في حياة الإنسان، وأغلى <u>ثروة</u> عند الأمة. ما الإعراب من كلمة التي تحتها خط؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجزوم",
                        "مجرور"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'بین هذه الجمل جملة صحیحة هي؟',
                    "pilihan" => [
                        "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاول فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولتا فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولت فاطمة أن ينهي كتابة الرسالة هذه السنة"
                    ],
                    "jawaban" => "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'الموظفان يعملان في شريكة الطباعة معا. الموظفان في هذه الجملة؟',
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "مبتدأ مرفوع بالنون",
                        "خبر مرفوع بالألف",
                        "خبر مرفوع  بالنون"
                    ],
                    "jawaban" => "مبتدأ مرفوع بالألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'قال: <u>لا تُظلمْ</u> الناس فتندم. الكلمة التي تحتها خط هي؟',
                    "pilihan" => [
                        "فعل ماض",
                        "فعل الأمر",
                        "الفعل الناهي",
                        "اسم فعل"
                    ],
                    "jawaban" => "الفعل الناهي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'هذه الجامعة مناسبة لمن يريدون أن يعمقوا علوما طبية. كلمة مناسبة؟',
                    "pilihan" => [
                        "خبر",
                        "مبتدأ",
                        "نعت",
                        "موصوف"
                    ],
                    "jawaban" => "خبر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => '...... الأم الدجاجة المشوية في الصباح لأنني أحب بهذا الطبخ. ',
                    "pilihan" => [
                        "طبخت",
                        "طبخ",
                        "طبختا",
                        "طبخوا"
                    ],
                    "jawaban" => "طبخت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'الجد والجدة  ..... في سعادة مع أولادهما و أحفادهما. ',
                    "pilihan" => [
                        "يعيشان",
                        "يعيش",
                        "تعيش ",
                        "تعيشان "
                    ],
                    "jawaban" => "يعيشان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => '...... الأساتيذ الطلاب والطالبات أن يراجعوا الدروس لمقابلة الاختبار الآخر في هذه المدرسة. ',
                    "pilihan" => [
                        "يأمرون",
                        "يأمر",
                        "تأمرون",
                        "تأمر"
                    ],
                    "jawaban" => "يأمر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كثير من الناس ......  بذكري مولدي النبي صلى الله عليه وسلم ',
                    "pilihan" => [
                        "يفكرون",
                        "يسمعون",
                        "ينظرون",
                        "يحتفلون"
                    ],
                    "jawaban" => "يحتفلون"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'يريد صالح أن يذهب إلى مصر في الأسبوع القادم.  القادم في هذه الجملة تعني؟ ',
                    "pilihan" => [
                        "الماضي",
                        "الآتي",
                        "أمس",
                        "الآن"
                    ],
                    "jawaban" => "الآتي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'صبح لاعب كرة القدم مشهورا بسبب صناعة هدف ......',
                    "pilihan" => [
                        "رائعٍ",
                        "رائعٌ",
                        "رائعاً",
                        "رائعين"
                    ],
                    "jawaban" => "رائعٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'أن تحفظ العالم – يجب علينا – حولنا – مهم لحياة الناس – لأن حفظ العالم. ',
                    "pilihan" => [
                        "يجب علينا حولنا أن نحفظ العالم لأن حفظ العالم مهم لحياة الناس",
                        "أن نحفظ العالم حولنا مهم لحياة الناس لأن حفظ العالم يجب علينا",
                        "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                        "مهم لحياة الناس أن نحفظ العالم لأن حفظ العالم حولنا يجب علينا"
                    ],
                    "jawaban" => "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => ' ليست – الشهادة – الدراسة – لنيل– أغراض – إن- فحسب <br>الترتيب الصحيح مِن الكَلِماتِ السَابِقَةِ هُوَ.......',
                    "pilihan" => [
                        "ليست لنيل الشهادة إن أغراض الدراسة فحسب",
                        "إن فحسب أغراض الدراسة ليست لنيل الشهادة",
                        "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                        "إن أغراض الدراسة لنيل الشهادة ليست فحسب "
                    ],
                    "jawaban" => "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'تجتهد – إن – في الإمتحان – تنجح  <br>الترتيب الصحيح من الكلمات السابقة هو....... ',
                    "pilihan" => [
                        "تجتهد في الامتحان إن تنجح ",
                        "إن  تنجح تجتهد في الامتحان",
                        "إن تجتهد تنجح في الامتحان",
                        "إن تنجح  في الإمتحان تجتهد"
                    ],
                    "jawaban" => "إن تجتهد تنجح في الامتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => ' يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. أين نائب الفاعل في هذه العبارة؟',
                    "pilihan" => [
                        "تقدم الدول",
                        "بالنظافة",
                        "اليوم",
                        "وسكانها"
                    ],
                    "jawaban" => "تقدم الدول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'لن ترجع الأيام التي مضت. ترجع في هذه الجملة؟',
                    "pilihan" => [
                        "منصوب بالفتحة",
                        "منصوب بالألف",
                        "منصوب بالكسرة",
                        "منصوب بحذف حرف العلة"
                    ],
                    "jawaban" => "منصوب بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => 'الموضوع الذي قدمه الدكتور في هذه المحاضرة <u>مناسب</u> بحال الناس في هذا العصر. الكلمة التي تحتها خط تعني؟',
                    "pilihan" => [
                        "متجانس",
                        "لائق",
                        "مفيد",
                        "منخفض"
                    ],
                    "jawaban" => "لائق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => ' لا يوافق أكثر الحاضرين برأي رئيس القرية عن أمور مجيئ الضيوم من خارج البلاد لاحتفال يوم استقلال اندونيسي. هذه العبارة تعني؟',
                    "pilihan" => [
                        "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد بعض الضيوم من خارج البلاد  في يوم الاستقلال",
                        "لا يوجد يوم الاستقلال "
                    ],
                    "jawaban" => "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>اقترح</u> أحد السكان في هذه القرية لصناعة الجسر بين قريتين لتسهيل المرور بينهما. ماذا نقصد  الكلمة التي تحتها خد؟',
                    "pilihan" => [
                        "قدم رأيا",
                        "قدم جسرا",
                        "قدم مالا",
                        "قدم سكان "
                    ],
                    "jawaban" => "قدم رأيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => '<u>كانوا</u> الإنسان <u>في</u> هذا العصر <u>لا يهتمون</u> <u>بالتربية</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "كانوا",
                        "في",
                        "لا يهتمون",
                        "بالتربية"
                    ],
                    "jawaban" => "كانوا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => '<u>يبني</u> <u>المهندس</u> <u>هذا البناء</u> العالي بعشرة <u>يوم</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يبني",
                        "هذا البناء",
                        "يوم",
                        "المهندس"
                    ],
                    "jawaban" => "يوم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => '<u>تفحص</u> الطبيبة <u>المريض</u> في <u>هذه</u> المستشفي  <u>بكل فرح</u> وسرور. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "تفحص",
                        "المريض",
                        "هذه",
                        "بكل فرح"
                    ],
                    "jawaban" => "هذه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => '<u>كان</u> المدافع في هذه المباراة <u>يرفسون</u> الكرة بشدة حتى <u>يحصل</u> على <u>الهدف</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟ ',
                    "pilihan" => [
                        "كان",
                        "يرفسون",
                        "يحصل",
                        "الهدف"
                    ],
                    "jawaban" => "يرفسون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => '<u>يزور</u> الطلاب والطالبات <u>المتاحف</u> <u>المتنوعة</u> لزيادة <u>المعلوماتُ</u> .  ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يزور",
                        "المتاحف",
                        "المتنوعة",
                        "المعلوماتُ"
                    ],
                    "jawaban" => "المعلوماتُ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => '<u>يستمعون</u> <u>الطلاب</u> محاضرة عميد <u>الجامعة</u> في الجامعة <u>الإسلامية</u>. ما هي الكلمة الخاطئة من هذه الجملة؟',
                    "pilihan" => [
                        "يستمعون",
                        "الطلاب",
                        "الجامعة",
                        "الإسلامية"
                    ],
                    "jawaban" => "يستمعون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => '<u>مشكلة الأسرة</u> <u>يؤدي</u> إلى نجاح <u>أولادهم</u> في <u>المدرسة</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "مشكلة الأسرة",
                        "يؤدي",
                        "أولادهم",
                        "المدرسة"
                    ],
                    "jawaban" => "يؤدي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرت هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحروا هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرا هذا الرجل في علم النحو والصرف والبلاغة"
                    ],
                    "jawaban" => "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "ليس للمسلمين عدوٌّ ",
                        "ليس للمسلمين عدوًّا",
                        "ليس للمسلمين عدوٍّ",
                        "ليس للمسلمين عدوين"
                    ],
                    "jawaban" => "ليس للمسلمين عدوٌّ ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "الطلاب لم يرموا الزبالة في أي مكان",
                        "الطلاب لم يرمون الزبالة في أي مكان",
                        "الطلاب لم يرم الزبالة في أي مكان",
                        "الطلاب لم يرمي الزبالة في أي مكان"
                    ],
                    "jawaban" => "الطلاب لم يرموا الزبالة في أي مكان",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثالث: فهم المقروء</center></p>
                    <p>نشأت اللغة العربية في جزيرة العرب قبل الإسلام، وكان العرب قبائل متفرقة، وكانت لبعض القبائل لهجات خاصة بها. وكانت الاختلافات قليلة بين تلك اللهجات. وكانت للعرب لغة مشتركة، هي اللغة العربية الفصيحة، لغة الشعر والخطابة، التي كان العرب يتحدثون بها. ثم جاء الإسلام، وأنزل الله القرآن الكريم، باللغة العربية الفصيحة. قال الله تعالى: (إنا أنزلناه قرآنًا عربيا لعلكم تعقلون).</p>
                    <p>أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة، وجاء بأساليب جديدة، لم تعرفها العربية من قبل. وكان القرآن سببًا في نشأة علوم اللغة العربية؛ كالنحو والصرف، والبلاغة، والعلوم الإسلامية، كعلم التفسير والحديث والفقه وغيرها.</p>
                    <p>أثرت اللغة العربية في لغات الشعوب الإسلامية، كالفارسية والأردية والسواحلية، فأقرضتها كثيرًا من الألفاظ، وكتب كثير من تلك اللغات بالحرف العربي. واقترضت لغات أخرى بعض الألفاظ العربية، مثل: الإنجليزية والفرنسية والإسبانية.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'عما تتحدث الفقرة السابقة؟',
                    "pilihan" => [
                        "اللغة العربية ",
                        "اللغة العربية الفصيحة وآثرها",
                        "الجزيرة العربية ",
                        "الدولة العربية ",
                    ],
                    "jawaban" => "اللغة العربية الفصيحة وآثرها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'ما المرادف من كلمة "نَشَأَتْ " من تلك الفقرة ؟',
                    "pilihan" => [
                        "صارت",
                        "ارتقت",
                        "كبرت",
                        "أصبحت",
                    ],
                    "jawaban" => "ارتقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'متي نشأت اللغة العربية ؟',
                    "pilihan" => [
                        "بعد الاسلام ",
                        "قبل الاسملام ",
                        "في عصر الخلافة ",
                        "في عصر الحديث ",
                    ],
                    "jawaban" => "قبل الاسملام ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كل هذه العبارة مخطيئة. إلا ؟',
                    "pilihan" => [
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الجديدة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني صحيحة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الصحيحة معاني جديدة",
                    ],
                    "jawaban" => "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'ما سبب نشأة علوم اللغة العربية ؟',
                    "pilihan" => [
                        "الحديث ",
                        "الفقه",
                        "القرآن",
                        "الشعب ",
                    ],
                    "jawaban" => "القرآن",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>یا محمد ابعث  لی هذه الرسالة بالبرید الإلکترونی إلی الحج یوسف فی کوالالمبور، واکتب له أن یحضر إلینا هنا فی الریاض بعد رمضان مباشرة.  حتی ندخل الشبکة الدولیة إلی مکتبنا فی اليبان کما فعلنا فی مکتبنا فی کوریا.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أین یوسف الآن؟',
                    "pilihan" => [
                        "فی کوریا",
                        "فی مالیزیا",
                        "فی الیابان",
                        "فی الریاض",
                    ],
                    "jawaban" => "فی مالیزیا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'متی سیحضر یوسف إلی الریاض؟',
                    "pilihan" => [
                        "‌فی رمضان",
                        "‌فی شعبان",
                        "‌فی شوال",
                        "‌قبل رمضان",
                    ],
                    "jawaban" => "‌فی شوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'ما المرادف من كلمة "المكتب" في تلك الفقرة؟',
                    "pilihan" => [
                        "‌المكتبة",
                        "‌المدرسة",
                        "‌الديوان",
                        "‌الفصل",
                    ],
                    "jawaban" => "‌الديوان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبحت مشكلة زيادة السكان من أهم المشكلات التى تعانى منها معظم دول العالم، وقد اتجهت معظم هذه الدول إلى تحديد النسل، فالصين-ألف مليون نسمة – قد حددت النسل طفلا للأسرة الواحدة وما زاد عن ذلك فهناك عقاب صارم للأبوين، ولكن الشعب الصينى مطيع للأوامر ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء، وقد جعلت هذه المشكلة مشكلات اقتصادية واجتماعية كثيرة.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'الفكرة الرئيسة للفقرة السابقة هى :',
                    "pilihan" => [
                        "عدد سكان الصين ألف مليون نسمة.",
                        "تحديد النسل يكون عن طريق تحديد طفل واحد للأسرة.",
                        "زيادة السكان من أهم مشكلات معظم دول العالم.",
                        "القانون يعاقب من لايطيع قانون تحديد النسل.",
                    ],
                    "jawaban" => "زيادة السكان من أهم مشكلات معظم دول العالم.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'كيف حددت الصين النسل :',
                    "pilihan" => [
                        "طفل واحد لكل أسرة.",
                        "طفلين للأسرة.",
                        "طفلين للأسرتين.",
                        "ثلاثة أطفال للأسرة.",
                    ],
                    "jawaban" => "طفل واحد لكل أسرة.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'أدى تزايد السكان إلى :',
                    "pilihan" => [
                        "مشكلة اقتصادية",
                        "مشكلات اجتماعية",
                        "مشكلات سياسية",
                        "مشكلات اقتصادية واجتماعية",
                    ],
                    "jawaban" => "مشكلات اقتصادية واجتماعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'ولكن <u>الشعب</u> <u>الصينى</u> <u>مطيع</u> <u>للأوامر</u> ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء مشكلة اقتصادية. أين خبر لكنّ ؟',
                    "pilihan" => [
                        "للأوامر",
                        "الشعب",
                        "الصيني",
                        "مطيع",
                    ],
                    "jawaban" => "مطيع",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>مرحلة الشباب أهم مرحلة في حياة الإنسان، وأغلى ثروة عند الأمة. ومرحلة الشباب هي مرحلة العطاء والعمل. والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره. وكان كثير من أصحاب الرسول - صلى الله عليه وسلم - من الشباب، وقد ولاهم مسؤوليات كبيرة؛ حيث ولى كثيرا منهم قيادة الجيش، وفيه شيوخ المهاجرين والأنصار؛ فقد ولى زيد بن حارثة، وجعفر بن أبي طالب، وعبد الله بن أبي رواحة، قيادة الجيش في غزوة مؤتة، كما ولى أسامة بن زيد قيادة الجيش الإسلامي، لغزو الروم، وعمره ثماني عشرة سنة، وأرسل معاذ بن جبل قاضيا إلى اليمن، وهو في مرحلة الشباب.</p>
                    <p>تحتاج الأمة إلى الشاب القوي الجاد، الذي يعطي أكثر مما يأخذ، ولا تحتاج إلى الشاب الكسلان، الذي يهتم بطعامه ومظهره فقط، ولا يحب العمل والعطاء. وكما تحتاج الأمة إلى قوة الشباب، تحتاج إلى خبرة الشيوخ، حتى تتقدم البلاوتخطئ الأمة إذا اعتمدت على قوة الشباب وحدهم، وأهملت خبرات الشيوخ. وهذا يعني أن تكون هناك علاقة طيبة بين جميع أفراد المجتمع، كبارا وصغارا، رجالا ونساء، حتى تصل الأمة إلى ما تريد.</p>",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الرجولة",
                        "حياة الشباب",
                        "الحياة البشرية المتعددة ",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => ' ما المضاد من الكلمة " الشباب " حسب النص ؟',
                    "pilihan" => [
                        "الرجال",
                        "الأولاد",
                        "الشابة",
                        "الشيوخ",
                    ],
                    "jawaban" => "الشيوخ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "مرحلة الشباب ليست من  أهم مرحلة في حياة الإنسان",
                        "مرحلة الشباب هي مرحلة التنزه ",
                        "لا تحتاج الأمة إلى الشاب القوي الجاد",
                        "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                    ],
                    "jawaban" => "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'ما المرادف من كلمة " الثروة" في النص ؟',
                    "pilihan" => [
                        "الغني ",
                        "الفقر",
                        "المال",
                        "النقود",
                    ],
                    "jawaban" => "الغني ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'ما هو الذي تحتاجه الأمة من الشباب ؟',
                    "pilihan" => [
                        "تحتاج الأمة إلى الشاب القوي الجاد",
                        "الأمة تحتاج إلي الشباب الغني بالمال",
                        "الامة تحتاج إلي الشباب الكسلان",
                        "الامة تحتاج الي الشباب الغضبان",
                    ],
                    "jawaban" => "تحتاج الأمة إلى الشاب القوي الجاد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'المرادف من كلمة "العطاء " في النص ؟',
                    "pilihan" => [
                        "البخيل",
                        "المتكبر",
                        "الإحسان",
                        "الكسلان",
                    ],
                    "jawaban" => "الإحسان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => 'ما معنى "المرحلة" في هذه الفقرة ؟',
                    "pilihan" => [
                        "المستوى",
                        "الجامعة",
                        "الترتيب",
                        "الفروق",
                    ],
                    "jawaban" => "المستوى",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>النظافة نوعان؛ نظافة خاصة، ونظافة عامة. فالنظافة الخاصة نظافة جسم الإنسان وثوبه وطعامه وبيئته. أما النظافة العامة، فنظافة الأماكن العامة، كالشوارع والحدائق. وتقع مسؤولية النظافة الخاصة على الأفراأما مسؤولية النظافة العامة، فتقع على الأفراد والحكومات.</p>
                    <p>يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. وهناك دول مشهورة في العالم بالنظافة، وهي قليلة مثل ماليزيا وسنغافورة. وهناك دول أخرى مشهورة بالقذارة، وهي كثيرة.</p>
                    <p>تنفق بعض الدول أموالا كثيرة على النظافة، ونشاهد - الآن - في كل مدينة عمال النظافة، يجوبون الشوارع، يحملون حاويات النظافة، ويضعونها في سارات خاصة، تحملها خارج المدينة؛ لتحرق. ويشارك المواطن الدولة الاهتمام بالنظافة، حيث يضع النفايات الخاصة ببيته، والتي يجدها في الشوارع والحدائق في الحاويات، وهذا ما دعا إليه الرسول - صلى الله عليه وسلم - في قوله: (إماطة الأذى عن الطريق صدقة).</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كم نوعا من النظافة حسب النص ؟',
                    "pilihan" => [
                        "نظافة جسمية، ونظافة روحية ",
                        "نظافة غرفة، ونظافة بيت",
                        "نظافة خاصة، ونظافة خارجية",
                        "نظافة خاصة، ونظافة عامة",
                    ],
                    "jawaban" => "نظافة خاصة، ونظافة عامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "نظافة البيئة",
                        "نظافة البيت",
                        "نظافة الجسم",
                        "نظافة الأمة ",
                    ],
                    "jawaban" => "نظافة الأمة ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ما المراد بالناظافة الخاصة ؟',
                    "pilihan" => [
                        "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                        "نظافة قلب الانسان و روحه",
                        "نظافة فكر الانسان و حركته ",
                        "نظافة طعام الانسان وشربه",
                    ],
                    "jawaban" => "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'ما هي الدولة المشهورة في العالم بالنظافة حسب النص ؟',
                    "pilihan" => [
                        "ماليزيا وسنغافورة",
                        "مصر و يمان ",
                        "ج.عراق و إيران",
                        "تركي و يابان ",
                    ],
                    "jawaban" => "ماليزيا وسنغافورة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => 'ما المراد بالدولة المتحضرة حسب النص ؟',
                    "pilihan" => [
                        "الدولة وسكانها يهتمون بالنظافة",
                        "الدولة وسكانها يهتمون بالتقدم",
                        "الدولة وسكانها يهتمون بالمال",
                        "الدولة وسكانها يهتمون بالتربية",
                    ],
                    "jawaban" => "الدولة وسكانها يهتمون بالنظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'ماالمرادف بكلمة " القذارة " في النص ؟',
                    "pilihan" => [
                        "النظافة",
                        "الحديثة",
                        "الجديدة",
                        "الوسخة ",
                    ],
                    "jawaban" => "الوسخة ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>قال الرسول صلّى الله عليه وسلم : بينما رجل يمشي بطريق، اشتدّ عليه العطش، فوجد بئرا، فنزل فيها، فشرب منها ثمّ خرج، فإذا هو بكلب يلهث (يأكل الثرى من العطش) فقال : لقد بلغ هذا الكلب من العطش مثل الذي بلغ بي. فنزل البئر فملأ خفّه ماء، ثمّ أمسكه بفيه، ثمّ رقى، فسقى الكلب، فشكر الله له، فغفر له.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'ما العنوان المناسب لهذا الحديث ؟',
                    "pilihan" => [
                        "الرجل العطشان",
                        "الرفق بالحيوان",
                        "الكلب العطشان",
                        "البئر فى الطريق",
                    ],
                    "jawaban" => "الرفق بالحيوان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ما المرادف من "يلهث" في هذه القراءة ؟',
                    "pilihan" => [
                        "ظمئ",
                        "سبع",
                        "حزن",
                        "بكا",
                    ],
                    "jawaban" => "ظمئ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>هناك اختلافات كثيرة، بين التعليم في الماضي، والتعليم في الحاضر. ومن تلك الاختلافات، أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون، هم - في الغالب - أبناء الأغنياء وسكان المدن. أما اليوم، فقد أصبح التعليم حقا لكل مواطن. فكثر عدد الطلاب، وانتشرت المدارس في كل مكان، وشاع القول: "التعليم كالماء والهواء".</p>
                    <p>كان طلاب العلم - في الماضي - يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب؛ فكانوا يركبون الجمال أياما وأشهرا. أما ليوم، فالمدارس والجامعات كثيرة، في كل مدينة وقرية تقريبا، حيث يذهب الطالب إلى مدرسته، أو جامعته بالسيارة، أو سيرا على الأقدام. ومن ناحية أخرى، يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية.</p>
                    <p>من الاختلافات أيضا، أن المعلم كان لا يطلب أجرا على عمله في الماضي؛ لأنه كان يطلب الأجر من الله. وكان هدف الطالب طلب العلم. أما اليوم، فقد اختلف الأمر، فالمعلم يطلب كثيرا من الأجر، والطالب يفكر في الشهادة قبل العلم؛ لأنها وسيلة إلى العمل.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => ' كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت كثيرة  في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في المستقبل، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب كثيرون ",
                    ],
                    "jawaban" => "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'مالفرق بين التعليم في الماضي و التعليم في الحاضر حسب النص ؟',
                    "pilihan" => [
                        "التعليم في الحاضر  والتعليم في الماضي خاصة للأغنياء",
                        "التعليم في الحاضر للأغنياء والتعليم في الماضي لجميع الأفراد",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للمساكين",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                    ],
                    "jawaban" => "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'كيف كان الطلاب في الماضي حسب النص ؟',
                    "pilihan" => [
                        "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                        "يذهب الطالب إلى مدرسته، أو جامعته بالسيارة",
                        "يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية",
                        "كل العبارات صحيحة ",
                    ],
                    "jawaban" => "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'كيف كان المعلم في الماضي حسب النص ؟',
                    "pilihan" => [
                        "لا يطلب أجرا على عمله",
                        "يطلب أجرا على عمله ",
                        "يستخدمون الأدوات  المتحدثة في التعليم ",
                        "يعلم الطلاب عبر الشبكة الدولية",
                    ],
                    "jawaban" => "لا يطلب أجرا على عمله",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>العمل نعمة من نعم الله، ولا يعرف هذه النعمة، إلا من فقدها بسبب مرض، أو غيره. ومع ذلك فبعض النّاس لا يحبون العمل، ويعتمدون على غيرهم، أو يتسوّلون في الطريق. قال الرسول صلى الله عليه وسلم : ما أكل أحد طعاما قطّ خيرا من أن يأكل من عمل يده، وقال : لأن يأخذ أحدكم حبله، ثمّ يغدو إلى الجبل، فيحتطب، فيبيع، فيأكل، ويتصدّق خير له من أن يسأل النّاس.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'ما الفكرة الرئيسة في الفقرة السابقة ؟',
                    "pilihan" => [
                        "الناس لايعرف هذه النعمة",
                        "إنّ نبيّ الله داوود كان يأكل من عمل يده",
                        "بعض النّاس لا يحبون العمل",
                        "العمل خير في الحياة",
                    ],
                    "jawaban" => "العمل خير في الحياة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'الجملة المناسبة بالفقرة السابقة ؟',
                    "pilihan" => [
                        "ينبغي علينا أن نأكل مما كسبنا",
                        "ينبغي علينا أن نأكل ما أعطانا الجار",
                        "ينبغي علينا أن نأكل مما كسب الأب",
                        "ينبغي علينا أن نسأل الآخر",
                    ],
                    "jawaban" => "ينبغي علينا أن نأكل مما كسبنا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هناك خرافات تحدث دائما بين الآباء والأبناء. فالآباء ينظرون إلى الأبناء على أنهم كبار، وينسون فارقة السن بينهم، ويريدون من الأبناء أن يكونوا صورة ثانية منهم. والأبناء ينظرون إلى الأباء على أنهم من عصر قديم، وأنهم يفكرون تفكيرا متأخرا، ولايمكن أن يتفقوا معهم فى الرأى. وهذه هي أهم أسباب الخلاف. ولكن إذا نظر الأباء إلى أبنائهم نظرة أخرى ليفهموهم بطريقة أفضل، وإذا تذكروا كيف أنهم كانوا فى نفس هذا الموقف من آبائهم، لأدركوا أنهم يجب أن يغيروا معاملتهم لأبنائهم، ويكونوا أكثر صبرا وفهما. أما الأبناء فيجب أن يدركوا أن طاعة الوالدين من طاعة الله، أنهم فى كثير من الأحيان لايعرفون ماينفعهم وما يضرهم، وإذا أطاعوا أبويهم كان ذلك خيرا لهم وأفضل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => 'أفضل العنوان للفقرات السابقة :',
                    "pilihan" => [
                        "نظرة الآباء إلى الأبناء",
                        "نظرة الأبناء إلى الآباء",
                        "اختلاف الرأي بين الآباء والأبناء",
                        "تفكير الآباء المتأخر",
                    ],
                    "jawaban" => "اختلاف الرأي بين الآباء والأبناء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'خطأ الآباء فى نظرتهم للأبناء .......',
                    "pilihan" => [
                        "أنهم يأمرون أولادهم دائما بدون سبب",
                        "أنهم يحسبون جيدا فارقا لسن بينهم",
                        "أنهم ينظرون إلى الأبناء على أنهم كبار",
                        "أنهم لايحبون لأولادهم أن يكونوا مثلهم",
                    ],
                    "jawaban" => "أنهم ينظرون إلى الأبناء على أنهم كبار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'خطأ الأبناء فى نظرتهم الآباء ...........',
                    "pilihan" => [
                        "أنهم نالوا السهولة أن يتّفقوا معهم فى الرأي",
                        ". أن الآباء يفكرون تفكيرا متأخرا",
                        "أنّ الآباء يجب أن يكونوا أكثر صبرا",
                        "أن الآباء يتمنون لهم الخير",
                    ],
                    "jawaban" => ". أن الآباء يفكرون تفكيرا متأخرا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => 'التعبير المناسب من هذه القراءة ؟',
                    "pilihan" => [
                        "ينبغي على الأبناء أن يطيعوا آبائهم",
                        "ينبغي على الأبناء أن يرحوا آبائهم",
                        "ينبغي على الأبناء أن يستمعوا إلى آبائهم",
                        "ينبغي على الأبناء أن لا يطيعوا آبائهم",
                    ],
                    "jawaban" => "ينبغي على الأبناء أن يطيعوا آبائهم",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تأثّر العالم كثيرا – وخاصّة أوروبا – بحضارة المسلمين. وكان المسلمون في العصر العباسي، قد نشروا العلم والثقافة في مناطق واسعة، فقد وصلوا إلى الصين في الشّرق، وإلى بلاد السّودان في إفريقيا في الجانوب.</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'الفكرة الرئيسة في الفقرة السابقة تتحدّث عن ......',
                    "pilihan" => [
                        "انتشار الحضارة الإسلاميّة في العالم",
                        "انتشار الإسلام في العالم",
                        "انتشار العلم والثقافة في الصين",
                        "انتشار العلم والثقافة في أوروبا",
                    ],
                    "jawaban" => "انتشار الحضارة الإسلاميّة في العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين يقع بلاد السودان ؟',
                    "pilihan" => [
                        "في إفريقيا",
                        "في شرق الأوسط",
                        "في الدول الغربي",
                        "في آسيا",
                    ],
                    "jawaban" => "في إفريقيا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>فكّر صديقي <u>أن يترك</u> العمل في الحكومة، وأن يعمل<u> تاجرا</u>، وفعلا فتح محلا صغيرا، لبيع الملابس، وبدأ يعامل النّاس معاملة طيبة، يبيع لهم الملابس رخيصة، فاشتهر كثيرا بين النّاس. وبعد سنة ترك صديقي المحلّ الصّغير، وفتح محلا كبيرا في وسط المدينة، وبعد ثلاث سنوات أنشأ شركة كبيرة لصناعة الملابس. أصبح صديقي <u>من أغنياء المدينة</u>، وقد أحبّه النّاس كثيرا، فهو رجل كريم يساعد النّاس في بناء المساجد والمدارس والمستشفيات.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'كم سنة أنشأت تلك الشركة ؟',
                    "pilihan" => [
                        "سنة واحدة",
                        "ب.سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => 'وصف الرجل في هذه الفقرة بأنه رجل ؟',
                    "pilihan" => [
                        "جميل",
                        "شريف",
                        "حكيم",
                        "لطيف",
                    ],
                    "jawaban" => "شريف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => '"من أغنياء المدينة " ؟',
                    "pilihan" => [
                        "اسم أصبح",
                        "خبر أصبح",
                        "مبتدأ مؤخر",
                        "بدل",
                    ],
                    "jawaban" => "خبر أصبح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'ما عمل هذا الرجل قبل أن يكون تاجرا؟',
                    "pilihan" => [
                        "الموظف الحكومي",
                        "الموظف الأهلي",
                        "رجال العمل",
                        "مهندس",
                    ],
                    "jawaban" => "الموظف الحكومي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>حسن طالب إندونسي يدرس في الجامعة الإسلامية بالمدينة المنورة سافر حسن إلى المدينة المنورة قبل ثلاث سنوات لتعليم اللغة العربية ويدرس الإسلام. يتحدث حسن العربية الآن جيدا، وقد بدأ حفظ القرآن في بلده، والآن يحفظه كله. أصبح حسن الآن يفهم أحاديث الرسول صلى الله عليه وسلم، ويقرأ الكتب العربية والمجلات الأسبوعية والصحف اليومية. بعد هذه السنوات الثلاث يستطيع حسن أن يكتب باللغة العربية. فقد كتب إلى أصدقائه وقال لهم: "إن اللغة العربية لغة سهلة، وهي لغة العبادة لأكثر من مليار من المسلمين ولغة القرآن والإسلام.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => 'حسن طالب مسلم من اندونيسيا، وهي تقع في قارة ؟',
                    "pilihan" => [
                        "آسيا",
                        "أفريقا",
                        "أوربا",
                        "أوستراليا",
                    ],
                    "jawaban" => "آسيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => ' يدرس حسن في المرحلة ؟',
                    "pilihan" => [
                        "المتوسطة",
                        "الثانوية",
                        "الجامعية",
                        "الإبتدائية",
                    ],
                    "jawaban" => "الجامعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'متى حضر حسن الى المدينة المنورة؟',
                    "pilihan" => [
                        "قبل ثلاث سنوات",
                        "قبل أشهر",
                        "قبل سنتين",
                        "قبل أربع سنوات",
                    ],
                    "jawaban" => "قبل ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تخرج زوجتي كل يوم في الصّباح، ولا ترجع إلا في السّاعة الخامسة مساءً، هذه مشكلتي معها. نحن نتناول الوجبات خارج البيت: لأنّ زوجتي لا تجد وقتاً لإعداد الطّعام، وأنا أغسل ملابسي وملابس أبنائنا وحدي، وأنظّف البيت أحياناً بعد التدريس ظهرا. لا أجد وقتا للحديث معها في أمور البيت والأسرة: لأنها عندما ترجع تكون متعبةً  .أمّا في عطلة الأسبوع، فهي تحبّ أن تزور الأهل والصّديقات، أو تذهب إلى السّوق، أو تحضّر دروس الأسبوع القادم أو تعالج المرضى في البيت.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'ماذا تعمل هذه الزّوجة ..؟',
                    "pilihan" => [
                        "موظّفة",
                        "مدرّسة",
                        "ممرّضة",
                        "طبيبة",
                    ],
                    "jawaban" => "طبيبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => ' ماذا يعمل هذا الزّوج....؟',
                    "pilihan" => [
                        "طبيبا",
                        "طيارا",
                        "مدرسا",
                        "فلاحا ",
                    ],
                    "jawaban" => "مدرسا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'يعمل الزّوج في ....؟',
                    "pilihan" => [
                        "الصبّاح",
                        "المساء",
                        "الصّباح والمساء",
                        "غير معين",
                    ],
                    "jawaban" => "الصبّاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'متى تعود الزّوجة إلى البيت  ؟',
                    "pilihan" => [
                        "بعد العصر",
                        "بعد الظّهر",
                        "بعد المغرب",
                        "بعد العشاء",
                    ],
                    "jawaban" => "بعد العصر",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>إختبار  اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "إبراهيم طالب ماهر",
                        "إبراهيم أمهر من الآخرين",
                        "الآخرون أمهر من إبراهيم",
                        "طالب أمهر إبرهيم",
                    ],
                    "jawaban" => "إبراهيم أمهر من الآخرين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                        "الأستاذ يحضر في حفلة استقبال الطلاب الجدد",
                        "أن الأستاذ يوجد في حفلة استقبال الطلاب الجدد",
                        "لا توجد حفلة استقبال الطلاب الجدد",
                    ],
                    "jawaban" => "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سيصبح طبيبا",
                        "إنه ليس طبيب",
                        "إنه طبيب",
                        "هو سيكون طبيبا",
                    ],
                    "jawaban" => "إنه طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "لاعب كرة القدم",
                        "حارس المرمى",
                        "مشاهد",
                        "مدرب",
                    ],
                    "jawaban" => "مدرب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "سيسكن في الفندق",
                        "سيأكل في المطعم",
                        "سيستأجر السيارة",
                        "سيذهب إلى خارج البلاد",
                    ],
                    "jawaban" => "سيسكن في الفندق",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "هو ذاهب إلى الجامعة",
                        "هو لا يريد أن يذهب إلى الجامعة",
                        "هو لا يذهب إلى الجامعة بسبب المطر",
                        "المطر غزير حتى الآن",
                    ],
                    "jawaban" => "هو لا يذهب إلى الجامعة بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة السادسة والنصف",
                        "في الساعة السابعة",
                        "في الساعة السابعة والنصف",
                    ],
                    "jawaban" => "في الساعة السادسة والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "لغة النبي",
                        "أهمية اللغة العربية",
                        "نشأة اللغة العربية",
                        "اللغة الأجنبية",
                    ],
                    "jawaban" => "نشأة اللغة العربية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب أهم مرحلة",
                        "مرحلة الشباب غير مهم",
                        "مرحلة الشباب مرحلة طويلة",
                        "مرحلة الشباب كمرحلة الشيوخة",
                    ],
                    "jawaban" => "مرحلة الشباب أهم مرحلة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "عشرون",
                        "واحدة و عشرون",
                        "اثنتان و عشرون",
                        "ثلاث و عشرون",
                    ],
                    "jawaban" => "ثلاث و عشرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة كتب",
                        "خمسة كتب",
                        "ستة كتب",
                        "كتابين",
                    ],
                    "jawaban" => "ستة كتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "يحاول أن يكون تاجرا",
                        "يحاول أن يكون موظفا حكوميا",
                        "يحاول أن يكون مهندسا",
                        "يحاول أن يكون طبيبا",
                    ],
                    "jawaban" => "يحاول أن يكون موظفا حكوميا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "اثنتا عشرة سنة",
                        "تسع سنوات",
                        "ست سنوات",
                        "ثلاث سنوات",
                    ],
                    "jawaban" => "اثنتا عشرة سنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "الأب يمنع الأولاد اللعب في الصباح",
                        "الأب يمنع الأولاد اللعب في النهار",
                        "الأب يمنع الأولاد اللعب في المساء",
                        "الأب لا يمنع الأولاد اللعب في المساء",
                    ],
                    "jawaban" => "الأب يمنع الأولاد اللعب في المساء",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "باخرة",
                        "الجوال",
                        "سيارة كبيرة",
                    ],
                    "jawaban" => "الجوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "رمضان",
                        "شعبان",
                        "شوال",
                        "رجب",
                    ],
                    "jawaban" => "شعبان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "مائة ألف",
                        "مائتي ألف",
                        "ثلاثمائة ألف",
                        "أربمعمائة ألف",
                    ],
                    "jawaban" => "مائتي ألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سعيد لأن السماء مظلم",
                        "إنه سعيد لأن السماء بيضاء",
                        "إنه سعيد لأن السماء ممطر",
                        "إنه سعيد لأن السماء واضح",
                    ],
                    "jawaban" => "إنه سعيد لأن السماء واضح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الشيوخ",
                        "مرحلة الطفولة",
                        "مرحلة الدراسة",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "موظف",
                        "أستاذ",
                        "دكتور",
                        "طالب",
                    ],
                    "jawaban" => "طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "مهندس",
                        "مدرس",
                        "تاجر",
                        "فلاح",
                    ],
                    "jawaban" => "فلاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "يومين",
                        "ثلاثة أيام",
                        "أربعة أيام",
                    ],
                    "jawaban" => "يومين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "طالبة",
                        "مدرسة",
                        "طبيبة",
                        "ممرضة",
                    ],
                    "jawaban" => "مدرسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة وأمها",
                        "الابنة وأبها",
                        "الابنة وأختها",
                        "الابنة وجدتها",
                    ],
                    "jawaban" => "الابنة وأمها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "مريم وأبوها",
                        "مريم وأمها",
                        "مريم وصديقها",
                        "مريم وأختها",
                    ],
                    "jawaban" => "مريم وصديقها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "في المسجد",
                        "في البيت",
                        "الجامعة",
                        "الفصل",
                    ],
                    "jawaban" => "في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "سيارة",
                        "قلنسوة",
                        "مسطرة",
                        "شنطة",
                    ],
                    "jawaban" => "شنطة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "في شهر يناير",
                        "في شهر مارس",
                        "في شهر يوني",
                        "في شهر أغسطس",
                    ],
                    "jawaban" => "في شهر يوني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في التلفون",
                        "في السوق",
                        "في المدرسة",
                    ],
                    "jawaban" => "في التلفون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>لإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في الجامعة الإسلامية",
                        "في المدرسة المتوسطة",
                        "في الجامعة الأهلية",
                        "في المدرسة الثانوية",
                    ],
                    "jawaban" => "في الجامعة الإسلامية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مدرّس",
                        "هو ممرض",
                        "هو مهندس",
                        "هو طبيب",
                    ],
                    "jawaban" => "هو طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "في المدينة",
                        "في القرية",
                        "في قمة الجبل",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "في المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "من حديد",
                        "من بلاستيك",
                        "من جلد",
                        "من خشب",
                    ],
                    "jawaban" => "من خشب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "حديقة كبيرة",
                        "حديقة صغيرة",
                        "حديقة واسعة",
                        "حديقة نظيفة",
                    ],
                    "jawaban" => "حديقة كبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "في المدرسة",
                        "في الجامعة",
                        "في المستشفى",
                        "في المطعم",
                    ],
                    "jawaban" => "في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "شيء جميل",
                        "شيء كبير",
                        "شيء رائع",
                        "شيء ممل",
                    ],
                    "jawaban" => "شيء رائع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "إلى المطعم",
                        "إلى الدكان",
                        "إلى المكتبة",
                        "إلى النهر",
                    ],
                    "jawaban" => "إلى المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "نعم، توجد المكتبة",
                        "نعم، لا توجد المكتبة",
                        "لا، توجد المكتبة",
                        "لا، لا توجد المكتبة",
                    ],
                    "jawaban" => "نعم، توجد المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "داخل الجامعة",
                        "تحت الأشجار الكبيرة",
                        "جانب المسجد",
                        "وراء البيت",
                    ],
                    "jawaban" => "تحت الأشجار الكبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الأربعاء",
                        "في يوم الخميس",
                        "في يوم الجمعة",
                        "في يوم السبت",
                    ],
                    "jawaban" => "في يوم الجمعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الشقة الجميلة",
                        "عمل ميرم",
                        "المطار وما فيه",
                        "الاستقبال في المطار",
                    ],
                    "jawaban" => "الاستقبال في المطار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "إلى الجامعة",
                        "إلى الفندق",
                        "المطعم",
                        "الحمام",
                    ],
                    "jawaban" => "إلى الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "طعام لذيذ",
                        "طعاما غربيا",
                        "طعاما شرقيا",
                        " طعام إندويسي",
                    ],
                    "jawaban" => "طعاما شرقيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "كمترجمة في السفارة",
                        "كمدرسة في المدرسة",
                        "كموظفة حكومية",
                        "كموظفة أهلية",
                    ],
                    "jawaban" => "كمترجمة في السفارة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في الفندق",
                        "في المطعم",
                        "في الغرفة",
                    ],
                    "jawaban" => "في الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "نعم الإنترنيت موجود",
                        "نعم الإنترنيت غير موجود",
                        "لا، الإنترنيت موجود",
                        "الإنترنيت موجود لكن قليل",
                    ],
                    "jawaban" => "نعم الإنترنيت موجود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في المساء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "غرفة لشخصين",
                        "غرفة لشخص",
                        "غرفة لثلاثة أشخاص",
                        "غرفة لأربعة أشخاص",
                    ],
                    "jawaban" => "غرفة لشخص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "قال تعالى : { و لا تمش في الأرض مرحا } كلمة مرحا هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "قال تعالى : { إن الله لا يستحيٓ أن يضرب مثلا ما بعوضة فما فوقها } فعل يستحيٓ في الآية الكريمة مضارع معتال الآخر :",
                    "pilihan" => [
                        "مرفوع و علامة رفعه ضمة ظاهرة",
                        "مجزوم وعلامة جزمه حذف حرف علة وهي الواو",
                        "مرفوع و علامة رفعه ضمة مقدرة",
                        "محزوم وعلامة جزمه حذف حرف علة وهي الألف",
                    ],
                    "jawaban" => "مرفوع و علامة رفعه ضمة مقدرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "بين هذه الجمل جملة صحيحة هي؟",
                    "pilihan" => [
                        "انتشر فايروس كورونا في الكل العالم",
                        "انتشر فايروس كورونا في الكل عالم",
                        "انتشر فايروس كورونا في كل العالم",
                        "انتشر فايروس كورونا في كل عالما",
                    ],
                    "jawaban" => "انتشر فايروس كورونا في كل العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "في مكة المكرمة كعبة. كلمة (كعبة) في الجملة؟ ",
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "خبر مقدم مرفوع بالضمة",
                        "مبتدأ مرفوع بالضمة المقدرة",
                        "مبتدأ مرفوع بالضمة الظاهرة",
                    ],
                    "jawaban" => "مبتدأ مرفوع بالضمة الظاهرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال تعالى : إن يشأ يذهبكم. كلمة (يذهبكم) في الجملة؟",
                    "pilihan" => [
                        "استدراكية",
                        "جواب الشرط",
                        "استئنافية",
                        "سببية",
                    ],
                    "jawaban" => "جواب الشرط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "تسكن عائلة أحمد في شقة بسيطة. كلمة أحمد؟",
                    "pilihan" => [
                        "مجرور بالفتحة",
                        "مجرور بالكسرة",
                        "منصوب بالفتحة",
                        "منصوب بالكسرة",
                    ],
                    "jawaban" => "مجرور بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "..... الأمة إلى الشاب القوي الجاد",
                    "pilihan" => [
                        "نحتاج",
                        "أحتاج",
                        "تحتاج",
                        "يحتاج",
                    ],
                    "jawaban" => "تحتاج",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "..... معاذ بن جبل قاضيا إلى اليمن",
                    "pilihan" => [
                        "أرسلتْ",
                        "أرسلتا",
                        "أرسل",
                        "أرسلا",
                    ],
                    "jawaban" => "أرسل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "مشكلة أحمد ...  عن مشكلة حسن",
                    "pilihan" => [
                        "يختلف",
                        "يختلفان",
                        "يختلفون",
                        "تختلف",
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "...... الشوارع مبسوطة في فترة جوكو ويدودو",
                    "pilihan" => [
                        "كان",
                        "كانا",
                        "كانوا",
                        "كانت",
                    ],
                    "jawaban" => "كانت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "قال : في ثلاثة مواضع أشد استحبابا. كلمة (استحبابا) هي:",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "يشارك المواطن الدولة الإهتمام ... النظافة",
                    "pilihan" => [
                        "على",
                        "في",
                        "عن",
                        "الباء",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "سأزورك غدا ... الطعام",
                    "pilihan" => [
                        "إذن سأعدّك",
                        "إذن ستعدّك",
                        "إذن سأعدّه",
                        "إذن سأعدّها",
                    ],
                    "jawaban" => "إذن سأعدّك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "كان هدف الطالب طلب العلم. الخبر في هذه الجملة؟",
                    "pilihan" => [
                        "كان",
                        "هدف",
                        "الطالب",
                        "طلب العلم",
                    ],
                    "jawaban" => "طلب العلم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "انتشر الخبر ... الناس",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'شرح الأستاذ الدرس اليوم شرحا واضحا. "واضحا" في هذه الجملة؟',
                    "pilihan" => [
                        "نعت",
                        "ظرف",
                        "مفعول به",
                        "حال",
                    ],
                    "jawaban" => "نعت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "التحق ... المدراسة في الوقت المناسب",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "قال تعالى :{وورث سليمان داوود}. كلمة داوود في الآية الكريمة هي؟",
                    "pilihan" => [
                        "فاعل",
                        "مفعول الذي لم يسم فاعله",
                        "مفعول به",
                        "مفعول له",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "قال تعالى :{فمنهم من يمشي على بطنه}. (من) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "استفهامية",
                        "موصولة",
                        "شرطية",
                        "زائدة",
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "قال تعالى :{وفجرنا الأرض عيونا}. كلمة (عيونا) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول له",
                        "حال",
                        "تمييز",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'كان الطلاب يريدون أن ينالوا مهنة طيبة وشريفة. ما الجمع من "مهنة"؟',
                    "pilihan" => [
                        "مهن",
                        "مهنات",
                        "ميهان",
                        "مهنة",
                    ],
                    "jawaban" => "مهن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "خير ... من يدلك على الخير",
                    "pilihan" => [
                        "الصحيب",
                        "الصحيبان",
                        "الصحيبون",
                        "الأصحاب",
                    ],
                    "jawaban" => "الأصحاب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "تمسك المسلمون على القرآن الكريم",
                        "تمسك المسلمون في القرآن الكريم",
                        "تمسك المسلمون بالقرآن الكريم",
                        "تمسك المسلمون إلى القرآن الكريم",
                    ],
                    "jawaban" => "تمسك المسلمون بالقرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعدها",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                    ],
                    "jawaban" => "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "يبيع البائع سلعته في السوق",
                        "يبيعان البائع سلعته في السوق",
                        "تبيع البائع سلعته في السوق",
                        "تبيعان البائع سلعته في السوق",
                    ],
                    "jawaban" => "يبيع البائع سلعته في السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "<u>زعمت</u> <u>أحمد</u> <u>حاضر</u> في <u>هذا</u> اللقاء. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "زعمت",
                        "أحمد",
                        "حاضر",
                        "هذا",
                    ],
                    "jawaban" => "حاضر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "<u>أصبحت</u> <u>الحق</u> بعدما <u>ساد</u> <u>الظلم</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "أصبحت",
                        "الحق",
                        "ساد",
                        "الظلم",
                    ],
                    "jawaban" => "أصبحت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "إنك <u>تعمل</u> وكأن <u>عملك</u> <u>بنيانا</u> <u>راسخ</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "تعمل",
                        "عملك",
                        "بنيانا",
                        "راسخ",
                    ],
                    "jawaban" => "بنيانا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "<u>ليتها</u> <u>كانت</u> <u>سمع</u> <u>كلآمي</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "ليتها",
                        "كانت",
                        "سمع",
                        "كلآمي",
                    ],
                    "jawaban" => "سمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "<u>حاول</u> أحمد أن <u>يتعلم</u> <u>لغتين</u> <u>أجنبية</u> عربية و إنجليزية. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "حاول",
                        "يتعلم",
                        "لغتين",
                        "أجنبية",
                    ],
                    "jawaban" => "أجنبية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "<u>دعا</u> <u>الإسلام</u> <u>في</u> <u>النظافة</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "دعا",
                        "الإسلام",
                        "في",
                        "النظافة",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "وحث <u>الإسلام</u> المسلم على نظافة <u>جسده</u> وملبسه ومسكنه وبيئته التي <u>يعيش</u> <u>فيه</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "الإسلام",
                        "جسده",
                        "يعيش",
                        "فيه",
                    ],
                    "jawaban" => "فيه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "قبل الدخول - أهم مرحلة - في الحياة الزوجة - اختيار الزوجة",
                    "pilihan" => [
                        "أهم مرحلة احتيار الزوجة في الحياة الزوجة قبل الدخول",
                        "في الحياة الزوجة أهم مرحلة قبل الدخول احتيار الزوجة",
                        "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                        "قبل الدخول أهم مرحلة في الحياة الزوجة احتيار الزوجة",
                    ],
                    "jawaban" => "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "تكمل - إن - إيمانك - تزوجت - وحياتك <br>الترتيب الصحيح من الكلمات السابقة هو....",
                    "pilihan" => [
                        "تكمل إيمانك إن تزوجت وحياتك",
                        "تزوجت إيمانك وحياتك إن تكمل",
                        "إيمانك و حياتك تكمل إن تزوجت",
                        "إن تزوجت تكمل إيمانك وحياتك",
                    ],
                    "jawaban" => "إن تزوجت تكمل إيمانك وحياتك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "تنجح - حتى - في الإمتحان - تعلم - العربية <br>الترتيب الصحيح من الكلمات السابقة هو...",
                    "pilihan" => [
                        "تعلم في الإمتحان حتى تنجح العربية",
                        "تعلم العربية حتى تنجح في الإمتحان",
                        "العربية في الإمتحان تنجح حتى تعلم",
                        "في الإمتحان تنجح حت تعلم العربية",
                    ],
                    "jawaban" => "تعلم العربية حتى تنجح في الإمتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "والمرأة لا ينبغي لها أن تقبل من الأزواج . إلا من هو على خلق ودين. قال صلى الله عليه وسلم :( إذا أتاكم من ترضون خلقه ودينه فزوجوه. إن لا تفعلوا تكن فتنة في الأرض وفساد عريض). جملة الشرط في هذ الحديث هي؟",
                    "pilihan" => [
                        "المرأة لا ينبغي لها",
                        "إلا من هو على خلق ودين",
                        "قال صلى الله عليه وسلم",
                        "إذا أتاكم من ترضون خلقه ودينه",
                    ],
                    "jawaban" => "إذا أتاكم من ترضون خلقه ودينه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "هوايتي الجديدة هي أن ... إلى الخبر من راديو كل العطلة",
                    "pilihan" => [
                        "يستمع",
                        "تستمع",
                        "أستمع",
                        "نستمع",
                    ],
                    "jawaban" => "أستمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'المسلمون يتبعون المذاهب الأربعة. ما المفرد من "المذاهب"؟',
                    "pilihan" => [
                        "مذهب",
                        "مذهبة",
                        "هذب",
                        "ذهب",
                    ],
                    "jawaban" => "مذهب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "تحتوي معظم <u>الوجبات</u> السريعة على نسبة كبيرة من الكربوهيدرات. الكلمة التي تحتها خط تعني؟ ",
                    "pilihan" => [
                        "الوظيفة",
                        "الأعمال",
                        "الأكلات",
                        "المفروضة",
                    ],
                    "jawaban" => "الأكلات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'تعلموا العربية لأنها جزء من من دينكم. ما الجمع من "جزء"؟',
                    "pilihan" => [
                        "أجزاء",
                        "جزوء",
                        "جزاء",
                        "أجزيات",
                    ],
                    "jawaban" => "أجزاء",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>النص الأول :</center></p>
                    <p>ذهبت نملة صغيرة الى جدول ماء لتشرب وتستريح، بعد أن تعبت كثيرا فى جمع قوتها. فزلت قدمها وسقطت فى الماء، ولم يمكنها الخروج منه لأنها لا تعرف السباحة وكادت تغرق. وكانت حمامة بيضاء جميلة واقفة على حجر فى الماءن ورأت ما حصل للنملة. فرق لها قلبها وسعت فى خلاصها، فطارت الى البر ورجعت، وفى منقارها عود من الحشيش، مدته على الماء الى البر. فتعلقت به النملة وخرجت من الماء بسلام.</p>
                    <p>وفى يوم التالى، نزلت الحمامة على فرع شجرة تتظلل بأوراقها. فمر صياد من بعد ورآها. فوقف يصيب بندقية نحوها ليصيدها، وهي لم ترها فتطير. ولكن النملة التى خلصتها تلك الحمامة رأت الصياد وعرفت ما عزم عليه، فصعدت فى جسمه. ولما هم بإطلاق بندوقية، فرصته قرصة شديدة أفزعته، فتحرك فمالت الرصاصة ولم تصب الحمامة، بل نجت جزاء إحسانها الى النملة. </p>
                    <p>اختر أصح الأجوبة الآتية </p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين وقفت الحمامة ؟",
                    "pilihan" => [
                        "على الأشجار",
                        "على الماء",
                        "على الأوراق",
                        "على الحجر",
                    ],
                    "jawaban" => "على الحجر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "ذهبت النملة الصغيرة الى جدول لأن ......؟",
                    "pilihan" => [
                        "تريد النملة أن تشرب وتستريح",
                        "تريد الحمامة أن تلتقى بها",
                        "الصياد يصوب بندوقية",
                        "تغرق الحمامة",
                    ],
                    "jawaban" => "تريد النملة أن تشرب وتستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "لماذا يصوب الصياد البندوقية ؟",
                    "pilihan" => [
                        "لأنه سيصيد النملة",
                        "لأنه سيستريح فى الغابة",
                        "لأنه سيصيد الحمامة",
                        "لأنه سيذهب الى الجدول",
                    ],
                    "jawaban" => "لأنه سيصيد الحمامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " الرجل الذى كانت حرفته صيد الحيوان يسمى بــــــــــ........؟",
                    "pilihan" => [
                        "الراعى",
                        "الصياد",
                        "أهل الحيوان",
                        "صاحب الحيوان",
                    ],
                    "jawaban" => "الصياد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "صعدت النملة فى جسم الصياد لـــــــــــ.....؟",
                    "pilihan" => [
                        "يقتله",
                        "نجدته",
                        "تأكل",
                        "قرصته",
                    ],
                    "jawaban" => "قرصته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "كيف الحمامة عندما ترى النملة تقع فى الماء ؟",
                    "pilihan" => [
                        "رق لها قلبها وسعت فى خلاصها",
                        "تدعو الصياد لنجدتها",
                        "نزلت الحمامة على فرع شجرة",
                        "ترجع الى القفص ولا تبالى",
                    ],
                    "jawaban" => "رق لها قلبها وسعت فى خلاصها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لا تستطيع النملة الخروج من الماء لأنها ؟",
                    "pilihan" => [
                        "تشرب الماء",
                        "تقرص الصياد",
                        "لا تعرف السباحة",
                        "تساعد الحمامة",
                    ],
                    "jawaban" => "لا تعرف السباحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "كيف تخرج النملة من الماء؟",
                    "pilihan" => [
                        "تدعو الحمامة",
                        "تتعلق بعود من الحشيش",
                        "تقرص الصياد",
                        "تشرب الماء",
                    ],
                    "jawaban" => "تتعلق بعود من الحشيش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "أين المكان الذي يصود الصياد الحمامة ؟",
                    "pilihan" => [
                        "الغابة",
                        "النهر",
                        "الشجر",
                        "البر",
                    ],
                    "jawaban" => "الغابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كيف تجزى النملة إحسان الحمامة ؟",
                    "pilihan" => [
                        "زلت قدمها الى الماء",
                        "تسلمها من الصياد",
                        "تخرج من الماء",
                        "تأخذ عود من الحشيش",
                    ],
                    "jawaban" => "تسلمها من الصياد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الثانى :</center></p>
                    <p>كان مُصوِّر مسافرا وهو يحمل مبلغا كبيرا من النقود، في كيس علقه حول عنقه. فنزل ليلا ببلد لم يجد فيه خانا، فأنزله أحد الأهالي ضيفا عنده. ولما رأى أنه يحمل ذلك المال الكثير، لبث يرقبه حتى نام، ودخل عليه حجرته يستق الخطى لكيلا يستيقظ، وسلبه المال، وحمله بلطف وخفةن وألقاه فى الطريق بعيدا عن الدار. ولما استيقظ الرجل من نومه فى الصباح، وجد نفسه فى الطريق ولا مال معه. فذهب الى الحاكم وشكا اليه أمره. فسأل الحاكم: "أتعرف من مضيفك بالأمس؟" فقال: "لا، لكنّي مصور ماهر، أستطيع أن أصور لك أهل البيت الذى كنت فيه فتعرفهم أنت وعمالك"</p>
                    <p>ثم اختلى المصور فى غرفة، وصور كل أعضاء تلك الأسرة الخائنة. فعرضت الصورة على الأهالي فعرفهم، وجائوا بهم الى الحاكم، فأقروا بذنبهم، وردوا المال الى صاحبه، وعاقبهم الحاكم عقابا شديدا، لأنهم خانوا على من ائتمنهم على نفسه وماله </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ماذا يحمل المصور في السفار ؟",
                    "pilihan" => [
                        "مبلغ كبير من النقود",
                        "مبلغ كبير من القرطاس",
                        "مبلغ كبير من الرغيف",
                        "مبلغ كبير من اللباس",
                    ],
                    "jawaban" => "مبلغ كبير من النقود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "صور المصور أعضاء الأسرة الخائنة لأن ؟",
                    "pilihan" => [
                        "تضع الصورة على الجدار",
                        "تساعد المصور فى السفر",
                        "يريد قبض الأسرة الخائنة",
                        "يضع الصورة فى المعرض",
                    ],
                    "jawaban" => "يريد قبض الأسرة الخائنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "أين ذهب المصور بعد ما سلبت ماله ؟",
                    "pilihan" => [
                        "المقهى",
                        "الحاكم",
                        "المسجد",
                        "الخان",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما الذى سلب من المصور ؟",
                    "pilihan" => [
                        "الملابس",
                        "الخان",
                        "المال",
                        "الصورة",
                    ],
                    "jawaban" => "المال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "كيف حال المصور بعد ما استيقظ من النوم؟",
                    "pilihan" => [
                        "لا مال معه",
                        "لا لباس معه",
                        "لا فراش معه",
                        "لا أهل معه",
                    ],
                    "jawaban" => "لا مال معه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ماذا فعل المصور عن هذه المصيبة ؟",
                    "pilihan" => [
                        "بكى وعاد الى بيته",
                        "حمل المال فى كيس",
                        "رد المال الى الحاكم",
                        "شكا الى الحاكم عن أمره",
                    ],
                    "jawaban" => "شكا الى الحاكم عن أمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "الرجل الذي عدل العدالة يسمى بــــــــــ......؟",
                    "pilihan" => [
                        "النائب",
                        "الحاكم",
                        "المدرس",
                        "المسافر",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "فذهب الى الحاكم وشكا اليه <u>أمره</u>. الضمير الذي تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "أهل البيت",
                        "المضيف",
                        "المصور",
                        "الأهالى",
                    ],
                    "jawaban" => "المصور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أدرك المصور من نومه أنه؟ ",
                    "pilihan" => [
                        "فى الحكومة",
                        "فى الطريق",
                        "فى البيت",
                        "فى الغرفة",
                    ],
                    "jawaban" => "فى الطريق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "لا يدرك المصور أنه سلبه المال لأن ؟",
                    "pilihan" => [
                        "يصور",
                        "يسافر",
                        "يشكو",
                        "ينام",
                    ],
                    "jawaban" => "ينام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>النص الثالث: </p>
                    <p>كان عمر بن الخطاب (ض) رجلا شجاعا، وعندما أراد الهجرة من مكة الى المدينة، حمل سيفه وذهب ال الكعبة وطاف حول اليت سبعة أشواط ثم صلى الله.</p>
                    <p>وفى إحدى الليالي، خرج عمر يتفقده أحوال المسلمين وكان البرد شديدا فى تلك الليلة. شاهد عمر نارا فى الطريق، فأسرع اليها وعندما أقرب من النار رأى امرأة تجلس هي وأطفالها حول قدر على النار. وكان الأطفال يبكون ويصرخون. اقترب عمر من المرأة وقال لها: "السلام عليكم". فقالت له: "وعليكم السلام". ثم سألها: "لماذا يبكي هؤلاء الأطفال ؟ فأجبته: "إنهم جائعون". قال لها: وماذا فى القدر ؟ قالت له: فيه ماء يغلى، يستمع الأطفال الى صوته فينامون". انطلق عمر الى بيت الدقيق وأحضر دقيقا وزيتا. فتح عمر القدر وصب فيه الدقيق وعندما نضج طلب منها طبقا، صب فيه الطعام ثم طلي منها أن تطعم أطفالها. أكل الأطفال حتى شبعوا ثم أخذوا يضحكون ويلعبون حتى ناموا. شكرت المرأة عمر وقالت له: "جزاك الله خيرا"</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "كيف الجو حين يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "هادئ",
                        "جاف",
                        "بريد شديد",
                        "حار شديد",
                    ],
                    "jawaban" => "بريد شديد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "اقترب عمر من المرأة لأن ؟",
                    "pilihan" => [
                        "الأطفال يبكون ويصرخون",
                        "صب الرقيق والزيت فى القدر",
                        "الأطفال يضحكون حتى ناموا",
                        "أحضر دقيقا وزيتا",
                    ],
                    "jawaban" => "الأطفال يبكون ويصرخون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كم شوطا طاف عمر حول البيت قبل صلى الله ؟",
                    "pilihan" => [
                        "خمسة أشواط",
                        "ستة أشواط",
                        "سبعة أشواط",
                        "ثمانية أشواط",
                    ],
                    "jawaban" => "سبعة أشواط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "متى يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "فى صباح مبكر",
                        "فى الليل",
                        "فى النهار",
                        "فى المساء",
                    ],
                    "jawaban" => "فى الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "ماذا تطبخ المرأة لأطفالها قبل مجيئ عمر ؟",
                    "pilihan" => [
                        "الرز",
                        "الرغيف",
                        "البيض",
                        "الماء",
                    ],
                    "jawaban" => "الماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "عمر رجل شجاع ويريد أن يهجر من",
                    "pilihan" => [
                        "الشام الى المكة",
                        "المدينة الى المكة",
                        "المكة الى المدينة",
                        "المكة الى الشام",
                    ],
                    "jawaban" => "المكة الى المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "تطبخ المرأة الماء لأطفالها لأن ؟",
                    "pilihan" => [
                        "لا دقيقا ولا زيتا لها",
                        "تحب الماء المغلى",
                        "تصنع اللبن لأطفالها",
                        "تغتسل به لأن الجو بارد",
                    ],
                    "jawaban" => "لا دقيقا ولا زيتا لها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "صب <u>فيه</u> الطعام ثم طلب منها أن تطعم أطفالها. الضمير الذى تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "الأطفال",
                        "الماء",
                        "الدقيق",
                        "الطبق",
                    ],
                    "jawaban" => "الأطفال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "من القصة السابقة عرفنا أن عمر ؟",
                    "pilihan" => [
                        "سخي للمساكين",
                        "خبير بما يعملون",
                        "بخيل",
                        "متكبر",
                    ],
                    "jawaban" => "سخي للمساكين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "ماذا يشعر الأطفال بعد ما أكلوا الطعام ؟",
                    "pilihan" => [
                        "يحزنون",
                        "يفرحون",
                        "يقلقون",
                        "يخافون",
                    ],
                    "jawaban" => "يفرحون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الرابع </center></p>
                    <p>في البيت أب وأم، ولكل واحد منهما عمل خاص. اشتغل الأب خارج البيت. فذهب الى الحقول أو الى المزارع أو قصد سوقا أو دكانا للتجارة أو توظف فى بعض الدواوين أو علم فى المدارس. وليست الأم مثل ذلك بل هي اشتغلت فى المنزل فرتب كل شيئ فى البيت ونظفته وغسلت الملابس الواسخة. ثم استعدت وابتدأت فى الطهي. أتمت الأم تلك الأعمال الكثيرة هي وحدها. أو ساعدتها ابنة لها،ثم استرحت من الأعمال. </p>
                    <p>فالواجب عليك أيتها الفتاة المتعلمة الإخلاص فى خدمة الأم. فإذا اشتغلت معها وقبلت منها الإرشادات تقدمت وربحت بالعلوم والتجارب ربحا عظيما. </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "أين يشتغل الأب كل يوم ؟",
                    "pilihan" => [
                        "في البيت",
                        "في المزرعة",
                        "خارج البيت",
                        "فى السوق",
                    ],
                    "jawaban" => "خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "تعمل الأم عمل البيت وتسمى بــــــــــ......؟ ",
                    "pilihan" => [
                        "تاجرة",
                        "ربة البيت",
                        "عمال",
                        "موطفة",
                    ],
                    "jawaban" => "ربة البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا تعمل الأم بعد ما أتمت من الأعمال الكثيرة ؟ ",
                    "pilihan" => [
                        "تغسل الملابس",
                        "تنظف البيت",
                        "تربي أبنائها",
                        "تستريح",
                    ],
                    "jawaban" => "تستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "أين توظف الأب ؟",
                    "pilihan" => [
                        "السوق",
                        "المزرعة",
                        "بعض الدواوين",
                        "الدكان",
                    ],
                    "jawaban" => "بعض الدواوين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "لا تعمل الأم خارج البيت لأن ؟",
                    "pilihan" => [
                        "تنام فى البيت",
                        "تشتغل فى عمل البيت",
                        "تستريح فى البيت",
                        "تغسل الملابس",
                    ],
                    "jawaban" => "تشتغل فى عمل البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "أين يعمل الأب التجارة ؟",
                    "pilihan" => [
                        "السوق",
                        "المدرسة",
                        "الحقول",
                        "المزارع",
                    ],
                    "jawaban" => "السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "أين اشتغلت الأم كل يوم ؟",
                    "pilihan" => [
                        "المزرعة",
                        "السوق",
                        "المدرسة",
                        "البيت",
                    ],
                    "jawaban" => "البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "من التى تساعد الأم فى عملية البيت ؟",
                    "pilihan" => [
                        "الأب",
                        "الابنة",
                        "الابن",
                        "الصديقة",
                    ],
                    "jawaban" => "الابنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "ما الذى اشتغل الأب ؟",
                    "pilihan" => [
                        "اشتغل الأب المزارع",
                        "اشتغل الأب عمل البيت",
                        "اشتغل الأب عمل خارج البيت",
                        "اشتغل الأب عمل الإدارى",
                    ],
                    "jawaban" => "اشتغل الأب عمل خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "استرحت الأم من الأعمال الكثيرة لأن ؟",
                    "pilihan" => [
                        "أتمت جميع عمالها",
                        "ذهبت الى المزارع",
                        "وظفت فى الدواوين",
                        "علمت فى المدرسة",
                    ],
                    "jawaban" => "أتمت جميع عمالها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الخامس </center></p>
                    <p>زاد عدد المسلمين فى العالم فى الأعوام الماضية الى حوالي المليار والنصف. وحسب التقديرات الجديدة سيبلغ هذا العدد حوالي ملياري مسلم فى كل أنحاء العالم قبل نهاية القرن الحالي. وغالبية المسلمين أي 90 بالمائة تقريبا تتبع مذهبا من مذاهب أهل السنة الاساسية الأربعة التي ضاع أسسها كل من أبي حنيفة النعمان بن ثابت (ت. 767 م) ومالك بن أنس (ت. 795م) ومحمد بن إدريس الشافعي (ت. 820م) وأحمد بن حنبل (ت. 855م) حسب الترتيب التاريخي. </p>
                    <p>ونبي الإسلام هو محمد بن عبد الله ن عبد المطلب بن هاشم ﷺ وهو من بنى هاشم من قريش فى مكة المكرمة. وبعد أن دعا محمد ﷺ أهل مكة الى الإسلام هاجر فى سنة 622م الى يثرب، وهذه السنة هي بداية التقويم الهجري على أساس السنة القمرية أي 354 يوما، وبقي هناك الى أن توفي عام 632م. بعد وفاة النبى خلفه أبو بكر الصديق  (632-634م) ثم عمر بن الخطاب (634-633م) ثم عثمان بن عفان (644-656م) ثم علي بن أبي طالب (656-662م) </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "من أية القبيلة نبي محمد ؟",
                    "pilihan" => [
                        "مرة",
                        "قريش",
                        "غسان",
                        "محرب بن خفصة",
                    ],
                    "jawaban" => "قريش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "أية سنة بدأ التقويم الهجري ؟",
                    "pilihan" => [
                        "304",
                        "634",
                        "622",
                        "661",
                    ],
                    "jawaban" => "622",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "كم عدد المسلمين فى الأعوام الماضية ؟",
                    "pilihan" => [
                        "مليون تقريبا",
                        "حوالى مليار والنصف",
                        "مليار والربع",
                        "ربع مليار",
                    ],
                    "jawaban" => "حوالى مليار والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "يبدل اسم يثرب بسمى ؟",
                    "pilihan" => [
                        "القاهرة",
                        "المكة",
                        "اللبنان",
                        "المدينة",
                    ],
                    "jawaban" => "المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "كان المسلمون تتبع .......مذاهب السنة الأساسية",
                    "pilihan" => [
                        "أربعة",
                        "أربع",
                        "ثلاثة",
                        "ثلاث",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "الرجل الذى يبدل النبى فى قيادة البلاد يسمى بـــــــــــ...؟",
                    "pilihan" => [
                        "رئيس الجمهور",
                        "رئيس البلاد",
                        "الخليفة",
                        "النائب",
                    ],
                    "jawaban" => "الخليفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "من الخليفة الثالث من خلفاء الرسول ؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن أبى طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "الخليفة الذي قاد الحكومة أقل فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "أبو بكر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "كم سنة يكون أبو بكر خليفة ؟",
                    "pilihan" => [
                        "سنة واحدة",
                        "سنتين اثنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "الخليفة الذي قاد الحكومة أطول فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عمر بن خطاب",
                        "عثمان بن عفان",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>إختبار  اللغة العربية لغير الناطقين بها</b></center></p>
                    <p><center><b>القسم الأول : فهم المسموع</b></center></p>
                    <p>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</p>
                    <p>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "1",
                    "soal" => "",
                    "pilihan" => [
                        "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                        "الدراجة النارية في الجامعة",
                        "هو لا يحب الدراجة النارية",
                        "هو لا يذهب بالدراجة النارية",
                    ],
                    "jawaban" => "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "2",
                    "soal" => "",
                    "pilihan" => [
                        "الصياد يسترحون",
                        "الصياد لا يسترحون",
                        "الصياد لا يريدون أن يصيدوا الأسماك",
                        "الأسماك غير موجودة في البحر",
                    ],
                    "jawaban" => "الصياد يسترحون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "3",
                    "soal" => "",
                    "pilihan" => [
                        "إنها قوية",
                        "إنها لطيفة",
                        "إنها ضعيفة",
                        " إنها صابرة",
                    ],
                    "jawaban" => "إنها قوية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "4",
                    "soal" => "",
                    "pilihan" => [
                        "الطبيب",
                        "الصديق",
                        "الأب",
                        "المدرّس",
                    ],
                    "jawaban" => "المدرّس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "5",
                    "soal" => "",
                    "pilihan" => [
                        "هو يريد الأفلام",
                        "هو يشاهد الأفلام",
                        "هو يريد أن يشاهد الأفلام مع صديقه",
                        "هو يريد يشاهد الأفلام",
                    ],
                    "jawaban" => "هو يريد أن يشاهد الأفلام مع صديقه",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "6",
                    "soal" => "",
                    "pilihan" => [
                        "بعد صلاة الصبح",
                        "بعد صلاة العصر",
                        "بعد صلاة المغرب",
                        "بعد صلاة العشاء",
                    ],
                    "jawaban" => "بعد صلاة العشاء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "7",
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة الواحدة",
                        "في الساعة الثانية",
                        "في الساعة الثالثة",
                        "في الساعة الرابعة",
                    ],
                    "jawaban" => "في الساعة الرابعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "8",
                    "soal" => "",
                    "pilihan" => [
                        "أهمية النية",
                        "أقسام النية",
                        "النية وترتيبها",
                        "فوائد النية",
                    ],
                    "jawaban" => "أهمية النية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "9",
                    "soal" => "",
                    "pilihan" => [
                        "كريم الأخلاق جزء من سعادة الناس",
                        "سعادة الناس جزء من كريم الأخلاق",
                        "سعادة الناس بدون الأخلاق",
                        "الأخلاق الكريمة السعيدة",
                    ],
                    "jawaban" => "كريم الأخلاق جزء من سعادة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "10",
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المستشفى",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "11",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثون جزءا",
                        "خمسة عشر جزءا",
                        "خمسة أجزاء",
                        "جزءا واحدا",
                    ],
                    "jawaban" => "خمسة عشر جزءا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "12",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة أقلام",
                        "قلما واحدا",
                        "ستة أقلام",
                        "قلمين",
                    ],
                    "jawaban" => "ستة أقلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "13",
                    "soal" => "",
                    "pilihan" => [
                        "لم أحضر لأني لدي أمر مهم في البيت",
                        "أنا لم أحضر إلى السوق",
                        "السوق بعيد من بيتي",
                        "لا، هو لا يريد أن يذهب إلى السوق",
                    ],
                    "jawaban" => "لم أحضر لأني لدي أمر مهم في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "14",
                    "soal" => "",
                    "pilihan" => [
                        "معالجة المرضى",
                        "مرافقة المرضى",
                        "نهي المرضى",
                        "ضرب المرضى",
                    ],
                    "jawaban" => "معالجة المرضى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "15",
                    "soal" => "",
                    "pilihan" => [
                        "الأستاذ الطلاب أن يتكاسل",
                        "الأستاذ الطلاب أن لا يتكاسل",
                        "الأستاذ كسلان",
                        "الأستاذ لا يتكاسل",
                    ],
                    "jawaban" => "الأستاذ الطلاب أن يتكاسل",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "16",
                    "soal" => "",
                    "pilihan" => [
                        "ست سنوات",
                        "اثنتا عشرة سنة",
                        "ست شعرة سنة",
                        "عشرون سنة",
                    ],
                    "jawaban" => "اثنتا عشرة سنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "17",
                    "soal" => "",
                    "pilihan" => [
                        "اللغة العربية في العصر العباسي",
                        "اللغة العربية لغة عالمية",
                        "الحضارة الإسلامية",
                        "أهمية اللغة العربية",
                    ],
                    "jawaban" => "اللغة العربية لغة عالمية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "18",
                    "soal" => "",
                    "pilihan" => [
                        "هو يشتري كتابا جديدا",
                        "هو لا يشتري كتابا",
                        "هو يشتري كتابا واحدا",
                        "هو يشتري كتابا بالفلوس",
                    ],
                    "jawaban" => "هو لا يشتري كتابا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "19",
                    "soal" => "",
                    "pilihan" => [
                        "في شهر مارس",
                        "في شهر فبراير",
                        "في شهر ديسمبر",
                        "في شهر يناير",
                    ],
                    "jawaban" => "في شهر يناير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "20",
                    "soal" => "",
                    "pilihan" => [
                        "تجوز المرأة العمل كالرجال",
                        "لا تجوز المرأة العمل خارج بيتها",
                        "لا تجوز المرأة الخروج من بيتها",
                        "تجوز المرأة العمل كالرجال لكن بشرط",
                    ],
                    "jawaban" => "لا تجوز المرأة الخروج من بيتها",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "21",
                    "soal" => "",
                    "pilihan" => [
                        "الأم",
                        "الأب",
                        "الإبن",
                        "العم",
                    ],
                    "jawaban" => "الإبن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "22",
                    "soal" => "",
                    "pilihan" => [
                        "هو طبيب كريم",
                        "هو أستاذ كريم",
                        "هو تاجر غني",
                        "هو عامل كريم",
                    ],
                    "jawaban" => "هو طبيب كريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "23",
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "عشرين يوما",
                        "ثلاثين يوما",
                        "خمسة وعشرين يوما",
                    ],
                    "jawaban" => "ثلاثين يوما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "24",
                    "soal" => "",
                    "pilihan" => [
                        "يدرس بجاكرتا",
                        "يدرس بسورابايا",
                        "يدرس بمصر",
                        "يدرس بيوكجاكرتا",
                    ],
                    "jawaban" => "يدرس بمصر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "25",
                    "soal" => "",
                    "pilihan" => [
                        "نال الهدية للعمرة بسبب جماله",
                        "نال الهدية للعمرة بسبب ذكائه",
                        "نال الهدية للعمرة بسبب نجاحه",
                        "نال الهدية للعمرة بسبب والديه",
                    ],
                    "jawaban" => "نال الهدية للعمرة بسبب نجاحه",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "26",
                    "soal" => "",
                    "pilihan" => [
                        "ينتهي بعد شهرين",
                        "ينتهي بعد شهر",
                        "ينتهي بعد ثلاثة أشهر",
                        "ينتهي بعد أربعة أشهر",
                    ],
                    "jawaban" => "ينتهي بعد شهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "27",
                    "soal" => "",
                    "pilihan" => [
                        "مدّة الاشتراك سنة واحدة",
                        "في البيت مدّة الاشتراك سنتين",
                        "الجامعة مدّة الاشتراك ثلاث سنوات",
                        "مدّة الاشتراك أربع سنوات",
                    ],
                    "jawaban" => "مدّة الاشتراك سنة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "28",
                    "soal" => "",
                    "pilihan" => [
                        "عند شركة الدراجة",
                        "عند شركة الكهرباء",
                        "عند شركة السيارة",
                        "عند شركة الهاتف المحمول",
                    ],
                    "jawaban" => "عند شركة الهاتف المحمول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "29",
                    "soal" => "",
                    "pilihan" => [
                        "بثمن رخيص",
                        "بثمن غال",
                        "بدون ثمن",
                        "بثمن كمايريد",
                    ],
                    "jawaban" => "بثمن رخيص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "30",
                    "soal" => "",
                    "pilihan" => [
                        "أسمار",
                        "أثمان",
                        "ثامنية",
                        "ثمينة",
                    ],
                    "jawaban" => "أثمان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "31",
                    "soal" => "",
                    "pilihan" => [
                        "بالحافلة",
                        "مشيا على الأقدام",
                        "بالدرّاجة",
                        "بالسيّارة",
                    ],
                    "jawaban" => "بالسيّارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "32",
                    "soal" => "",
                    "pilihan" => [
                        "مؤسّسات صناعيّة",
                        "زراعيّة تابعة للحكومة",
                        "القطاع الخاصّ",
                        "مساجد",
                    ],
                    "jawaban" => "مساجد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "33",
                    "soal" => "",
                    "pilihan" => [
                        "للدراسة في المدرسة",
                        "للدراسة في الجامعة",
                        "للتجارة",
                        "لإعطاء الآخرين",
                    ],
                    "jawaban" => "للدراسة في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "34",
                    "soal" => "",
                    "pilihan" => [
                        "في البنك",
                        "في المقهى",
                        "في المسجد",
                        "في البيت",
                    ],
                    "jawaban" => "في المقهى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "35",
                    "soal" => "",
                    "pilihan" => [
                        "لونها سوداء",
                        "لونها حمراء",
                        "لونها سمراء",
                        "لونها بيضاء",
                    ],
                    "jawaban" => "لونها بيضاء",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "36",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "37",
                    "soal" => "",
                    "pilihan" => [
                        "في الفندق",
                        "في المكتبة",
                        "في الطائرة",
                        "في السوق",
                    ],
                    "jawaban" => "في الطائرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "38",
                    "soal" => "",
                    "pilihan" => [
                        "عشرون ب",
                        "ثلاثون هـ",
                        "ثلاثون ب",
                        "عشرون هـ",
                    ],
                    "jawaban" => "ثلاثون ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "39",
                    "soal" => "",
                    "pilihan" => [
                        "مضيفة",
                        "طيارة",
                        "سائقة",
                        "لاعبة",
                    ],
                    "jawaban" => "مضيفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "40",
                    "soal" => "",
                    "pilihan" => [
                        "هم داخل الطائرة",
                        "هم في مكان الانتظار",
                        "هم خارج الطائرة",
                        "هم في الملعب",
                    ],
                    "jawaban" => "هم داخل الطائرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "41",
                    "soal" => "",
                    "pilihan" => [
                        "منافع التدخين",
                        "أضرار التدخين",
                        "آثار التدخين",
                        "العادة في التدخين",
                    ],
                    "jawaban" => "أضرار التدخين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "42",
                    "soal" => "",
                    "pilihan" => [
                        "إن التدخين يسبب إلى كثير من الأمراض",
                        "إن التدخين يسبب إلى أمراض القلب",
                        "إن التدخين يسبب إلى الصحة",
                        "أن التدخين يؤثر إلى المشكلات الصحية",
                    ],
                    "jawaban" => "إن التدخين يسبب إلى الصحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "43",
                    "soal" => "",
                    "pilihan" => [
                        "أمراض الحكة",
                        "أمراض القلب",
                        "أمراض الروح",
                        "أمراض الفكرة",
                    ],
                    "jawaban" => "أمراض القلب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "44",
                    "soal" => "",
                    "pilihan" => [
                        "ينبغي علينا أن ندخن قليلا",
                        "ينبغي علينا أن ندخن كثيرا",
                        "ينبغي علينا أن ندخن ولو كان قليلا",
                        "ينبغي علينا أن لا ندخن ولو كان قليلا",
                    ],
                    "jawaban" => "ينبغي علينا أن لا ندخن ولو كان قليلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "45",
                    "soal" => "",
                    "pilihan" => [
                        "يحث علينا أن نفعل شيئا يضر علينا",
                        "يحث علينا أن لا نفعل شيئا يضر علينا",
                        "يحث علينا أن نفعل شيئا ينفع علينا",
                        "يحث علينا أن نفعل شيئا لا ينفع علينا",
                    ],
                    "jawaban" => "يحث علينا أن لا نفعل شيئا يضر علينا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "46",
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في المطعم",
                        "في المقصف",
                        "في المطبخ",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "47",
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "48",
                    "soal" => "",
                    "pilihan" => [
                        "الدجاجة المقلية",
                        "البيض المغلي",
                        "الأطعمة السريعة",
                        "الفواكه",
                    ],
                    "jawaban" => "الأطعمة السريعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "49",
                    "soal" => "",
                    "pilihan" => [
                        "سيارة الركاب",
                        "سيارة الإسعاف",
                        "الدراجة النارية",
                        "الحافلة",
                    ],
                    "jawaban" => "سيارة الإسعاف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "50",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "أربعة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>فهم التراكيب والتعبيرات</b></center></p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'قال حكيم : "الكلمة إذا خرج من القلب وقعت فى القلب، وإذا خرجت من اللسان لم تجاوز الذان، الواو فى (وقعت) هي ؟',
                    "pilihan" => [
                        "حرف عطف",
                        "حرف استئناف",
                        "واو القسم",
                        "حرف أصلي من أحرف الكلمة",
                    ],
                    "jawaban" => "حرف أصلي من أحرف الكلمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'قال تعالى : (لو كان فيهما آلهة إلا الله لفسدتا) كلمة "آلهة" هي ؟',
                    "pilihan" => [
                        "خبر كان",
                        "اسم كان",
                        "مبتدأ مأخر",
                        "خبر",
                    ],
                    "jawaban" => "اسم كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'قال تعالى : (قتل أصحاب الأخدود) كلمة "أصحاب" هي ؟',
                    "pilihan" => [
                        "مبتدأ مأخر",
                        "نائب الفاعل",
                        "فاعل",
                        "مضاف اليه",
                    ],
                    "jawaban" => "نائب الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'قال رسول الله ﷺ : (أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله) فعل "يشهدوا" فى ذلك الحديث مضارع صحيح الآخر ؟',
                    "pilihan" => [
                        "منصوب وعلامة نصبه حذف النون",
                        "مرفوع وعلامة رفعه ضمة",
                        "مجزوم وعلامة جزمه حذف النون",
                        "منصوب وعلامة نصبه الف",
                    ],
                    "jawaban" => "منصوب وعلامة نصبه حذف النون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال رسول الله ﷺ : (إِنَّ الحَلاَلَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُوْرٌ مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس، فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِهِ...الخ) خبر إن من هذا الحديث هو ؟",
                    "pilihan" => [
                        "الحلال",
                        "وإن الحرام",
                        "الحرام",
                        "بين",
                    ],
                    "jawaban" => "بين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "شكر المهندس العاملتين .......تعملان بنشاط",
                    "pilihan" => [
                        "اللتان",
                        "الذين",
                        "اللتين",
                        "الذَين",
                    ],
                    "jawaban" => "اللتين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "ليس محمد .... في الجامعة الكبيرة بالمدينة ",
                    "pilihan" => [
                        "طالبا",
                        "الطالب",
                        "طالب",
                        "طالبة",
                    ],
                    "jawaban" => "طالبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "قال تعالى : كذالك وأورثناها بنى إسرائيل. مضاف اليه فى تلك الآية الكريمة هو ؟",
                    "pilihan" => [
                        "كذالك",
                        "إسرائيل",
                        "أورثناها بنى",
                        "بنى إسرائيل",
                    ],
                    "jawaban" => "إسرائيل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "....المرأة فى الماضي لا تخرج من بيتها إلا عند الضرورة",
                    "pilihan" => [
                        "جائتْ",
                        "كانتْ",
                        "لكن",
                        "كان",
                    ],
                    "jawaban" => "كانتْ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كان جنود المسلمين فى المعركة ثمانين وثلاثين ...؟",
                    "pilihan" => [
                        "ألف",
                        "ألوف",
                        "ألفا",
                        "آلاف",
                    ],
                    "jawaban" => "ألفا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "يجب أن تصل زينب وزنها إلى سبعين ......؟",
                    "pilihan" => [
                        "كيلان",
                        "كيلاً",
                        "كيلون",
                        "كيالين",
                    ],
                    "jawaban" => "كيلاً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "والذين يرمون المحصنات ثم لم يأتوا بـــــــ.......شهداء",
                    "pilihan" => [
                        "أربع",
                        "رابعة",
                        "أربعون",
                        "أربعة",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "يبلغ عدد سكان طوكيو نحو عشرة ........!",
                    "pilihan" => [
                        "ملايين",
                        "مليونان",
                        "مليون",
                        "مليونين",
                    ],
                    "jawaban" => "ملايين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'إن خروج المرأة من البيت يؤدي الى تفكك الأسرة . أي صغة لفظ "خروج"',
                    "pilihan" => [
                        "مصدر",
                        "اسم الفاعل",
                        "اسم مفعول",
                        "اسم فعل الأمر",
                    ],
                    "jawaban" => "مصدر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "ما هي الجملة الخاطئة من هذه الجملة ",
                    "pilihan" => [
                        "كان هدف الطالب طلب العلم ",
                        "كانت أهداف الطالب طلب العلم ",
                        "أخذت زينب تتناول كثيرا من الطعام",
                        "أخذ زينب تناول كثيرا من الطعام",
                    ],
                    "jawaban" => "أخذ زينب تناول كثيرا من الطعام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "دعاتْ الإسلام الى النظافة والطهارة",
                        "دعا الإسلام الى النظافة والطهارة",
                        "تدعو الإسلام الى النظافة والطهارة",
                        "دعتْ الإسلام الى النظافة والطهارة",
                    ],
                    "jawaban" => "دعا الإسلام الى النظافة والطهارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "تخطئن الأمة إذا اعتمدت على قوة الشباب وحدهم. الكلمة الخاطئة من هذه الجملة",
                    "pilihan" => [
                        "اعتمدت",
                        "الشباب",
                        "تخطئن",
                        "الأمة",
                    ],
                    "jawaban" => "تخطئن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "انتشرت الغنم بين الأعشاب الخضراء. الكلمة الخاطئة من هذه الجملة :",
                    "pilihan" => [
                        "الإعشاب",
                        "الغنم",
                        "بين",
                        "الخضراء",
                    ],
                    "jawaban" => "الغنم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "صبروا المسلمون على ما أصابهم من الوباء",
                        "صبرنا المسلمون على ما أصابهم من الوباء",
                        "صبر المسلمون على ما أصابهم من الوباء",
                        "صبرتم المسلمون على ما أصابهم من الوباء",
                    ],
                    "jawaban" => "صبر المسلمون على ما أصابهم من الوباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "..... القارئ أيات من القرآن الكريم",
                    "pilihan" => [
                        "تلا",
                        "تلى",
                        "تلو",
                        "تلأ",
                    ],
                    "jawaban" => "تلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "نعلم جميعا أن ...... المديرة يتعلمان فى الخارج",
                    "pilihan" => [
                        "بنت",
                        "ابني",
                        "ابن",
                        "بنتي",
                    ],
                    "jawaban" => "ابني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "الرجل .....قابلته صديقى الحميم",
                    "pilihan" => [
                        "التى",
                        "ما",
                        "من",
                        "الذي",
                    ],
                    "jawaban" => "الذي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كان طلاب العلم فى الماضى ....من بلد الى بلد لطلب العلم",
                    "pilihan" => [
                        "أسفرون",
                        "يسافرون",
                        "يسافرين",
                        "تتسافر",
                    ],
                    "jawaban" => "يسافرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "وقبل الالتحاق ..... الجامعة كان عمر تلميذا فى المدرسة الثانوية",
                    "pilihan" => [
                        "على",
                        "إلى",
                        "الباء",
                        "عن",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "وافق مجلس الشعب .......المشروع الكبير",
                    "pilihan" => [
                        "على",
                        "الباء",
                        "إلى",
                        "من",
                    ],
                    "jawaban" => "على",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "يعتقد المسلمون ....هو كلام الله",
                    "pilihan" => [
                        "بأن القرآن الكريم",
                        "على أن القرآن الكريم",
                        "أن القرآن الكريم",
                        "إن القرأن الكريم",
                    ],
                    "jawaban" => "أن القرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "إن اختلاف الآراء .... الفروع الفقهية لأ يدل على انحراف في الدين ما دام لم يخرج عن المقررات الشرعية المجمع عليها من السابقين",
                    "pilihan" => [
                        "من",
                        "على",
                        "الباء",
                        "في",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "أتعلم القرآن الكريم <u>حباً</u> في فهم التعاليم الإسلامية. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "المفعول لأجله",
                        "المفعول فيه",
                        "المفعول به",
                        "المفعول مطلق",
                    ],
                    "jawaban" => "المفعول لأجله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "صرتَ <u>أستاذا</u> في اللغة العربية . الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المفعول معه",
                        "المفعول لأجله",
                        "خبر صار",
                        "اسم صار",
                    ],
                    "jawaban" => "خبر صار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "أ وصلت<u>ك</u> الرسالة التى أرسلتها قبل يومين من سورابيا ؟  . الطامة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "فاعل",
                        "خبر",
                        "المفعول به",
                    ],
                    "jawaban" => "المفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "من خطبة النبى ﷺ : فإن لكم على نسائكم <u>حقاً</u>. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "خبر إن",
                        "اسم إن",
                        "المفعول المطلق",
                        "الحال",
                    ],
                    "jawaban" => "اسم إن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "للحيوان <u>أصوات</u> مختلفة.  الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "الخبر",
                        "المفعول به",
                        "الفاعل",
                    ],
                    "jawaban" => "المبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "على – أموالا – بعض – تنفق – كثيرة – النظافة – الدول",
                    "pilihan" => [
                        "النظافة تنفق أموالا كثيرة على بعض الدول",
                        "على بعض الدول تنفق النظافة أومالا كثيرة",
                        "تنفق بعض الدول أموالا كثيرة على النظافة",
                        "بعض أموالا كثيرة تنفق على النظافة الدول",
                    ],
                    "jawaban" => "تنفق بعض الدول أموالا كثيرة على النظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "من – يفضل – الناس- القراءة – كثير",
                    "pilihan" => [
                        "من يفضل كثير الناس القراءة",
                        "يفضل كثير من الناس القراءة",
                        "القراءة من كثير الناس يفضل",
                        "كثير القراءة من يفضل الناس",
                    ],
                    "jawaban" => "يفضل كثير من الناس القراءة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "الأم – وحد – ها – الوقت – معظم – تبقى –في – البيت",
                    "pilihan" => [
                        "وحد الأمها معظم الوقت فى البيت  تبقى",
                        "الأمها تبقى في معظم الوقت وحد البيت",
                        "فى معظم الوقت الأمها تبقى وحد البيت",
                        "تبقى الأم في البيت وحدها معظم الوقت",
                    ],
                    "jawaban" => "تبقى الأم في البيت وحدها معظم الوقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "يفضل فريق من الناس أن يكون قريبا من شاطئ البحر . خبر كان من هذه الجملة هي",
                    "pilihan" => [
                        "قريبا",
                        "من الناس",
                        "فريق الناس",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "قريبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "........ المشاهدون مباراة كرة القدم في الملعب الرياضي الكبير",
                    "pilihan" => [
                        "شاهدت",
                        "شاهدوا",
                        "يشهد",
                        "يشاهدون",
                    ],
                    "jawaban" => "يشهد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "العَالِمُ كَبِيْرٌ وَإِنْ كَانَ <u>حَدَثًا</u> وَالجَاهِلُ صَغِيْرٌ وَإِنْ كَانَ شَيْخًا. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "الأمر",
                        "صغير السنّ",
                        "كبير السنّ",
                        "المجالس",
                    ],
                    "jawaban" => "صغير السنّ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "لا نتظرنّ لأثواب على أحد إن <u>رمت</u> تعرفه فانظر الى الأدب. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "عرفت",
                        "كرمت",
                        "نظرت",
                        "أردت",
                    ],
                    "jawaban" => "أردت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "من لم <u>يذق</u> ذل التعلم ساعة تجرع ذل الجهل طول حياته. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "يشعر",
                        "يتعلم",
                        "يذهب",
                        "يجلس",
                    ],
                    "jawaban" => "يشعر",
                ]
            ]
        ];

        return $data;
    }

    public function get_soal_qiroahv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "<p><center><b>فهم المقروء</b></center></p>"
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان أخي إبراهيم طالبا في كلية الهندسة، بجامعة ملك سعود. دعاني أخي لقضاء أيام عيد الفطر معه وقد اتصل بي هاتفيا، قبل سفري قائلا : يا علي أرجو أن تحضر بالطائرة ولا تحاول أن تحضر بالحافلة، فالأمطار كثيرة وربما تعطلت الحافلة في الطريق بسبب المياه والوحل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين درس إبراهيم؟",
                    "pilihan" => [
                        "إندونيسيا",
                        "ماليزيا",
                        "الجزائر",
                        "السعودية",
                    ],
                    "jawaban" => "السعودية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "لماذا اقترح إبراهيم عَليًّا ليركب الطائرة؟",
                    "pilihan" => [
                        "أنّ أجرة الطائرة رخيصة",
                        "أن أجرة الحافلة غلية",
                        "أن الطائرة لا تتعطل بسبب المطر",
                        "أن الحافلة لا تتعطل بسبب المياه والوحل ",
                    ],
                    "jawaban" => "أن الطائرة لا تتعطل بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "من المتحدث لتلك القرآءة؟ ",
                    "pilihan" => [
                        "إبراهيم ",
                        "ملك سعود ",
                        "علي",
                        "أخي إبراهيم",
                    ],
                    "jawaban" => "علي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>عاشت خديجة بنت خويلد في بيت غني، وكانت محبوبة من والديها لذكائها وأدبها وعندما مات زوجها عملت بالتجارة فكسبت مالا كثيرا. كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق، فاختارته السيدة خديجة ليعمل في تجارتها، فسافر إلى الشام في رحلة تجارية وكان معه في تلك الرحلة ميسرة، خادم السيدة خديجة. عندما عادت الرحلة من الشام أخبرت ميسرة السيدة خديجة بما حدث في تلك الرحلة. أخبرها ميسرة عن  صدق محمد وأمانته، كما أخبرها بالسحابة التي كانت تحميه من حر الشمس وهي تسير فوق رأسه.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "ماذا حدث في رحلة النبي؟",
                    "pilihan" => [
                        "سار الجمل سرعة",
                        "سارت السحابة تحت قدميه",
                        "حمت السحابة رأسه",
                        "حمت السحابة رأسها",
                    ],
                    "jawaban" => "حمت السحابة رأسه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "عاشت خديجة بنت خويلد في بيت....",
                    "pilihan" => [
                        "ضيق",
                        "فاخر",
                        "صغير",
                        "بسيط",
                    ],
                    "jawaban" => "فاخر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => '"كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق". ما هو خبر (كان) من تلك الجملة؟',
                    "pilihan" => [
                        "النبي",
                        "ص",
                        "قبل النبوة",
                        "مشهورا",
                    ],
                    "jawaban" => "مشهورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لماذا اختارت السيدة خديجة النبي محمدا ليعمل في تجارتها؟",
                    "pilihan" => [
                        "لأنه مشهور بالصدق والأمانة",
                        "لأنه مشهور بالذكاء والأدب",
                        "لأنها مشهورة بالأمانة والصدق",
                        "لأنها مشهورة بذكائها وأدبها",
                    ],
                    "jawaban" => "لأنه مشهور بالصدق والأمانة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "ماذا فعلت ميسرة بعدما شاهدت شيئا غريبا في رحلتها مع النبي؟",
                    "pilihan" => [
                        "سكتت",
                        "ضحكت",
                        "تعجبت",
                        "أخبرت",
                    ],
                    "jawaban" => "أخبرت",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يفضل كثير من الناس الترويح خارج البيوت، حيث يقضون الوقت في مخيمات. ويختلف الوقت الذي يقضيه الناس في المخيمات، فقد يكون ليلة واحدة، وقد يكون عدة أسابيع. ويختلف المكان، فقد يكون على شاطئ البحر، أو في البر، أو في الغابة، أو في الصحراء، أو بين الجبال، حيث الهواء النقي.</p>
                    <p>يخرج الناس أيام العطلة إلى البر، وينصبون في مكان الترويح الخيام، ويحملون معهم الطعام والشراب، ووسائل الترويح. ويفضل فريق من الناس أن يكون قريبا من شاطئ البحر، حيث يمارسون السباحة، وأنواع الرياضة الأخرى، ويصطادون السمك. ويفضل بعض الناس مشاهدة الطيور، أو التصوير، أو المشي.</p>
                    <p>يحمل الناس معهم إلى البر خياما، وملابس، وكثيرا من الطعام. وبعض الناس يعدون الطعام في بيوتهم، ويضعونه في أوان. وهناك من يفضل إعداد الطعام في المخيمات. ويحمل الناس معهم الماء، إذا لم يكن في المكان ماء.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "ما العنوان المناسب لهذه الفقرات؟",
                    "pilihan" => [
                        "الهواية",
                        "التخييم",
                        "التنزه",
                        "الأعمال خارج البيت",
                    ],
                    "jawaban" => "التخييم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "يقضي الناس أيام عطلتهم إلى البر....؟",
                    "pilihan" => [
                        "هم ينامون في خيامهم",
                        "هم ينامون في بيوتهم",
                        "هم ينامون في فنادقهم",
                        "هم ينامون في شققهم",
                    ],
                    "jawaban" => "هم ينامون في خيامهم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ما هي المدة الأدنى في قضاء خروجهم من البيت للتنزه؟",
                    "pilihan" => [
                        "ليلة واحدة",
                        "يوما واحدا",
                        "عدة أسابيع",
                        "عدة شهور",
                    ],
                    "jawaban" => "ليلة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "أين المكان الذي لا يناسبه للتخييم؟",
                    "pilihan" => [
                        "شاطئ البحر",
                        "الجرف",
                        "الغابة",
                        "بين الجبال",
                    ],
                    "jawaban" => "الجرف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "كم يوما في أسبوع واحد؟",
                    "pilihan" => [
                        "يوما واحدا",
                        "ثلاثة أيام",
                        "عشرة أيام",
                        "سبعة أيام",
                    ],
                    "jawaban" => "سبعة أيام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p></p>أصلي العصر في المسجد وأتلو القرآن الكريم وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا من الماء ثم نصلي المغرب جماعة. وبعد الصلاة أعود إلى المنزل حيث أكمل إفطاري ثم أعود لصلاة العشاء و صلاة التراويح والوتر في المسجد.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما المرادف من كلمة (أتلو) ؟",
                    "pilihan" => [
                        "أعطى",
                        "أفتح",
                        "أقرأ",
                        "أصدق",
                    ],
                    "jawaban" => "أقرأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'ما المقصود من عبارة "وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا" ؟',
                    "pilihan" => [
                        "أنه يأكل التمر قبل الآذان",
                        "أنه يأكل التمر قبل المغرب",
                        "أنه يأكل التمر بعد صلاة المغرب",
                        "أنه يأكل التمر بعد ما سمع الآذان",
                    ],
                    "jawaban" => "أنه يأكل التمر بعد ما سمع الآذان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "وعندما يؤذن آذن المغرب <u>أتناول</u> بعض التمر. الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "استمرار",
                        "استهلاك",
                        "استشعار",
                        "استعداد",
                    ],
                    "jawaban" => "استهلاك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "ثم <u>أعود</u> لصلاة العشاء. في تلك الجملة، الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "رجع من المنزل",
                        "ذهب إلى المنزل",
                        "ح. رجع من المسجد",
                        "ذهب إلى المسجد",
                    ],
                    "jawaban" => "ذهب إلى المسجد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان حامد راعيا يرعى أغنام القرية. <u>وكان</u>  يأخذ الأغنام في الصباح الباكر. ويخرج بها إلى أطراف القرية حيث الأشجار والعشب الأخضر. كان حامد يحمل في يده اليمني عصا كبيرة وفي يده اليسرى طعامه ومزماره وكان يصحبه كلبه الذي يجري أمام الأغنام وخلفها.</p>
                    <p>عندما يصل حامد إلى المرعى يترك أغنامه ويذهب إلى شجرة كبيرة يجلس تحتها ليتناول طعامه ثم يتناول مزماره ويغني بعض الألحان الجميلة ثم ينام قليلا ويستيقظ ليتفقد أغنامه. وعند العصر يجمع أغنامه ويعود بها إلى القرية سعيدا.</p>
                    <p>فكر حامد ذات  يوم، وقال لنفسه: لماذا لا أسخر من أهل القرية؟. وأخذ يفكر في طريقة يمازح بها أهل القرية. صعد حامد إلى شجرة عالية وأخذ يصرخ بصوت عال: الذئب.... الذئب...... لقد هجم الذئب على أغنامكم.... أنقذوني... أنقذوني..</p>
                    <p>لما سمع أهل القرية نداء الراعي. أسرعوا إليه فلما وصلوا إلى مكانه أخذ ينظر إليهم ويضحك ثم قال لهم: لقد كذبت عليكم ها.. ها.. ها.. عاد الناس إلى القرية غاضبين ثم نسوا الموضوع.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "الفكرة الرئيسة في الفقرة السابقة تتحدث عن.... ",
                    "pilihan" => [
                        "عاش رجل في القرية وعنده أغنام كثيرة وهو صادق",
                        "كان راعيا كاذبا",
                        "كان الرجل راعيا صادقا",
                        "الرجل يحب الغناء",
                    ],
                    "jawaban" => "كان راعيا كاذبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أين كذب الراعي على أهل القرية؟ ",
                    "pilihan" => [
                        "في السوق",
                        "في الملعب",
                        "في المرعى",
                        "في القرية",
                    ],
                    "jawaban" => "في المرعى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "أي عبارة من العبارات الآتية لا يحتويها الموضوع؟ ",
                    "pilihan" => [
                        "حامد كان صادقا و كريما",
                        "حامد كان راعيا و كاذبا",
                        "كان حامد يغني بعض الألحان ",
                        "كان حامد يعود إلى القرية عند العصر",
                    ],
                    "jawaban" => "حامد كان صادقا و كريما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'خبر كان من عبارة "<u> وكان</u>  يأخذ الأغنام في الصباح الباكر "؟ ',
                    "pilihan" => [
                        "يأخذ",
                        "الأغنام",
                        "في الصباح ",
                        "الباكر",
                    ],
                    "jawaban" => "يأخذ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ضمير (ها) في جملة "وعند العصر يجمع أغنامه ويعود <u>بها</u> إلى القرية سعيدا." راجعا إلى.. ',
                    "pilihan" => [
                        "القرية",
                        "الأغنام",
                        "الجميلة ",
                        "الألحان ",
                    ],
                    "jawaban" => "الأغنام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>حزنت زينب حزنا شديدا. فهي لا تستطيع أن تفارق صديقتها العزيزة. لاحظ والد زينب في البيت. أن بنته حزينة طوال الوقت ولم تعد تضحك كعادتها، فسألها عن سبب ذٰلك. فأخبرته بأن صديقتها سلمى سترحل مع أسرتها إلى مدينة أخرى. لأن والدها لم يجد عملا في هذه المدينة. ابتسم والد زينب وقال لها: لن تفارقي صديقتك إن شاء الله</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "ما سبب حزنها زينب؟ ",
                    "pilihan" => [
                        "ستعود صديقتها إلى منزلها",
                        "ستزور صديقتها إلى مدينة أخرى",
                        "سترحل صديقتها إلى مدينة أخرى ",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سترحل صديقتها إلى مدينة أخرى ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "ما اسم صديقة زينب؟ ",
                    "pilihan" => [
                        "عزيزة",
                        "فاطمة",
                        "خديجة ",
                        "سلمى",
                    ],
                    "jawaban" => "سلمى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "لماذا ستذهب صديقتها وأسرتها عن مدينة قديمة؟ ",
                    "pilihan" => [
                        "لأن والد صديقتها يجد عملا في مدينة أخرى ",
                        "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                        "لأن أسرة صديقتها لا تحب  هذه المدينة ",
                        "لأن أسرة صديقتها تحب  هذه المدينة ",
                    ],
                    "jawaban" => "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>ولد أبو بكر الصديق رضي الله عنه في السنة الثانية أو الثالثة من عام الفيل وهو أصغر من النبي(ص) بنحو سنتين. وقد <b>كان</b> محبوبا في الجاهلية. لأنه كان رجلا أمينا، كريما، طيب الأخلاق، حسن السلوك، وهو لم يشرب خمرا في حياته ولم يسجد لصنم أبدا.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'الضمير هو في جملة "وقد <b>كان</b> محبوبا في الجاهلية" يعود إلى ؟',
                    "pilihan" => [
                        "النبي صلى الله عليه وسلم",
                        "أبي بكر الصديق",
                        "العام",
                        "الفيل",
                    ],
                    "jawaban" => "أبي بكر الصديق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ولد أبو بكر الصديق رضي الله عنه. "وُلِد" في هذه الجملة من فعل؟',
                    "pilihan" => [
                        "معلوم",
                        "مجهول",
                        "مرفوع",
                        "منصوب",
                    ],
                    "jawaban" => "مجهول",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>دعا النبي (ص) الناس إلى الإسلام. فتردد الكثيرون إلا أبا بكر الصديق. فقد أسلم دون تردد. وكان أول من أسلم من الرجال، وكانت السيدة خديجة أول من أسلم من النساء. أما أول من أسلم من الصبيان فهو علي بن أبي طالب رضي الله عنه.</p>
                    <p>كنّى النبي (ص) أبا بكر بالصديق لأنه صدقه عندما أخبره بقصة الإسراء به ليلا من المسجد الحرام في مكة إلى مسجد الأقصى في بيت المقدس. حيث قال تعالى : "سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله لنريه من آيتنا....."</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "لماذا كُنّيَ أبو بكر بالصديق؟ ",
                    "pilihan" => [
                        "لأنه أول من أسلم من الرجال",
                        "لأنه أول من أسلم من الصبيان",
                        "لأنه لايزال صغيرا ",
                        "لأنه صدق قصة الإسراء",
                    ],
                    "jawaban" => "لأنه صدق قصة الإسراء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "فهمنا من النص السابق أن أول الولد أسلم هو؟ ",
                    "pilihan" => [
                        "أبو بكر الصديق",
                        "السيدة خديجة ",
                        "عمر بن الخطاب",
                        "علي بن أبي طالب",
                    ],
                    "jawaban" => "علي بن أبي طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>فتردد</u> الكثيرون إلا أبا بكر الصديق". والمراد باللفظ الذي تحته خط هو ؟ ',
                    "pilihan" => [
                        "هم يريبون في قصة الإسراء ",
                        "هم يؤمنون بقصة الإسراء",
                        "هم يشكّون على دعوة النبي إلى الإسلام",
                        "هم يخونون دعوة النبي إلى الإسلام",
                    ],
                    "jawaban" => "هم يشكّون على دعوة النبي إلى الإسلام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان في إحدى المدن ملك ذكي يحكم شعبه حكما عادلا وكان للملك وزير ذكي و عادل كذلك. وقد كان الشعب يحب الملك ووزيره. كانت في وسط المدينة بئر. عذبة الماء. يشرب منها جميع السكان المدينة. لأنه لم تكن في المدينة بئر سواها. </p>
                    <p>في أحد الأيام جائت ساحرة إلى المدينة. كانت تحمل قارورة صغيرة. بها ماء. وقفت الساحرة بالقرب من البئر وكان حول البئر جمع كبير من الناس. قالت لهم الساحرة : سأقذف بسبع نقط من هذه القارورة في البئر ومن يشرب من البئر يصير مجنونا أو يمت.</p>
                    <p>في اليوم الثاني عطس سكان المدينة. فذهبوا إلى البئر وشربوا من مائها وقد كانوا خائفين من كلام الساحرة ولما شربوا من الماء لم يمت منهم أحد ولكنهم أصبحوا جميعا مجانين. </p>
                    <p>عطس الملك ولكنه خاف من الجنون والموت. وكذلك خاف وزيره وعندما سمع سكان المدينة. بأن الملك ووزيره لم يشربا من البئر. طافوا من حي إلى حي ومن شارع إلى شارع. وهم ينادون: لقد صارا ملكنا ووزيره مجنونين. </p>
                    <p>في المساء علم الملك بما فعله الناس. فاستدعاهم أمام قصره وأمر بأن تملأ له كأس ذهبية من ماء البئر. </p>
                    <p>فملأوها له في الحال وأخضروها إليه. فتناول بيده ورفعها إلى فمه وشرب من مائها ثم دفع بالكأس إلى وزيره فشرب بقية الماء. انطلق سكان المدينة في الشوارع. ينادون: لقد عاد ملكنا ووزيره إلى رشدهما</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "ما العنوان المناسب للنص السابق؟ ",
                    "pilihan" => [
                        "الملك الجائر",
                        "الساحرة الحكيمة",
                        "الملك الحكيم",
                        "الساحرة المجرمة",
                    ],
                    "jawaban" => "الملك الحكيم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "العبارات التي لا تحتوي على ذلك النص هي؟ ",
                    "pilihan" => [
                        "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                        "أصبح السكان مجنونين بسبب شرب الماء",
                        "قذفت الساحرة ماء قارورتها بسبع نقط",
                        "كان الملك ذكيا و عادلا",
                    ],
                    "jawaban" => "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا حملت الساحرة؟ ",
                    "pilihan" => [
                        "سبع نقط من القارورة ",
                        "الكأس لإملاء الماء",
                        "هي لا تحمل شيأ إلا مالا",
                        "قارورة صغيرة بها ماء",
                    ],
                    "jawaban" => "قارورة صغيرة بها ماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "ماذا ستحدث عندما شرب الناس ماء البئر التي احتوت على ماء حملته الساحرة؟ ",
                    "pilihan" => [
                        "سيكون ذكيا وماهرا",
                        "سيصبح مجنونا أو ميتا",
                        "سيصير غانيا",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سيصبح مجنونا أو ميتا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "ماذا قالت الساحرة إلى سكان المدينة؟ ",
                    "pilihan" => [
                        "إنها ستقذف بسبع نقط من دلوها في البئر ",
                        "إنها ستأخذ بعض الماء من البئر وتعطيه إلى الآخر",
                        "إنها ستعطي مالها إلى جميع السكان المدينة ",
                        "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                    ],
                    "jawaban" => "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هل تعمل المرأة خارج بيتها، أم لا تعمل؟ يختلف الناس في الإجابة عن هذا السؤال إلى ثلاث فرق؛ فريق يقول: نعم، يجب أن تعمل المرأة خارج بيتها، مثل الرجل؛ وفريق آخر يقول: لا يصح أن تعمل المرأة خارج بيتها؛ وفريق ثالث يقول: تعمل المرأة خارج بيتها، ولكن بشرط.</p>
                    <p>يقول الفريق الأول: إن المرأة نصف المجتمع، ولا يصح أن تجلس في بيتها؛ تغسل الملابس، وتعد الطعام، وتنظف البيت، وتربي الأولاد، وهي عندهم جزء من الاقتصاد، تعمل وتأخذ أجر عملها.</p>
                    <p>ويرى الفريق الثاني، أن وظيفة المرأة الأساسية أن تكون في البيت، حيث تديره، وتربي أولادها. ويرى هذا الفريق أن الراتب الذي تأخذه المرأة من عملها، تعطيه للخادمة التي تفسد الأولاد، ولا تصلحهم. ويقول هذا الفريق: إن خروج المرأة من البيت، يؤدي إلى تفكك الأسرة، وضياع الأولاد.</p>
                    <p>أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عملها الأساسي في بيتها، ولها أن تعمل خارج بيتها، بشرط أن تعمل في المجالات التي تناسبها، وتحفظ أخلاقها، وتبعدها عن مخالطة الرجال، كالعمل في المجال الطبي؛ فتعمل طبيبة، أو ممرضة، أو في المجال التعليمي؛ فتعمل معلمة، أو مربية،أو غير ذلك في مجتمع نسائي.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "الفكرة الرئيسة للفقرة الثانية هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها ",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "المرأة تعمل و تحصل أجرة كمثل الرجل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "الفكرة الرئيسة للفقرة الثالثة هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل ",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "وجدنا من تلك الفقرات أنّ المرأة.... ",
                    "pilihan" => [
                        "كانت تعمل خارج بيتها كمثل الرجل",
                        "كانت تعمل في بيتها فقط لتربية أولادها وغير ذلك",
                        "كانت تعمل في بيتها وأيضا خارج بيتها بشرط",
                        "كل الأجوبة صحيحة",
                    ],
                    "jawaban" => "كل الأجوبة صحيحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => '" أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عمل<b>ها</b> الأساسي في بيت<b>ها</b>، ول<b>ها</b> أن تعمل خارج بيت<b>ها</b>، بشرط أن تعمل في المجالات التي تناسبها " . ضمير "ها" يعود إلى ؟ ',
                    "pilihan" => [
                        "الفريق",
                        "المرأة",
                        "الثالث",
                        "العمل",
                    ],
                    "jawaban" => "المرأة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "أفضل العنوان للفقرات السابقة:",
                    "pilihan" => [
                        "عمل الصبيان",
                        "تربية الأولاد",
                        "رفاء الأسرة",
                        "عمل المرأة",
                    ],
                    "jawaban" => "عمل المرأة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>كان أبو بكر رفيق النبي (ص) في السلم وفي الحرب وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد مات. فخرج إليهم أبو بكر وقال لهم: "من كان يعبد محمدا فإن محمدا قد مات ومن كان يعبد الله فإن الله حي لا يموت"</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "المراد ب(اضطرب) هو؟",
                    "pilihan" => [
                        "فرح",
                        "قلق",
                        "صبر",
                        "بكى",
                    ],
                    "jawaban" => "قلق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "فهمنا من تلك الفقرة أن أبا بكر؟ ",
                    "pilihan" => [
                        "صحبة النبي ",
                        "لا يبكي على وفاة النبي ",
                        "يبكي على وفاة النبي ",
                        "نهي الناس ليعبد النبي ",
                    ],
                    "jawaban" => "نهي الناس ليعبد النبي ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'الفاعل من "اضطرب" في الجملة "وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد ما"ت ؟ ',
                    "pilihan" => [
                        "هو",
                        "هم",
                        "النبي",
                        "الكثيرون",
                    ],
                    "jawaban" => "الكثيرون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبح العالم – اليوم – قرية صغيرة، بسبب وسائل النقل الحديثة، ووسائل الاتصال الحديثة. كيف يعيش سكان هذه القرية الصغيرة؟ إنني أدعوك يا صاحبي لزيارة هذه القرية الصغيرة. هيا نتجول فيها، وننظر كيف يعيش سكانها. سأصحبك معي في طائرتي. إنني أملك طائرة سريعة، أسرع من الصوت. تفضل يا صاحبي، اركب الطائرة، وهيا بنا ننطلق.</p>
                    <p>نحن نطير الآن فوق دول الشمال. انظر إلى هذه الدول، إنها دول غنية، نملك القوة والعلم والمال. انظر إلى الناس، إنهم أغنياء في هذه الدول، يلبسون أجمل الثياب، وهم أصحاء، ويعيشون في بيوت جميلة. ما أكثر المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! إنهم يعيشون في أمن ورخاء.</p>
                    <p>هيا نزور الجانب الآخر من العالم. هذه دول الجنوب. إنها دول فقيرة، لا تملك القوة ولا العلم ولا المال. انظر إلى هؤلاء الناس، إنهم فقراء يلبسون ثيابًا بسيطة، ويعيشون في بيوت صغيرة، ومعظمهم مرضى. ما أقل المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! لماذا يتقاتل الناس في هذه البلاد؟ ولماذا ينتشر الفقر والمرض والجهل هنا؟ يا لها من حياة!</p>
                    <p>هل رأيت يا صاحبي هذه القرية الصغيرة؟! يعيش نصف سكانها في رخاء، ويعيش النصف الآخر في فقر وحرب. لماذا لا يعيش جميع سكان القرية في رخاء وأمن؟ هل سيحدث ذلك في يوم من الأيام؟  الله أعلم.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "ما العنوان المناسب للفقرات السابقة؟ ",
                    "pilihan" => [
                        "دول الشمال و دول الجنوب",
                        "ما أكثر المدارس في دول الشمال",
                        "ما أقل المدارس في دول الجنوب",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "دول الشمال و دول الجنوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "عرفنا الآن أنّ دول الشمال..... من دول الجنوب",
                    "pilihan" => [
                        "أكثر مجتمعا",
                        "أقل مجتمعا ",
                        "أقل تطورا",
                        "أكثر تطورا",
                    ],
                    "jawaban" => "أكثر تطورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'ما المرادف من كلمة "سكان" ؟',
                    "pilihan" => [
                        "مغترب",
                        "مستوطن",
                        "مختلس",
                        "مجدد",
                    ],
                    "jawaban" => "مستوطن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'المضادة من كلمة "الحديثة"... ؟',
                    "pilihan" => [
                        "الجديدة ",
                        "الجيدة",
                        "القادمة",
                        "القديمة",
                    ],
                    "jawaban" => "القديمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => 'ماذا تقصد من عبارة "يعيش نصف سكانها في رخاء" ؟',
                    "pilihan" => [
                        "يعيشون في السعادة",
                        "يعيشون في الحزن",
                        "يعيشون في الفقر",
                        "يعيشون في المسكين",
                    ],
                    "jawaban" => "يعيشون في السعادة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'الكلمة "المَدَارِس" جمع كلمة من... ؟',
                    "pilihan" => [
                        "مُدَرِّسة",
                        "مدرسان ",
                        "مدرسون",
                        "مَدْرَسة",
                    ],
                    "jawaban" => "مَدْرَسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'ما معنى "يحدث في الجملة "هل سيحدث ذلك في يوم من الأيام "؟',
                    "pilihan" => [
                        "يصل",
                        "يطلب",
                        "يجد",
                        "يقع",
                    ],
                    "jawaban" => "يقع",
                ]
            ],
        ];

        return $data;
    }

    // soal 4 
    public function get_soalv4(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "<center><b>TRY OUT PERSIAPAN KULIAH DI TIMUR TENGAH<br>
                اختبار اللغة العربية لاستعداد الدراسة في شرق الأوسط</b></center>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'يسرق اللص شيئا ثم يقرّ ويحمل ما يأخذه. "ما" في الجملة السابقة؟',
                    "pilihan" => [
                        "النافي",
                        "الموصول",
                        "الاستفهام",
                        "التعجب",
                    ],
                    "jawaban" => "الموصول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "صلى المسلمون في اليوم واليلة سبع عسرة ....",
                    "pilihan" => [
                        "ركعةٍ",
                        "ركعاتٍ",
                        "ركعةً",
                        "ركعاتٌ",
                    ],
                    "jawaban" => "ركعةً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "يقيس البائع النسيج ... متر.",
                    "pilihan" => [
                        "على",
                        "ب",
                        "مع",
                        "في",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "سوف يرجع أبي من مكة ....",
                    "pilihan" => [
                        "في الأسبوع القديم",
                        "في الأسبوع القادم",
                        "في الشهر الماضي",
                        "في يوم الأمس",
                    ],
                    "jawaban" => "في الأسبوع القادم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "كان الفلاح في المزرعة الكبيرة. الخبر في هذه الجملة ؟",
                    "pilihan" => [
                        "كان",
                        "في المزرعة الكبيرة",
                        "المزرعة",
                        "الفلاح",
                    ],
                    "jawaban" => "في المزرعة الكبيرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "اتصل علي ... محمد البارحة.",
                    "pilihan" => [
                        "مع",
                        "على",
                        "في",
                        "ب",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "نحن نزور المريض وندعو ....",
                    "pilihan" => [
                        "معه",
                        "فيه",
                        "عنه",
                        "له",
                    ],
                    "jawaban" => "له",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "يحمي الجندي وطنه ويحرص .... سلامته. ",
                    "pilihan" => [
                        "مع",
                        "على",
                        "في",
                        "ب",
                    ],
                    "jawaban" => "على",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'يسمح المدرس لتلاميذه النزهة. كلمة "النزهة" في الجملة السابقة ؟',
                    "pilihan" => [
                        "مضاف إليه",
                        "فاعل",
                        "خبر",
                        "مفعول به",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'من يجتهد في التعلم ينجح في الإمتحان. "من" في الجملة السابقة ؟',
                    "pilihan" => [
                        "تعجبية",
                        "موصولة",
                        "شرط",
                        "استفهام",
                    ],
                    "jawaban" => "شرط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'حفظ التلاميذ عشرين سورة. كلمة "عشرين" ؟',
                    "pilihan" => [
                        "خبر",
                        "مفعول به",
                        "حال",
                        "فاعل",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'إنّ لله تسعة وتسعين اسما. كلمة "اسما" ؟',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول لأجله",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "لم تطلع الشمس في هذه الساعة. فعل تطلع في الجملة السابقة، فعل مضارع صحيح الآخر :",
                    "pilihan" => [
                        "منصوب وعلامة نصبه فتحة ظاهرة في آخره",
                        "مرفوع وعلامة رفعه ضمة ظاهرة فى لآخره",
                        "مجزوم وعلامة جزمه حذف النون",
                        "مجزوم وعلامة جزمه السكون",
                    ],
                    "jawaban" => "مجزوم وعلامة جزمه السكون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "كل هذه الجملة صحيحة ما عاد ؟",
                    "pilihan" => [
                        "يصب المرء الماء في الكوب",
                        "أنتِ تكوين الملابس ",
                        "تصفو السماء ويضيع الغيم",
                        "تسمح المدرس لطالبه المريض الرجوع",
                    ],
                    "jawaban" => "تسمح المدرس لطالبه المريض الرجوع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'كلا المسلمين مجد. كلمة "كلا"',
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "خبر مقدم مرفوع بالألف",
                        "مبتدأ مرفوع بالضمة المقدرة",
                        "مبتدأ مرفوع بحذف النون",
                    ],
                    "jawaban" => "مبتدأ مرفوع بالألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'أنا أمد الحبل ثم أجر به عربتي. كلمة "الحبل" ....',
                    "pilihan" => [
                        "مرفوع بالضمة",
                        "منوب بالفتحة",
                        "مجرور بالكسرة",
                        "مجرور بالفتحة",
                    ],
                    "jawaban" => "منوب بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'يتساوم المشتري والبائع عن الثمن. كلمة "المشتري" ...',
                    "pilihan" => [
                        "مرفوع بالضمة",
                        "مرفوع بالضمة المقدرة",
                        "مرفوع بحذف النون",
                        "مرفوع بحذف حرف العلة",
                    ],
                    "jawaban" => "مرفوع بالضمة المقدرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "تترقّى الأمة .... البناء والإصلاح. ",
                    "pilihan" => [
                        "من",
                        "ب",
                        "على",
                        "في",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "..... القبيلة والقبيلة الأخرى.",
                    "pilihan" => [
                        "تنازع",
                        "نازع",
                        "تتنازع",
                        "نزع",
                    ],
                    "jawaban" => "تتنازع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => ".... الولد المصباح. ",
                    "pilihan" => [
                        "يشعل",
                        "تشعل",
                        "تشعلان",
                        "أُشعل",
                    ],
                    "jawaban" => "يشعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => ".... التلامسذ سؤالا.",
                    "pilihan" => [
                        "يجيبون",
                        "تجيب",
                        "يجيب",
                        "يجبن",
                    ],
                    "jawaban" => "يجيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "نستعين ... الله في كل أمر.",
                    "pilihan" => [
                        "على ",
                        "ب",
                        "من",
                        "في",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => ".... المسافر الحذاء في سفره.",
                    "pilihan" => [
                        "يمسك",
                        "يستعمل",
                        "يحرس",
                        "يندم",
                    ],
                    "jawaban" => "يستعمل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "رأيت عديد من المتكلمين في الندوة العالمية. العديد في هذه الجملة تعني ؟",
                    "pilihan" => [
                        "ماهر",
                        "نابغة",
                        "قليل",
                        "كثير",
                    ],
                    "jawaban" => "كثير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "هو ..... الطلاب في هذا الفصل.",
                    "pilihan" => [
                        "ماهر",
                        "ماهرة",
                        "أمهر",
                        "أماهر",
                    ],
                    "jawaban" => "أمهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "أن – لك – الدروس – تجتهد – في –ينبغي ",
                    "pilihan" => [
                        "أن تجتهد لك في الدروس ينبغي",
                        "تجتهد في الدروس أن ينبغي لك",
                        "ينبغي لك أن تجتهد في الدروس",
                        "ينبغي أن تجتهد في الدروس لك",
                    ],
                    "jawaban" => "ينبغي لك أن تجتهد في الدروس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "المالك – وفدا – أربعين – من – بعث – القصر",
                    "pilihan" => [
                        "المالك بعث وفدا من أربعين القصر ",
                        "بعث المالك أربعين وفدا من القصر",
                        "بعث المالك أربعين القصر من وفدا",
                        "المالك بعث أربعين القصر من وفدا",
                    ],
                    "jawaban" => "بعث المالك أربعين وفدا من القصر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "رسالة – خبرا – تأتي – فيها - أخي – أجيد – من – مهما ",
                    "pilihan" => [
                        "تأتي أخي خبر رسالة فيها خبرا من مهما",
                        "تأتي خبر من رسالة أجيد فيها أخي مهما",
                        "تأتي رسالة من أخي أجيد خبرا مهما فيها",
                        "تأتي رسالة من أخي أجيد فيها خبرا مهما",
                    ],
                    "jawaban" => "تأتي رسالة من أخي أجيد فيها خبرا مهما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "إذا غابت الشمس أتى ...",
                    "pilihan" => [
                        "الأسد",
                        "النور",
                        "الظلام",
                        "الملائكة",
                    ],
                    "jawaban" => "الظلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'أودع أستاذي حين أراد السفر للحج. كلمة "أستاذي".....',
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "مفعول به",
                        "خبر",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'تُخْتَبَرُ مهارة التلميذ في الإختبار. كلمة "مهارة"......',
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "مفعول به",
                        "خبر",
                    ],
                    "jawaban" => "نائب الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'يزن التاجر سلعة بالجرام. كلمة "سلعة"....',
                    "pilihan" => [
                        "مفعول به",
                        "مفعول مطلق",
                        "تمييز",
                        "حال",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "تضع المرأة الزهرية ... المنضدة.",
                    "pilihan" => [
                        "من",
                        "ل ",
                        "على",
                        "في",
                    ],
                    "jawaban" => "على",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "يصف الطبيب الدواء ... المريض. ",
                    "pilihan" => [
                        "من",
                        "ل ",
                        "على",
                        "في",
                    ],
                    "jawaban" => "ل ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'يُسقى الزرع ماء كافيا. كلمة "كافيا"....',
                    "pilihan" => [
                        "حال ",
                        "تمييز ",
                        "بدل",
                        "نعت",
                    ],
                    "jawaban" => "نعت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'ما رأيتُك عدة شهور. مفرد من "شهور"',
                    "pilihan" => [
                        "شهو",
                        "شهر",
                        "شهرة",
                        "أشهر",
                    ],
                    "jawaban" => "شهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "للرجل قلنسوة ...",
                    "pilihan" => [
                        "أسود",
                        "سوداء",
                        "سواد",
                        "سودان",
                    ],
                    "jawaban" => "سوداء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'من لم يذق مُرّ تعلم ساعة، تجرع ذل الجهل طول حياته. كلمة "مرّ"....',
                    "pilihan" => [
                        "فعل ماض",
                        "فعل أمر",
                        "مفعو به",
                        "خبر",
                    ],
                    "jawaban" => "مفعو به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "كتب أحمد ستة .....",
                    "pilihan" => [
                        "كتابا",
                        "كتب",
                        "كتبا",
                        "كتاب",
                    ],
                    "jawaban" => "كتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'من الأنبياء ثلاثمائة وخمسة عشر رجلا. كلمة "رجلا" ....',
                    "pilihan" => [
                        "مفعول به",
                        "تمييز",
                        "حال ",
                        "بدل",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "عليٌّ <u>طالب</u> إندونيسي؟",
                    "pilihan" => [
                        "مبتدأ",
                        "خبر",
                        "مبتدأ مؤخر",
                        "خبر مقدم",
                    ],
                    "jawaban" => "خبر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "يدرس حسن العلوم <u>الإسلامية</u> في الجامعة. ما إعراب الكلمة التي تحتحها خط؟",
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم",
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "ثم كسى العظام <u>لحمـا</u>",
                    "pilihan" => [
                        "نعت، منصوب",
                        "مفعول مطلق، منصوب",
                        "تمييز، منصوب",
                        "مبتدأ، مرفوع",
                    ],
                    "jawaban" => "تمييز، منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "يتكلم حسن باللغة العربية <u>جيدا</u>",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول فيه",
                        "مبتدأ مؤخر",
                        "مفعول مطلق",
                    ],
                    "jawaban" => "مفعول مطلق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "من ترك <u>نسكا</u> فعليه دم",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول فيه",
                        "مبتدأ مؤخر",
                        "حال",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "صلِ قائمـا فإن لم تستطع <u>فقاعدا</u> فإن لم تستطع فعلى جنب",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول فيه",
                        "مبتدأ مؤخر",
                        "حال",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "صلى المسلمون كل يوم خمس مرات <u>ابتغاء</u> مرضاة الله",
                    "pilihan" => [
                        "مفعول مطلق",
                        "مفعول فيه",
                        "مفعول له",
                        "مفعول به",
                    ],
                    "jawaban" => "مفعول له",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "فأما من أوتي <u>كتابه</u> بيمينه",
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "خبر",
                        "مفعول به",
                    ],
                    "jawaban" => "نائب الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "كان <u>عثمـان</u> بن عفان من أوائل المسلمين إسلاما",
                    "pilihan" => [
                        "خبر كان",
                        "مفعول مقدم",
                        "مبتدأ",
                        "اسم كان",
                    ],
                    "jawaban" => "اسم كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "كان عثمـان بن عفان من أوائل المسلمين <u>إسلاما</u>",
                    "pilihan" => [
                        "اسم كان",
                        "تمييز",
                        "صفة",
                        "خبر كان",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv5(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "القسم الثاني : فهم التراكيب والتعبيرات",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'يسرني أن تذهب إلى المدرسة . كلمة "أن تذهب" ....',
                    "pilihan" => [
                        "المصدر الصريح",
                        "المصدر المؤؤل",
                        "الخبر",
                        "تمييز",
                    ],
                    "jawaban" => "المصدر المؤؤل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'يؤلمني أن الهواء بارد. إعراب كلمة "بارد" ....',
                    "pilihan" => [
                        "منصوب",
                        "مجرور",
                        "مرفوع",
                        "مجزوم",
                    ],
                    "jawaban" => "مرفوع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'الطبيب يفحص المريض. ما الجمع من كلمة "الطبيب"....',
                    "pilihan" => [
                        "الطبيبون",
                        "الأطيب",
                        "الأطباب",
                        "الأطباء",
                    ],
                    "jawaban" => "الأطباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'من يتكاسل في وقت الرخاء يندم في وقت الأزمة. . إعراب كلمة "يندم" ....',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم",
                    ],
                    "jawaban" => "مجزوم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'إن الجو بارد هذه الأيام. ما موقف الإعراب كلمة "الجو" ....',
                    "pilihan" => [
                        "مبتدأ",
                        "خبر",
                        "اسم إن",
                        "خبر إن",
                    ],
                    "jawaban" => "اسم إن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'نزل القرآن الكريم منجما. ما موقف الإعراب كلمة " منجما" ....',
                    "pilihan" => [
                        "مفعول به",
                        "تمييز",
                        "حال",
                        "بدل",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'نزل القرآن الكريم منجما. ما المراد  بكلمة " منجما" ....',
                    "pilihan" => [
                        "حسب الأوقات",
                        "سورة فسورة",
                        "قليلا فقليلا",
                        "حسب الحوادث",
                    ],
                    "jawaban" => "قليلا فقليلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'كرّر التلميذ الإجابة. ماالبناء من كلمة "كرّر" ...',
                    "pilihan" => [
                        "مثال",
                        "أجواف",
                        "مضعف",
                        "صحيح",
                    ],
                    "jawaban" => "مضعف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'نصح الأستاذ حسن البصري تلاميذه. ما موقف الإعراب كلمة "حسن البصري" ...',
                    "pilihan" => [
                        "الخبر",
                        "الفاعل",
                        "البدل",
                        "نائب الفاعل",
                    ],
                    "jawaban" => "البدل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "أصغى الطالب .... كلام معلمه. ",
                    "pilihan" => [
                        "من ",
                        "ب",
                        "عن",
                        "إلى",
                    ],
                    "jawaban" => "إلى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "فاز أخوك محمد في مسابقة كرة القدم. علامة إعراب الفاعل في الجملة هي ....",
                    "pilihan" => [
                        "ضمة",
                        "واو",
                        "حذف النون",
                        "الف",
                    ],
                    "jawaban" => "واو",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "اخش عاقبة الإهمال. كلمة اخش ......",
                    "pilihan" => [
                        "فعل ماض",
                        "فعل مضارع",
                        "فعل امر",
                        "فعل مجهول",
                    ],
                    "jawaban" => "فعل امر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'لابد لنا أن نحصل على منافع العلم والعمل والأدب. ما المفرد من كلمة "منافع"...',
                    "pilihan" => [
                        "نافع",
                        "منفع",
                        "نفاعة",
                        "منفعة",
                    ],
                    "jawaban" => "منفعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "دعا المؤمن ربّه .... خيره وخير أهله.",
                    "pilihan" => [
                        "على",
                        "ب",
                        "ل",
                        "من",
                    ],
                    "jawaban" => "ل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "رضيت أمي ... قليل من الطعام والمنام",
                    "pilihan" => [
                        "على",
                        "ب",
                        "ل",
                        "من",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "سقى البستاني الأزهار .... ماء من القناة.",
                    "pilihan" => [
                        "على",
                        "ب",
                        "مع",
                        "من",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "كان الطالب يجتهد في مطالعة الدروس. الخبر في هذه الجملة هي ؟",
                    "pilihan" => [
                        "الطالب",
                        "يجتهد",
                        "مطالعة",
                        "كان",
                    ],
                    "jawaban" => "يجتهد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "يسجد المصلي في المسجد. كلمة المصلي ....",
                    "pilihan" => [
                        "اسم تصغير",
                        "ايم مقصور",
                        "اسم منقوص",
                        "اسم ممدود",
                    ],
                    "jawaban" => "اسم منقوص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "المجتهد فائز فهو فرح بفوزه. كلمة فائز .....",
                    "pilihan" => [
                        "اسم مصدر",
                        "اسم فاعل",
                        "اسم مفعول",
                        "اسم آلة",
                    ],
                    "jawaban" => "اسم فاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "قال محمد لأصدقائه : ... المعلم حاضر. ",
                    "pilihan" => [
                        "إن",
                        "إنه",
                        "أن",
                        "أنه",
                    ],
                    "jawaban" => "أن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "يا عائشة ! متى .... العطلة ؟",
                    "pilihan" => [
                        "تقضي",
                        "تقضين",
                        "يقضي",
                        "يقضين",
                    ],
                    "jawaban" => "تقضين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "العشب .... في الصيف. ",
                    "pilihan" => [
                        "جافٍ",
                        "جافٌ",
                        "جافًا",
                        "جافْ",
                    ],
                    "jawaban" => "جافٌ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "يصعب العمل على الكسلان. ",
                    "pilihan" => [
                        "الكسلانِ",
                        "الكسلانَ",
                        "الكسلانُ",
                        "الكسلانْ",
                    ],
                    "jawaban" => "الكسلانِ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "أموت ويبقى كل ما قد كتبته. كلمة قد....",
                    "pilihan" => [
                        "الاستقبال",
                        "التمني",
                        "التوكيد",
                        "التراجي",
                    ],
                    "jawaban" => "التوكيد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "ذهب .... عمال إلى المصنع. ",
                    "pilihan" => [
                        "سبع",
                        "سبعة",
                        "سبع عشر",
                        "سبعة وعشرين",
                    ],
                    "jawaban" => "سبعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "في كلية الطب أربعمائة .....",
                    "pilihan" => [
                        "طالبًا",
                        "طالبٌ",
                        "طالبٍ",
                        "طلاب",
                    ],
                    "jawaban" => "طالبٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "في سورة الضحى ..... أية.",
                    "pilihan" => [
                        "أحد عشرة",
                        "إحدى عشر",
                        "أحد عشر",
                        "إحدى عشرة",
                    ],
                    "jawaban" => "إحدى عشرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "أنزل .... القطار.",
                    "pilihan" => [
                        "على",
                        "من",
                        "في",
                        "ب",
                    ],
                    "jawaban" => "من",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'يستغل المرء في النهار. ما موقف الإعراب كلمة "المرء" ؟',
                    "pilihan" => [
                        "الفاعل",
                        "نائب الفاعل",
                        "مفعول به",
                        "مصدر",
                    ],
                    "jawaban" => "الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'قرأ التلميذ الدرس على مهل ففهم. ما البناء من كلمة "قرأ" ....',
                    "pilihan" => [
                        "مضاعف",
                        "مهموز",
                        "لفيف",
                        "أجواف",
                    ],
                    "jawaban" => "مهموز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'تخاف الفأرة من القط. ما البناء من كلمة " تخاف " ....',
                    "pilihan" => [
                        "مضاعف",
                        "مهموز",
                        "لفيف",
                        "أجواف",
                    ],
                    "jawaban" => "أجواف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'ظننت الامتحان سهلا، بل هو صعب. ما الاعراب من كلمة "الامتحان" ...',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم",
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'رأيت ما فعل القاضي. حرف "ما" في الجملة السابقة ؟',
                    "pilihan" => [
                        "موصولة",
                        "التعجب",
                        "استفهام",
                        "النافي",
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "المعلم يقضي وقته ... عمل نافع.",
                    "pilihan" => [
                        "في",
                        "على",
                        "ل",
                        "ب",
                    ],
                    "jawaban" => "ل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "رأيت الأزهار المتنوعة في....",
                    "pilihan" => [
                        "حدائقَ واسعَةٍ",
                        "حدائقٍ واسعةٍ",
                        "حدائقًا واسعةً",
                        "حدائقِ واسعةً",
                    ],
                    "jawaban" => "حدائقَ واسعَةٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'يذهب والدي إلى المزرعة مبكرا. ما موقف الإعراب "مبكرا" ....',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول مطلق",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "يتكلم الخطيب و .... السامع.",
                    "pilihan" => [
                        "ينصر",
                        "يشرح",
                        "يسكت",
                        "يسمع",
                    ],
                    "jawaban" => "يسكت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "..... التجارة وتحرم المقامرة.",
                    "pilihan" => [
                        "تجوز",
                        "تباح",
                        "تحلّ",
                        "تمنع",
                    ],
                    "jawaban" => "تحلّ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "لا يصدق المنافق بل ....",
                    "pilihan" => [
                        "يسكت",
                        "يكذب",
                        "يتكلم",
                        "يقتل",
                    ],
                    "jawaban" => "يكذب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "الجو بارد هذا الأيام",
                        "يؤلمني رجلي في المسابقة.",
                        "لا يذهب يا محمد!",
                        "تمنعني أمي عن مزاح كثير",
                    ],
                    "jawaban" => "تمنعني أمي عن مزاح كثير",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv5(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>يُحكى أنّ رجلا عجوزًا كان يعيش في قرية بعيدة، وكان أتعس شخص على وجه الأرض، حتى أنّ كلّ سكان القرية سئموا منه، لأنه كان محبطًا على الدوام، ولا يتوقّف عن التذمر والشكوى، ولم يكن يمرّ يوم دون أن تراه في مزاج سيء. وكلّما تقدّم به السنّ، ازداد كلامه سوءًا وسلبية.  كان سكّان القرية ينجنّبونه قدر الإمكان، فسوء حظّه أصبح مُعديًا. ويستحيل أن يحافظ أيّ شخص على سعادته بالقرب منه. لقد كان ينشر مشاعر الحزن والتعاسة لكلّ من حوله. </p>
                    <p>لكن، وفي أحد الأيام وحينما بلغ العجوز من العمر ثمانين عامًا، حدث شيء غريب، وبدأت إشاعة عجيبة في الانتشار: </p>
                    <p>"الرجل العجوز سعيد اليوم، إنه لا يتذمّر من شيء، والابتسامة ترتسم على محيّاه، بل إن ملامح وجهه قد أشرقت وتغيّرت!" </p>
                    <p> تجمّع القرويون عند منزل العجوز، وبادره أحدهم بالسؤال: - "ما الذي حدث لك؟" وهنا أجاب العجوز: - "لا شيء مهمًّا...لقد قضيتُ من عمري 80 عامًا أطارد السعادة بلا طائل. ثمّ قرّرت بعدها أن أعيش من دونها، وأن أستمتع بحياتي وحسب، لهذا السبب أنا سعيد الآن!" </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => " لماذا سئم أهل القرية للعجوز؟ ",
                    "pilihan" => [
                        "لأنه كان مغصونا على الدوام",
                        "لأنه كان متسامحا على الدوام",
                        "لأنه كان محبطًا على الدوام",
                        "لأنه كان مغنيا على الدوام",
                    ],
                    "jawaban" => "لأنه كان محبطًا على الدوام",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "كيف كان العجوز إذا زاد منه العمر؟",
                    "pilihan" => [
                        "ازداد صحاته",
                        "ازداد كلامه حلوة",
                        "ازداد صالحا  ",
                        "ازداد كلامه سوءًا وسلبية",
                    ],
                    "jawaban" => "ازداد كلامه سوءًا وسلبية",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "لماذا يبعد عنه سكان القرية؟ ",
                    "pilihan" => [
                        "ينشر مشاعر الحزن والمزاح لكلّ من حوله",
                        "ينشر مشاعر الحزن والتعاسة لكلّ من حوله",
                        "ينشر مشاعر الفرح والتعاسة لكلّ من حوله",
                        "ينشر مشاعر الحزن والسعادة لكلّ من حوله",
                    ],
                    "jawaban" => "ينشر مشاعر الحزن والتعاسة لكلّ من حوله",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'المرادف من كلمة "بادر" .... ',
                    "pilihan" => [
                        "أسلف",
                        "أوجد",
                        "سارع",
                        "استمتع",
                    ],
                    "jawaban" => "سارع",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'المضاد من كلمة "بادر" .... ',
                    "pilihan" => [
                        "آجل",
                        "عاجل",
                        "سارع",
                        "منع",
                    ],
                    "jawaban" => "آجل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "متى تغير صفة العجوز؟",
                    "pilihan" => [
                        "قبل بلغ ٨٠ من عمره",
                        "عند بلغ ٨٠ من عمره",
                        "قبيل بلغ ٨٠ من عمره",
                        "عند بلغ ٧٠ من عمره",
                    ],
                    "jawaban" => "عند بلغ ٨٠ من عمره",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "العبرة من القصة السابقة هي....",
                    "pilihan" => [
                        "لا تطارد السعادة",
                        "لا تكن عجوزا",
                        "لا تقارب بالعجوز",
                        "لا تقابل السعادة",
                    ],
                    "jawaban" => "لا تطارد السعادة",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>نشأ الرشيد في بيت ملك، وأُعد ليتولى المناصب القيادية في الخلافة، وعهد به أبوه الخليفة “المهدي"  إلى من يقوم على أمره تهذيبًا وتعليمًا وتثقيفًا، وحسبك أن يكون من بين أساتذة الأمير الصغير “الكسائي”، والمفضل الضبي، وهما مَن هما علمًا ولغة وأدبًا، حتى إذا اشتد عوده واستقام أمره، ألقى به أبوه في ميادين الجهاد، وجعل حوله القادة الأكفاء، يتأسى بهم، ويتعلم من تجاربهم وخبراتهم، فخرج في عام (165 هـ / 781م) على رأس حملة عسكرية ضد الروم، وعاد محملاً بأكاليل النصر، فكوفئ على ذلك بأن اختاره أبوه وليًا ثانيًا للعهد بعد أخيه موسى الهادي.</p>
                    <p>وكانت الفترة التي سبقت خلافته يحوطه في أثنائها عدد من الشخصيات السياسية والعسكرية، من أمثال “يحيى بن خالد البرمكي”، و”الربيع بن يونس”، و”يزيد بن مزيد الشيباني” و”الحسن بن قحطبة الطائي”، و”يزيد بن أسيد السلمي”، وهذه الكوكبة من الأعلام كانت أركان دولته حين آلت إليه الخلافة، ونهضوا معه بدولته حتى بلغت ما بلغت من التألق والازدهار.</p>
                    <p>تمت البيعة للرشيد بالخلافة في (14 من شهر ربيع الأول 170هـ / 14 من سبتمبر 786م)، بعد وفاة أخيه موسى الهادي، وبدأ عصر زاهر كان واسطة العقد في تاريخ الدولة العباسية التي دامت أكثر من خمسة قرون، ارتقت فيه العلوم، وسمت الفنون والآداب، وعمَّ الرخاء ربوع الدولة.</p>
                    <p>وكانت الدولة العباسية حين آلت خلافتها إليه مترامية الأطراف تمتد من وسط أسيا حتى المحيط الأطلنطي، مختلفة البيئات، متعددة العادات والتقاليد، معرضة لظهور الفتن والثورات، تحتاج إلى قيادة حكيمة وحازمة يفرض سلطانها الأمن والسلام، وتنهض سياستها بالبلاد. وكان الرشيد أهلاً لهذه المهمة الصعبة في وقت كانت فيه وسائل الاتصال شاقة، ومتابعة الأمور مجهدة، وساعده على إنجاز مهمته أنه أحاط نفسه بكبار القادة والرجال من ذوي القدرة والكفاءة، ويزداد إعجابك بالرشيد حين تعلم أنه أمسك بزمام هذه الدولة العظيمة وهو في نحو الخامسة والعشرين من عمره، فأخذ بيدها إلى ما أبهر الناس من مجدها وقوتها وازدهار حضارتها.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'المرادف من كلمة "أب".... ',
                    "pilihan" => [
                        "ولد",
                        "والد",
                        "بعل",
                        "وابل",
                    ],
                    "jawaban" => "والد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'من هو "الكسائي"؟',
                    "pilihan" => [
                        "صاحب هارون الرشيد",
                        "مترجم هارون الرشيد",
                        "معلم هارون الرشيد",
                        "متعلم هارون الرشيد",
                    ],
                    "jawaban" => "معلم هارون الرشيد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'المضاد من كلمة "العود" .....',
                    "pilihan" => [
                        "الانتقال",
                        "الرجوع",
                        "الثبات",
                        "الذهاب",
                    ],
                    "jawaban" => "الذهاب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "متى تولى هارون الرشيد الخلافة؟",
                    "pilihan" => [
                        "٧٨١ م",
                        "١٧٢ هـ",
                        "٧٨٦ م",
                        "١٦٥ هـ",
                    ],
                    "jawaban" => "٧٨٦ م",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "موسى الهادي، هو ...... هارون الرشيد.",
                    "pilihan" => [
                        "عم",
                        "معلم",
                        "أخو",
                        "ولد",
                    ],
                    "jawaban" => "أخو",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "كيف كانت الدولة العباسية في عهد هارون الرشيد؟",
                    "pilihan" => [
                        "متبثرا",
                        "مكسورا",
                        "مطمئنا",
                        "متخلفا",
                    ],
                    "jawaban" => "مطمئنا",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ويزداد إعجابك بالرشيد حين تعلم أنه أمسك بزمام هذه الدولة العظيمة وهو في نحو ....... من عمره. ",
                    "pilihan" => [
                        "٢٥",
                        "٣٥",
                        "١٥",
                        "٤٥",
                    ],
                    "jawaban" => "٢٥",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'المرادف من كلمة "الفترة".... ',
                    "pilihan" => [
                        "الوقت",
                        "الزمان",
                        "العصر",
                        "الراحة",
                    ],
                    "jawaban" => "الزمان",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ما الشخصية المفضلة في هذه القصة؟ ",
                    "pilihan" => [
                        "المهدي",
                        "الكسائي",
                        "موسى الهادي",
                        "هارون الرشيد",
                    ],
                    "jawaban" => "هارون الرشيد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "ما العنوان المناسب للقصة السابقة؟",
                    "pilihan" => [
                        "سيرة هارون الرشيد",
                        "خلافة هارون الرشيد",
                        "إعجاب هارون الرشيد",
                        "قضايا هارون الرشيد",
                    ],
                    "jawaban" => "سيرة هارون الرشيد",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يُحكى أنه كان في الغابة قردان صديقان أحدهما منحوس والأخر محظوظ بكل الأشياء، وفي يوم من الأيام اتفق القردان على أن يذهبا إلى مزرعة على مقربة منهما لجلب الموز وتناوله، ووضعا خطة لذلك تقتضي أن يبقى القرد المنحوس على الأرض فيما يصعد القرد المحظوظ إلى شجرة الموز ليقطفه ويلقيه للمنحوس في الأسفل، رأى المزارع القردان وهما يسرقان الموز فأمسك القرد المنحوس وأبرحه ضرباً فيما هرب القرد المحظوظ وهو يمسك قطف الموز، وفي المرة الثانية تكرر ما حصل وأبرح المزارع القرد المنحوس ضرباً أيضاً، إلى أن قرر القردان أن يتبادلا الأدوار. فصعد القرد المنحوس ليقطف الموز هذه المرة، فيما بقي المحظوظ على الأرض، وعندما رآهما المزارع أمسك القرد المحظوظ ليضربه، إلّا أنّه قرر أن يضرب القرد الموجود في أعلى الشجرة هذه المرة لا الموجود في أسفلها كما يفعل دائما، وبذلك أُبرح القرد المنحوس ضرباً للمرة الثالثة على التوالي فيما فرّ القرد المحظوظ ضاحكاً.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "أين يعيش منحوس؟",
                    "pilihan" => [
                        "الغابة",
                        "المزرعة",
                        "حديقة الحيوان",
                        "الحظيرة",
                    ],
                    "jawaban" => "الغابة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "بما اتفق القردان؟",
                    "pilihan" => [
                        "بأن يأكلا مرتبا",
                        "بأن يناما هادئا",
                        "بأن يتبادلا الأدوار",
                        "بأن يدورا الغابة",
                    ],
                    "jawaban" => "بأن يتبادلا الأدوار",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "أين نبت الموز؟",
                    "pilihan" => [
                        "في الغابة",
                        "في المزرعة",
                        "في الحديقة",
                        "في الحقل",
                    ],
                    "jawaban" => "في المزرعة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "لماذا ذهب القردان إلى المزرعة؟",
                    "pilihan" => [
                        "لأخذ النبات",
                        "لجلب الموز",
                        "لحوار مع المزارع",
                        "لتجول",
                    ],
                    "jawaban" => "لجلب الموز",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'المضاد من كلمة "هرب" ....',
                    "pilihan" => [
                        "وقع",
                        "جرى",
                        "سارع",
                        "واجه",
                    ],
                    "jawaban" => "واجه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "من يضرب القرد المنحوس؟ ",
                    "pilihan" => [
                        "الراعي ",
                        "المحظوظ",
                        "المزارع",
                        "الداعي",
                    ],
                    "jawaban" => "المزارع",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "لماذا ضُرب المنحوس؟",
                    "pilihan" => [
                        "لأنه ضحك على الموز",
                        "لأنه نظر الموز",
                        "لأنه نبت الموز",
                        "لأنه سرق الموز",
                    ],
                    "jawaban" => "لأنه سرق الموز",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "كيف كان يفرّ المحظوظ في نهاية الأمر؟",
                    "pilihan" => [
                        "متسائما",
                        "مضحكا",
                        "محزنا",
                        "متبادلا",
                    ],
                    "jawaban" => "مضحكا",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>غاب موسى -عليه السلام- عن قومه أربعين يوماً، وكان بنو إسرائيل قد انتظروا عشرين يوماً، وظنّوا أنّه لن يعود، فظهر رجلٌ منهم يُدعى السامريّ، وصنع لهم عجلاً من الحليّ، وادّعى أنّه إلهُهم، وأنّ عليهم عبادته، ففُتِن القوم، وعبدوه من دون الله، ويُشار إلى أنّ هارون -عليه السلام- كان قد نهاهم عن ذلك، وأمرهم بالرجوع عن فِعلهم، وحثّهم على عبادة الله ربّ العالَمين، فلم يستجيبوا له، بل اشتدّ تمسُّكهم بعبادة العجل، فلمّا عاد موسى -عليه السلام- بما وعدهم، ووجدهم على حالهم، عاتبَ أخاه هارون -عليه السلام-، فأخبره أنّهم استضعفوه، وكادوا يقتلونه، فلم يقوَ على رَدعهم، ثمّ ذهب موسى إلى السامريّ، فسأله عن فِعلته، فكان ردّه أنّه يملك ما لا يملكه بنو إسرائيل من بصيرةٍ، فما كان من موسى -عليه السلام- إلّا أن حرَّقَ العجل، ونسفَ رماده نَسفاً، وأخبره أنّ له عقوبة في الدُّنيا، وفي الآخرة، قال -تعالى-: (قَالَ فَاذْهَبْ فَإِنَّ لَكَ فِي الْحَيَاةِ أَنْ تَقُولَ لَا مِسَاسَ ۖ وَإِنَّ لَكَ مَوْعِدًا لَنْ تُخْلَفَهُ ۖ وَانْظُرْ إِلَىٰ إِلَٰهِكَ الَّذِي ظَلْتَ عَلَيْهِ عَاكِفًا ۖ لَنُحَرِّقَنَّهُ ثُمَّ لَنَنْسِفَنَّهُ فِي الْيَمِّ نَسْفًا)؛ فلا إله إلّا الله وحده.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "كم مدة غاب موسى عن قومه؟",
                    "pilihan" => [
                        "أقل من شهر",
                        "زاد من شهرين",
                        "أكثر من شهرين",
                        "أكثر من شهر",
                    ],
                    "jawaban" => "أكثر من شهر",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "من هو السامريّ؟",
                    "pilihan" => [
                        "أخو موسى عليه السلام",
                        "رجل من بني إسرائيل",
                        "جند فرعون",
                        "خليل الله",
                    ],
                    "jawaban" => "رجل من بني إسرائيل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "كيف معاملة بنو إسرائيل هارون عليه السلام؟",
                    "pilihan" => [
                        "يطيعونه",
                        "يسمعوه",
                        "ينكرونه",
                        "يسجدونه",
                    ],
                    "jawaban" => "ينكرونه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "من صنع عجلا بينهم؟",
                    "pilihan" => [
                        "السامري",
                        "القاضي",
                        "موسى عليه السلام",
                        "هارون عليه السلام",
                    ],
                    "jawaban" => "السامري",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "كيف ظنّ بنو إسرائيل عن موسى عليه السلام؟",
                    "pilihan" => [
                        "أنه مات",
                        "أنه جائع",
                        "أنه لن يعود",
                        "أنه في غمراة الموت",
                    ],
                    "jawaban" => "أنه لن يعود",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "كيف كان معاملة موسى بهارون عليهما السلام بعد رجوعه؟",
                    "pilihan" => [
                        "غضب له",
                        "رضي له",
                        "ضربه",
                        "خاصمه",
                    ],
                    "jawaban" => "غضب له",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "لماذا فعل السامري عن أمر؟",
                    "pilihan" => [
                        "لأنه رجل من بني إسرائيل",
                        "لأنه عنده بصيرة",
                        "لأنه عنده عجلا",
                        "لأنهم صدقوا بهم",
                    ],
                    "jawaban" => "لأنه عنده بصيرة",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان جحا يتسوّق ذات يوم فجاء رجل من الخلف وصفعه على خده، فالتفت إليه جحا وأراد أن يتعارك معه ولكنّ الرجل اعتذر بشدة قائلاً: إني آسف يا سيدي فقد ظننتك فلاناً، فلم يقبل جحا هذا العذر وأصرّ على محاكمته ولمّا علا صياحهما اقترح الناس أن يذهبا إلى القاضي ليحكم بينهما، فذهبا إلى القاضي، وصادف أن يكون ذلك القاضي قريباً للجاني ولمّا سمع القاضي القصة غمز لقريبه بعينه (يعني لا تقلق فسأخلصك من هذه الورطة)، ثمّ أصدر حكمه بأن يدفع الرجل لجحا مبلغ 20 ديناراً كعقوبة على ضربه.</p>
                    <p> فقال الرجل: ولكن يا سيدي القاضي ليس معي شيئا الآن، فقال القاضي وهو يغمز له أذهب واحضرها حالاً وسينتظرك جحا عندي حتى تحضرها، فذهب الرجل وجلس جحا في مجلس القاضي ينتظر غريمه حتى يحضر المال، ومرت الساعات ولم يحضر الرجل، ففهم جحا الخدعة خاصة أنًه كان يبحث عن تفسير لتلك الغمزات التي وجهها القاضي لغريمه، فلما أدرك جحا أنّه خُدع من قِبل القاضي وقريبه قام وتوجّه إلى القاضي وصفعه على خده صفعة طارت منها عمامته وقال له: إذا أحضر غريمي الـ 20 ديناراً فخذها لك حلالاً طيباً وانصرف.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "لماذا غضب جحا إلى رجل؟",
                    "pilihan" => [
                        "لأنه قد نصحه",
                        "لأنه قد سمعه",
                        "لأنه قد التفت له",
                        "لأنه قد ضربه",
                    ],
                    "jawaban" => "لأنه قد ضربه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "إلى من توجه جحا والرجل؟",
                    "pilihan" => [
                        "الرئيس",
                        "الراعي",
                        "القاضي",
                        "الملك",
                    ],
                    "jawaban" => "القاضي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "لماذا تأذر الرجل إلى جحا؟",
                    "pilihan" => [
                        "لأنه أخطأ",
                        "لأنه يتجب",
                        "لأنه أمام القاضي",
                        "لأن من رجل ثري",
                    ],
                    "jawaban" => "لأنه أخطأ",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "هل دفع الرجل غريم جحا؟ ",
                    "pilihan" => [
                        "نعم، دفع الرجل غريم جحا",
                        "لا، لن دفع الرجل غريم جحا",
                        "نعم، دفع الرجل غريم جحا",
                        "لا، ما دفع الرجل غريم جحا",
                    ],
                    "jawaban" => "لا، ما دفع الرجل غريم جحا",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "من خدع في القصة السابقة؟",
                    "pilihan" => [
                        "جحا",
                        "الرجل",
                        "القاضي",
                        "الناس",
                    ],
                    "jawaban" => "القاضي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "أين تعمل القاضي؟",
                    "pilihan" => [
                        "في الكسرى",
                        "في القصر",
                        "في المحكمة",
                        "في السوق",
                    ],
                    "jawaban" => "في المحكمة",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p> قُتل عمر بن الخطاب -رضي الله عنه- وهو خليفة المسلمين وأمير المؤمنين، حين كان يؤمّ المسلمين في صلاة الفجر، وحصل ذلك حين استوت الصفوف للصلاة، وكبّر عمر -رضي الله عنه- لبدء الصلاة، فانطلق رجلٌ بسرعةٍ كبيرةٍ بين الصفوف، فطعن عمر -رضي الله عنه-، وشقّ بطنه، وكان أبو لؤلؤة المجوسي، ثمّ فرّ هارباً يطعن كلّ من يلاقي في طريقه، فقتل غير عمر سبعة رجالٍ، وجرح أحد عشر رجلاً، ثمّ رمى عليه أحد الرجال كساءً، فأمسك به، فنحر أبو لؤلؤة نفسه ومات، وبعد مرور فترةٍ وجيزةٍ مات عمر -رضي الله عنه-.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "ما الموضوع المناسب للقصة السابقة؟",
                    "pilihan" => [
                        "شجاع عمر بن الخطاب",
                        "استشهاد عمر بن الخطاب",
                        "صفة عمر بن الخطاب",
                        "كرمة عمر بن الخطاب",
                    ],
                    "jawaban" => "استشهاد عمر بن الخطاب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "متى قتل عمر بن الخطاب؟",
                    "pilihan" => [
                        "عند الصبح",
                        "عند الظهر",
                        "عند المساء",
                        "عند الليل",
                    ],
                    "jawaban" => "عند الصبح",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "كيف كان وفاة عمر بن الخطاب؟",
                    "pilihan" => [
                        "بضرب ",
                        "بحرب",
                        "بطعن",
                        "بشجاع",
                    ],
                    "jawaban" => "بطعن",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "من هو أبو لؤلؤة المجوسي؟",
                    "pilihan" => [
                        "المأموم",
                        "الإمام",
                        "القاتل",
                        "المقتول",
                    ],
                    "jawaban" => "القاتل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "كم عدد المقتول في ذالك الفجر؟",
                    "pilihan" => [
                        "سبعة رجال",
                        "ثمانية رجال",
                        "تسعة رجال",
                        "عشرة رجال",
                    ],
                    "jawaban" => "ثمانية رجال",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "كيف كان عمر في ذالك الفجر؟",
                    "pilihan" => [
                        "كان إماما",
                        "كان مأموما",
                        "كان مؤذنا",
                        "كان منفردا",
                    ],
                    "jawaban" => "كان إماما",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يحكى أنّ شاباً ثرثاراً رأي شيخاً كبيراً ذو دقن طويلة غزاها الشيب يجلس مرّة على باب سوق، فأراد هذا الشاب أن يبدأ معه حديثاً يسليه به، فأتى إليه وسلّم عليه وقال له: هل بسؤال ياعم؟ فقال له الشيخ الكبير: تفضّل يا بني، فقال الشاب: أتضع ذقنك هذه فوق اللحاف عند نومك يا عمّاه أم تحته؟ سكت العجوز برهة ولم يعرف لسؤال هذا الشاب جواباً؛ ذلك لأنّه لم يتفطّن لما يفعله به عند نومه من قبل، لكّنه وعده أن يلاحظ ما هو فاعل به عندما ينام الليلة، وفي الصباح انطلق العجوز باحثاً عن الشاب في السوق بكل عزمه، ولمّا لقيه سلّم عليه وانهال عليه ضرباً وقال له: أربعون عاماً وأنا أحمل ذقني أينما حللت ولا أشعر منه بثِقل لا في نوم، ولا في طعام ولا في شراب، أمّا الليلة فقد جافاني النوم ولم أعرف له طريق، إن رفعتها فوق اللحاف أحسست بأنني مشنوق، وإن وضعتها تحت اللحاف أحسست بأنني مخنوق، فاذهب لا بارك الله في أعدائك ولا سلّطك بثرثرتك هذه على أحد.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "لماذا أراد الشاب أن يتكلم بشيخ؟",
                    "pilihan" => [
                        " تسلية به",
                        " مزاحا له",
                        " خوفا منه",
                        " تعظيما له",
                    ],
                    "jawaban" => " تسلية به",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "لماذا سكت الشيخ؟",
                    "pilihan" => [
                        "لأنه صائم",
                        "لأنه مريض",
                        "لأنه لم يعرف الإجابة",
                        "لأنه لم يفهم السؤال",
                    ],
                    "jawaban" => "لأنه لم يعرف الإجابة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "من يكون ثرثارا في القصة السابقة؟",
                    "pilihan" => [
                        "الشاب",
                        "العجوز",
                        "الشيخ",
                        "الناس",
                    ],
                    "jawaban" => "الشاب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => 'المضاد من كلمة "ثقيل"... ',
                    "pilihan" => [
                        "جاف",
                        "خفيف",
                        "ضخل",
                        "ضحم",
                    ],
                    "jawaban" => "خفيف",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'المرادف من كلمة "سكت" ....',
                    "pilihan" => [
                        "صام",
                        "أجب",
                        "عامر",
                        "صمت",
                    ],
                    "jawaban" => "صمت",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "أين المكان الذي حدث  القصة السابقة ؟",
                    "pilihan" => [
                        "القرية",
                        "البلاد",
                        "السوق",
                        "المنزل",
                    ],
                    "jawaban" => "السوق",
                ],
            ],
            
        ];

        return $data;
    }

    // soal to 2
    public function get_soal_to_2(){
        $data = [
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => " سافر علي وأصحابه إلى البحر الجميل خارج المدينة.  جمع الكلمة البحر.... ",
                    "pilihan" => [
                        "البُحير",
                        "البَحارالبِحار",
                        "البِاحر",
                        "بُحُر",
                    ],
                    "jawaban" => "البِاحر",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => " اسمي أحمد. وكان أبي ..... إسماعيل",
                    "pilihan" => [
                        "والده",
                        "ولده",
                        "والدهم",
                        "ولدهما",
                    ],
                    "jawaban" => "والده",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => " عرف القريش بأن عزلة النبي في غار حراء.  معنى كلمة عزلة....  ",
                    "pilihan" => [
                        "عدم ترك الناس",
                        "عدم اتصال مع الناس",
                        "انفرد في الغار",
                        "استأذن للغياب",
                    ],
                    "jawaban" => "عدم اتصال مع الناس",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " مهنة عم زهران هي صيدلي. معنى كلمة صيدلي.... ",
                    "pilihan" => [
                        "Apotek",
                        "Apoteker",
                        "Hipotek",
                        "Ramuan",
                    ],
                    "jawaban" => "Apoteker",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => " أجفّف الثياب في..... ",
                    "pilihan" => [
                        "الحمام",
                        "تحت ضوء الشمس",
                        "غرفة الأكل",
                        "غرفة النوم",
                    ],
                    "jawaban" => "تحت ضوء الشمس",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => " درستْ أختي الكبيرة العلوم ...... في المعهد.  ",
                    "pilihan" => [
                        "الديني",
                        "الدينية",
                        "ديني",
                        "دينية",
                    ],
                    "jawaban" => "الدينية",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => ' لحظنا بيت زيد من بعيد. والجملة "بيت زيد" هي جملة إضافية بمعنى: ',
                    "pilihan" => [
                        "من",
                        "الباء",
                        "في",
                        "اللام",
                    ],
                    "jawaban" => "اللام",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => " قرأت ......  في مكتبة المدرسة. ",
                    "pilihan" => [
                        "كتاب واحد",
                        "الكتاب الواحد",
                        "كتاب واحدة",
                        "الكتاب الواحدة",
                    ],
                    "jawaban" => "الكتاب الواحد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => ' ركب محمد الحصان في الملعب.  و...... حسين من سيارته.  مضاد الكلمة "ركب" ....',
                    "pilihan" => [
                        "ارتكب",
                        "انصرف",
                        "نزل",
                        "جرى",
                    ],
                    "jawaban" => "نزل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => " أريد أن أملك .....  الكثيرة",
                    "pilihan" => [
                        "بيت",
                        "البيوت",
                        "البيت",
                        "بيوت",
                    ],
                    "jawaban" => "البيوت",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => " إشتريت لك الكتاب الجديد ..... منه الدروس",
                    "pilihan" => [
                        "لأتعلم",
                        "لنتعلم",
                        "ليتعلم",
                        "لتتعلم",
                    ],
                    "jawaban" => "لتتعلم",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => " ..... إبراهيم في مسابقة الفوازر قبل شهر.",
                    "pilihan" => [
                        "نجحت",
                        "ينجح",
                        "نجح",
                        "تنجح",
                    ],
                    "jawaban" => "نجح",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => " فتش المعلم ...... امتحان الطلاب. ",
                    "pilihan" => [
                        "حمام",
                        "رسالة",
                        "إجابة",
                        "أجوِبة",
                    ],
                    "jawaban" => "أجوِبة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => " أحمد وإبراهيم ...... وسكنا في بيت أحمد. ",
                    "pilihan" => [
                        "أخان",
                        "اخوان",
                        "أخوين",
                        "أخاين",
                    ],
                    "jawaban" => "أخان",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => " بيت المعلم ..... المدرسة. ",
                    "pilihan" => [
                        "قريب عن",
                        "قريب من",
                        "القريب عن",
                        "قريب ل ",
                    ],
                    "jawaban" => "قريب من",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => " يا طلاب فصلي لن ...... في الامتحان إذا كنتم مهملين في الدراسة.  ",
                    "pilihan" => [
                        "نجحوا",
                        "تنجحنا",
                        "تنجحوا",
                        "تنجح",
                    ],
                    "jawaban" => "تنجحوا",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => " يا مريم .....  الدرس",
                    "pilihan" => [
                        "كتابا",
                        "كتب",
                        "اكتب",
                        "اكتبي",
                    ],
                    "jawaban" => "اكتبي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => " سأفطر بالمرق غدا، وبالأمس قد ..... ",
                    "pilihan" => [
                        "تفطر التفاح",
                        "فطرت التفاح",
                        "فاطرت التفاح",
                        "أفطر التفاح",
                    ],
                    "jawaban" => "فاطرت التفاح",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => " كلّما أتت السنة الجديدة أو أيام العيد ...... المدارس. ",
                    "pilihan" => [
                        "فتحت",
                        "سجّلت",
                        "تعطّلت",
                        "تقطّعت",
                    ],
                    "jawaban" => "تعطّلت",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => " يسد الفلاح حاجة أهله فيجد في الشغل ويسعى .... اصلاح معيشته. ",
                    "pilihan" => [
                        "ب",
                        "إلى",
                        "إلى",
                        "في",
                    ],
                    "jawaban" => "في",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هي فاطمة بنت محمدٍ -صلّى الله عليه وسلّم-، ابنته من زوجته خديجة بنت خويلد بن أسد بن عبد العزّى بن قصي -رضي الله عنها-، ويُشار إلى أنّ نسل الرسول -صلّى الله عليه وسلّم- لم يستمرّ إلّا عن طريق فاطمة الزهراء -رضي الله عنها-. تُعَدّ السيّدة فاطمة -رضي الله عنها- أصغر بنات النبيّ -صلّى الله عليه وسلّم-، على خِلافٍ بين العلماء بينها وبين رقية -رضي الله عنهما-، وقد ورد في ترتيب بنات النبيّ أنّ الأولى كانت زينب، ثمّ رقيّة، ثمّ أمّ كلثوم، ثمّ فاطمة -رضي الله عنهنّ-، وقد وُلِدت فاطمة -رضي الله عنها- قبل بعثة النبيّ -صلّى الله عليه وسلّم- بخمس سنواتٍ، في العام الذي أعادت فيه قريش بناء الكعبة، وعليه فقد كان عُمر النبيّ -صلّى الله عليه وسلّم- حين ولادتها خمسة وثلاثين عاماً.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => " من هي أم سيدة فاطمة بنت رسول الله؟",
                    "pilihan" => [
                        "عائشة",
                        "زينب",
                        "أم السلامة",
                        "خديجة",
                    ],
                    "jawaban" => "خديجة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "ما معنى كلمة نسل ؟",
                    "pilihan" => [
                        "جدة",
                        "نسمة",
                        "ابن",
                        "والد",
                    ],
                    "jawaban" => "نسمة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => " متى بعث الله نبينا محمد صلى الله عليه وسلم؟",
                    "pilihan" => [
                        "في العام الذي أعادت فيه قريش بناء الكعبة",
                        "في شباب فاطمة الزهراء",
                        "في الخامسة من عمر فاطمة",
                        "بعد واقعة الاسراء والمعراج",
                    ],
                    "jawaban" => "في الخامسة من عمر فاطمة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => " كم عدد بنات النبي؟",
                    "pilihan" => [
                        "أربع بنات",
                        "خمس بنات",
                        "ست بنات",
                        "سبع بنات",
                    ],
                    "jawaban" => "أربع بنات",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => " كانت  رقيّة  .....  من فاطمة سنا",
                    "pilihan" => [
                        "أكثر",
                        "أضعف",
                        "أهم",
                        "أصغر",
                    ],
                    "jawaban" => "أكثر",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يحكى أن أحد الخدم كان يتعرّض لمعاملة سيئة من سيّده، فهرب في أحد الأيام إلى الغابة. وهناك التقى بأسد يتألم من شوكة كبيرة مغروسة في قدمه. استجمع الخادم شجاعته، واقترب من الأسد وانتزع الشوكة من قدمه. فمضى الأسد في طريقه دون أن يؤذي الخادم الطيب. بعد ذلك بعدّة أيام، خرج سيّد الخادم في رحلة صيد إلى الغابة، وقبض على الكثير من الحيوانات. وفي طريق العودة لمح السيّد خادمه، فقبض عليه أيضًا، وقرّر أن يعاقبه عقابًا قاسيًا. فطلب من خدمه أن يرموه في قفص الأسد. وكم كانت دهشة السيّد ومن حوله عظيمة حينما دنا الأسد من الخادم ورح يلعق وجهه كأنه حيوان أليف. لقد كان ذلك الأسد هو نفسه الذي ساعده الخادم قبل أيام. وهكذا، نجا الخادم وتمكّن بمساعدة الأسد من إنقاذ بقية الحيوانات. </p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => ' المرادف من كلمة "هرب" في الناس السابق؟',
                    "pilihan" => [
                        "فرّ",
                        "أسقط",
                        "مواجه",
                        "إلتقى ",
                    ],
                    "jawaban" => "فرّ",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => " كيف يسير صيد السيد؟",
                    "pilihan" => [
                        "يسير بالفشل",
                        "يسير بالنجاح",
                        "يسير بالغضب",
                        "يسير بالسوء",
                    ],
                    "jawaban" => "يسير بالنجاح",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => " ما العنوان المناسب للفقرة السابقة؟",
                    "pilihan" => [
                        "السيد السيء",
                        "الأسد من صديق الخادم",
                        "الأسد حيوان مفترش",
                        "الخادم والأسد",
                    ],
                    "jawaban" => "الخادم والأسد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => " ماذا فعل الخادم بالأسد؟",
                    "pilihan" => [
                        "يصيده",
                        "يحبسه",
                        "ينقذه",
                        "يصطاد",
                    ],
                    "jawaban" => "ينقذه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => " أين اتجه السيد والخادم للصيد؟",
                    "pilihan" => [
                        "الحديقة",
                        "البستان",
                        "المزرعة",
                        "الغابة",
                    ],
                    "jawaban" => "الغابة",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>قُتِل في بني إسرائيل رجلٌ غنيّ لم يكن له ولدٌ على يدٍ قريبٍ له؛ بهدف الحصول على الميراث، ثمّ أتى القاتل إلى موسى -عليه السلام- يخبره بموت قريبه، ويسأله أن يساعده في معرفة القاتل؛ ليقتصَّ منه، ولم يكن عند موسى -عليه السلام- عِلمٌ بشيءٍ؛ فجمع الناس وسألهم عن الأمر، فلم يكن أيّ أحدٍ منهم يعلم شيئاً، فأوحى الله -تعالى- إليه أن يأمر القومَ بذَبح بقرةٍ؛ لمعرفة القاتل، فاستغرب القوم، وأكثروا السؤال عن أوصافها، فبيَّن الله -تعالى- لهم أنّها بقرةٌ لا كبيرةٌ مُسِنّةٌ، ولا صغيرةٌ، بل مُتوسِّطة السنّ، ذات لون أصفر صافٍ لم تُتَّخَذ للعمل في الأرض أو السقاية، وهي خاليةٌ من العيوب، وليس في جسمها لونٌ آخر، فوجدوها بعد طول عناء، ولو أنّهم أطاعوا الأمر بذَبح بقرة، لأجزأهم ذلك، إلّا أنّهم بتشديدهم على أنفسهم، شدَّد الله عليهم، ثمّ ذبحوها، وضربوا الميّت بعظمها بأمرٍ من الله، ففعلوا، فأخبرهم الميّت عن قاتله؛ وهو قريبه، فأُخِذ وقُتِل؛ لسوء عَمَله.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => ' المرادف من كلمة "الغني" ...',
                    "pilihan" => [
                        "الكفى",
                        "الثري",
                        "الاستغنى",
                        "الكرم",
                    ],
                    "jawaban" => "الثري",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => " أي حيوان سيذبح بنوا إسرائيل ؟ ",
                    "pilihan" => [
                        "الغنم",
                        "البقرة",
                        "الشاة",
                        "الجمل",
                    ],
                    "jawaban" => "البقرة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => " لماذا أمر الله بذبحها؟",
                    "pilihan" => [
                        "لمعرفة المقتول",
                        "لمعرفة القاتل",
                        "لمعرفة الوقت",
                        "لمعرفة العمل المناسب",
                    ],
                    "jawaban" => "لمعرفة القاتل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => " ما الفكرة الرئيسية من الفقرة السابقة؟",
                    "pilihan" => [
                        "نبه أحد رجل من الرجال الأغنياء في بني إسرائيل",
                        "مات أحد رجل من الرجال الأغنياء في بني إسرائيل",
                        "مرض أحد رجل من الرجال الأغنياء في بني إسرائيل",
                        "قعد أحد رجل من الرجال الأغنياء في بني إسرائيل",
                    ],
                    "jawaban" => "مات أحد رجل من الرجال الأغنياء في بني إسرائيل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => " كيف كان عمر البقرة؟",
                    "pilihan" => [
                        "صغير",
                        "متوسط",
                        "كبير",
                        "شيخ",
                    ],
                    "jawaban" => "متوسط",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>أعلن وزير السياحة و الآثار المصري خالد العناني عن أول كشف أثري لعام 2020، وذلك بمنطقة "الغريقة يتونا الجبل" في محافظة المنيا في صعيد مصر. ونجحت البعثة الآثرية التي تعمل في المنيا، برئاسة مصطفى وزيري، الأمين العام للمجلس الأعلى للآثار، في الكشف عن العديد من المقابر العائلية التى تخص كبار كهنة الإله جحوتي وكبار الموظفين بالإقليم الخامس عشر من أقاليم مصر العليا وعاصمته الأشمونين.</p>
                    <p>وأكد العناني أن محافظة المنيا لا تزال تحمل في جعبتها الكثير من الأسرار التى ستبوح عنها، فمنذ عام 2018 تم الإعلان عن 4 اكتشافات أثرية جديدة، منها خبيئة للمومياوات ومجموعة من المقابر بها توابيت و أثاث جنائزي بمنطقة تونا الجبل. وأشار وزير السياحة و الآثار إلى أهمية ما تنظمه الوزارة من فعاليات وأحداث سياحية وأثرية مختلفة بمحافظة المنيا لوضعها على خريطة السياحة العالمية.</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => " أين وقعت البعثة الآثرية؟",
                    "pilihan" => [
                        "روسيا",
                        "ألمانيا",
                        "يابن",
                        "السعودية",
                    ],
                    "jawaban" => "ألمانيا",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => ' ما المفرادف من كلمة "السر" في الفقرة السابقة؟',
                    "pilihan" => [
                        "الحالي",
                        "الخفي",
                        "المجتبى",
                        "العالي",
                    ],
                    "jawaban" => "الخفي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => " الكشف عن العديد من المقابر العائلية التى تخص كبار كهنة الإله جحوتي وكبار الموظفين بالإقليم الخامس عشر من أقاليم مصر العليا وعاصمته الأشمونين، إحدى من نتيجات؟",
                    "pilihan" => [
                        "البعثة العلمية",
                        "البعثة الدينية",
                        "البعثة الآثرية",
                        "البعثة الاجتماعية",
                    ],
                    "jawaban" => "البعثة الآثرية",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => " متى قام ألمانيا على إعلان اكتشافات أثرية جديدة؟",
                    "pilihan" => [
                        "٢٠١٨",
                        "٢٠٢٠",
                        "٢٠١٩",
                        "٢٠١٦",
                    ],
                    "jawaban" => "٢٠١٨",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => " من هو وزير السياحة و الآثار المصر؟ ",
                    "pilihan" => [
                        "مصطفى",
                        "أمين وزاري",
                        "خالد العناني",
                        "همدان",
                    ],
                    "jawaban" => "خالد العناني",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => " عرف البلاغة لغة!",
                    "pilihan" => [
                        "الوصول والانتهاء",
                        "البيان والظهور",
                        "الوصول والبداية",
                        "الانتهاء والنهاية",
                    ],
                    "jawaban" => "الوصول والانتهاء",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => " كيف تقع البلاغة في الاصطلاح ؟",
                    "pilihan" => [
                        "تقع البلاغة في الاصطلاح وصفا للكلام والمتكلم ",
                        "ب.تقع البلاغة في الاصطلاح وصفا للكلمة والمتكلم",
                        "ج.تقع البلاغة في الاصطلاح وصفا للكلام والكلمة",
                        "تقع البلاغة في الاصطلاح وصفا للكلام والساميع",
                    ],
                    "jawaban" => "تقع البلاغة في الاصطلاح وصفا للكلام والمتكلم ",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => " ماهي بلاغة المتكلم ؟",
                    "pilihan" => [
                        "أ.بلاغة المتكلم مطابقته لمقتضى الكلام مع فصاحته",
                        "بلاغة المتكلم مطابقته لمقتضى الحال مع فصاحته ",
                        "بلاغة المتكلم مطابقته لمقتضى الحال ",
                        "بلاغة المتكلم مطابقته لمقتضى المتكلم",
                    ],
                    "jawaban" => "بلاغة المتكلم مطابقته لمقتضى الحال مع فصاحته ",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => ' فَأَمَّا مَنْ أَعْطَى وَاتَّقَى (5) وَصَدَّقَ بِالْحُسْنَى (6) فَسَنُيَسِّرُهُ لِلْيُسْرَى (7) وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى (8) وَكَذَّبَ بِالْحُسْنَى (9)  ,"فَسَنُيَسِّرُهُ لِلْعُسْرَى (10)’’ ما الصورة البديعية في هذه الآية؟’’',
                    "pilihan" => [
                        "التورية",
                        "الطباق",
                        "المقابلة",
                        "الاقتباس",
                    ],
                    "jawaban" => "المقابلة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => " عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: «إِنَّمَا كَانَ المَاءُ مِنَ المَاءِ رُخْصَةً فِي أَوَّلِ الإِسْلَامِ، ثُمَّ نُهِيَ عَنْهَا’’ ما الصورة البديعية في هذا الحديث؟’’",
                    "pilihan" => [
                        "التورية",
                        "الطباق",
                        "المقابلة",
                        "الجناس",
                    ],
                    "jawaban" => "الجناس",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => " سيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَن قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ۚ قُل لِّلَّهِ ……. ۚ يَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
                    "pilihan" => [
                        "المغرب و المشرق",
                        "الشرق و الغرب",
                        "المشرقين",
                        "المشرق و المغرب",
                    ],
                    "jawaban" => "المشرق و المغرب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => " ولِكُلٍّ …….هُوَ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
                    "pilihan" => [
                        "قبلة",
                        "وجهة",
                        "جهة",
                        "كعبة",
                    ],
                    "jawaban" => "وجهة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => " اذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا مِنَ الَّذِينَ اتَّبَعُوا وَرَأَوُا …….  وَتَقَطَّعَتْ بِهِمُ الْأَسْبَابُ",
                    "pilihan" => [
                        "العذاب",
                        "العقاب",
                        "الجنة",
                        "النار",
                    ],
                    "jawaban" => "العذاب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => " فمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَا ……. ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",
                    "pilihan" => [
                        "جناح عليه",
                        "إثم عليه",
                        "إثم",
                        "ذنب عليه",
                    ],
                    "jawaban" => "إثم عليه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => " وأَنفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى ……. وَأَحْسِنُوا ۛ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ",
                    "pilihan" => [
                        "المصيبة",
                        "الموت",
                        "التهلكة",
                        "الفساد",
                    ],
                    "jawaban" => "التهلكة",
                ],
            ],
        ];

        return $data;
    }

    // soal to 3
    public function get_soal_to_3(){
        $data = [
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => " وجد علي وأصحابه مصدر المياه في وسط الغابة. جمع الكلمة مصدر.... ",
                    "pilihan" => [
                        "مصدرون",
                        "مصادر",
                        "ماصدر",
                        "مصادير",
                    ],
                    "jawaban" => "مصادر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => " علي عنده تلفاز جديد و........ مربع",
                    "pilihan" => [
                        "شكلها",
                        "شكلته",
                        "شكله",
                        "شكلتها",
                    ],
                    "jawaban" => "شكله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => " استأجرت عائشة بيتا في المدينة. معنى كلمة...... ",
                    "pilihan" => [
                        "طلب الأجرة",
                        "بحث الأجرة",
                        "مثل الأجرة",
                        "أعطى الأجرة",
                    ],
                    "jawaban" => "أعطى الأجرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " يريد أبي أن أكون باحثا في المستقبل. معنى كلمة باحثا.... ",
                    "pilihan" => [
                        "Penelitian",
                        "Teliti",
                        "Peneliti",
                        "Meneliti",
                    ],
                    "jawaban" => "Peneliti",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => " أنظر الكتب القديمة والتراث في .... ",
                    "pilihan" => [
                        "المتحف",
                        "الموقيف",
                        "المرمى",
                        "المجمع",
                    ],
                    "jawaban" => "المتحف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => " ألفّف الثياب ....... في الغرفة.",
                    "pilihan" => [
                        "الكثيرة",
                        "الكثير",
                        "كثيرة",
                        "كاثر ",
                    ],
                    "jawaban" => "الكثيرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => ' من المعروف أن قلم الأستاذ لونه أزرق. والجملة "قلم الأستاذ" هي جملة إضافية بمعنى: ',
                    "pilihan" => [
                        "من",
                        "الباء",
                        "في",
                        "اللام",
                    ],
                    "jawaban" => "اللام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => " نتعلم ......  في مكتبة المدرسة. ",
                    "pilihan" => [
                        "كتاب واحد",
                        "الكتاب الواحد",
                        "كتاب واحدة",
                        "الكتاب الواحدة",
                    ],
                    "jawaban" => "الكتاب الواحد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => ' صعد محمد الشجرة في الغابة.  و...... علي من السلام.  مضاد الكلمة "صعز" ....',
                    "pilihan" => [
                        "ارتكب",
                        " انصرف",
                        "نزل",
                        "جرى",
                    ],
                    "jawaban" => "نزل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => " أريد أن أشاهد .....  الكبيرة في المدينة",
                    "pilihan" => [
                        "بيت",
                        "البيوت",
                        "البيت",
                        "بيوت",
                    ],
                    "jawaban" => "البيوت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => " جهزت لك الأطعمة في المطبخ ..... منه ",
                    "pilihan" => [
                        "لآكل",
                        "لنأكل",
                        "ليأكل",
                        "لتأكل",
                    ],
                    "jawaban" => "لتأكل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => " سوف ..... إبراهيم في مسابقة الفوازر بعد الأسبوع.",
                    "pilihan" => [
                        "نجح",
                        "ينجح",
                        "نجح",
                        "تنجح",
                    ],
                    "jawaban" => "ينجح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => " فحص الطبيب ...... المرضى. ",
                    "pilihan" => [
                        "حال",
                        "حوالة",
                        "الحالة",
                        "إحوال",
                    ],
                    "jawaban" => "إحوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => " أحمد وإبراهيم ...... مند الصغار. ",
                    "pilihan" => [
                        "صديقان",
                        "صادقين",
                        "صديقين",
                        "صديقاين",
                    ],
                    "jawaban" => "صديقان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => " كان موقف الباصات ..... المعهد. ",
                    "pilihan" => [
                        "قريب عن",
                        "قريب من",
                        "القريب عن",
                        "قريب ل",
                    ],
                    "jawaban" => "قريب من",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => " يا إخواني لن ...... في المسابقة غدا.  ",
                    "pilihan" => [
                        "نجحوا",
                        "تنجحنا",
                        "تنجحوا",
                        "تنجح",
                    ],
                    "jawaban" => "تنجحوا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => " يا سليمان .....  الدرس",
                    "pilihan" => [
                        "كتابا",
                        "كتب",
                        "اكتب",
                        "اكتبي",
                    ],
                    "jawaban" => "اكتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => " سأنام قبل الساعة العاشرة غدا، وبالأمس قد ..... في الساعة الثانية",
                    "pilihan" => [
                        "نامت",
                        "أنام",
                        "نمت",
                        "أنامت",
                    ],
                    "jawaban" => "نمت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => " ذهب الطلاب إلى يزيد عيادة له. ",
                    "pilihan" => [
                        "يزيدُ",
                        "يزيدَ",
                        "يزيدِ",
                        "يزيدْ",
                    ],
                    "jawaban" => "يزيدَ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => " يلين الحديد ..... الحرارة.",
                    "pilihan" => [
                        "من",
                        "إلى",
                        "عن",
                        "ب",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>من الأخلاق الكثيرة التي تميّز بها نبيّ الله محمّد عليه الصّلاة والسّلام خلق التّسامح بكلّ ما يتضمّنه من معاني العفو، والصّفح، والغفران، فلم يَعرف النّبي الكريم الحقد، ولم تتسلّل إلى قلبه رغبات الانتقام ممّن يسيء إليه، ولم يفكّر يوماً في مقابلة الإساءة بالإساءة، على الرّغم من الأذى الشّديد، والصدّ الكبير الذي تعرّض له من قبل قومه في بداية دعوته؛ بل كان مثالاً في العفو عمّن ظلمه وأساء إليه ابتغاء رضوان الله تعالى وجنّته، متمثلاً قوله تعالى: (ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيم ) [فصلت:34]، وراجياً من وراء عفوه وتسامحه أن يخرج الله من أصلاب من أساء إليه من يعبد الله ولا يُشرك به شيئاً.</p>
                    <p>قصّة النّبي مع الرّجل الذي أراد قتله؛ فقد روى جابر بن عبد الله قصّةً تدلّ على تسامح النّبي عليه الصّلاة والسّلام، ففي غزوة الرّقاع استراح النبي الكريم تحت شجرةٍ بعد أن علّق سيفه عليها، فاستغلّ رجلٌ من المشركين ذلك فباغت النّبي وأخذ سيفه على حين غرّة، ثمّ رفعه في وجه النّبي وهو يقول، أتخافني، فقال النّبي: لا، فقال الرّجل: "فمن يمنعك مني"، قال: الله، فسقط السّيف من يد الرّجل فأخذه النّبي الكريم ورفعه في وجه الرّجل وهو يقول من يمنعني منك، فقال الرّجل، كن خير آخذ، فلم يَفعل النّبي الكريم معه شيئاً وعفى عنه بعد أن تعهّد بأن لا يُقاتل المسلمين أو يقف مع قوم يقاتلونهم، فجاء قومه وهو يقول: (جئتكم من عند خير النّاس).</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => ' المرادف من كلمة "الحقد"؟',
                    "pilihan" => [
                        "الحسود",
                        "الجريمة",
                        "الشر",
                        "الاستقامة",
                    ],
                    "jawaban" => "الحسود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => '  "جابر بن عبد الله"هو؟',
                    "pilihan" => [
                        "التابعين",
                        "تابع التابعين",
                        "الصحابة",
                        "آل النبي",
                    ],
                    "jawaban" => "الصحابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => " لماذا أراد الرجل أن يقتل النبي؟",
                    "pilihan" => [
                        "لأنه مرض",
                        "لأنه أخذ سيفه",
                        "لأنه يكرهه",
                        "لأنه خاف منه",
                    ],
                    "jawaban" => "لأنه يكرهه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => " في أي غزوة حدثت هذه الواقعة؟",
                    "pilihan" => [
                        "غزوة البدر",
                        "غزوة الأحد",
                        "غزوة الرقاع",
                        "غزة الحنين",
                    ],
                    "jawaban" => "غزوة الرقاع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => " ما الفكرة الرئيسية من الفقرة السابقة؟",
                    "pilihan" => [
                        "كان النبي مقتول على يد الكفار",
                        "النبي تلعب من الغزوة",
                        "كان النبي متسامحا",
                        "قام النبي بقتال من رغب عنه",
                    ],
                    "jawaban" => "كان النبي متسامحا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>في يوم من الأيام خرج جحا مسافراً مع قاضٍ وتاجر، فأخذا يسخران منه طوال الطريق بسبب عفويته في الحديث، فقال القاضي متباهياً بعلمه ومنصبه: مَن كثر لَغَطه كثر غَلَطُه، أمّا التاجر فقال: يا جحا ألم تغلط في الكلام أبداً؟ ردّ عليهما جحا قائلاً: نعم لدي أغلاط كثيرة جداً في الكلام، فمرّة كنت أريد أن أقول: قاضيان في النار فأخطأت وقلت قاضٍ في النار، ومرة أخرى كنت أريد أن أقول: إنّ الفجار لفي جحيم فأخطئت وقلت: إنّ التجار لفي جحيم، ففهم الرجلان مقصد جحا فطأطآ رأسيهما ولم يتكلما طوال الطريق.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => " بمن يمشي جحا في إحدى الأيام؟",
                    "pilihan" => [
                        "القاضي والنجار",
                        "القاضي والبحار",
                        "القاضي والشاعر",
                        "القاضي والتاجر",
                    ],
                    "jawaban" => "القاضي والتاجر",
                ]
             ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => " لماذا يسخران عن جحا؟",
                    "pilihan" => [
                        "لأنهما مسغلان",
                        "لأنهما أدركا أن جحا كثرة لغطه وغلطه",
                        "لأن لهما لغط وغلط",
                        "لأن جحا رجل حزين",
                    ],
                    "jawaban" => "لأنهما أدركا أن جحا كثرة لغطه وغلطه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => " ما الشخصية المفضلة في القصة السابقة؟",
                    "pilihan" => [
                        "القاضي",
                        "الراعي",
                        "التاجر",
                        "جحا",
                    ],
                    "jawaban" => "جحا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => ' المراد من كلمة "الحديث" ..... ',
                    "pilihan" => [
                        "الكلام",
                        "الواقعة",
                        "الساعة",
                        "الاحوال",
                    ],
                    "jawaban" => "الكلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => ' ما المراد بهذه العبارة، "إنّ الفجار لفي جحيم فأخطئت، فقلت: إنّ التجار لفي جحيم"؟ ',
                    "pilihan" => [
                        "أن جحا يسخر التاجر",
                        "أن جحا سُخر بالتاجر",
                        "أن جحا يريد أن يكون التاجر",
                        "أن جحا هو التاجر",
                    ],
                    "jawaban" => "أن جحا يسخر التاجر",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يُعَدّ نوح -عليه السلام- أوّل رسولٍ أُرسِل إلى الناس، وهو أحد أُولي العزم من الرُّسل؛ إذ لَبِثَ في دعوة قومه إلى توحيد الله ألف سنةٍ إلّا خمسين عاماً، ودعاهم إلى تَرْك عبادة الأصنام التي لا تملك لهم ضرّاً ولا نَفْعاً، وأرشدهم إلى عبادة الله وحده، وقد اجتهد نوح في دعوته، وسلك في تذكير قومه الأساليب والطُّرق جميعها؛ فدعاهم ليلاً ونهاراً، سرّاً وعلانيةً، فلم تُغنِ تلك الدعوة عنهم شيئاً؛ إذ قابلوها بالاستكبار والجحود، فكانوا يُغلقون آذانهم؛ لِئلّا يسمعوا دعوته، فَضْلاً عن اتّهامهم له بالكذب والجنون، ثمّ أوحى الله إلى نبيّه بصُنع السفينة، فصنعها رغم سُخرية المشركين من قومه منه، وانتظر أمر الله إليه بركوب السفينة مع مَن آمن بدعوته، بالإضافة إلى زوجيَن من كلّ نوعٍ من الكائنات الحيّة، ووقع ذلك بأمرٍ من الله حين فُتِحت السماء بالماء المُنهمِر الغزير، وتفجّرت الأرض ينابيع وعيوناً، فالتقى الماء على هيئةٍ عظيمةٍ، وطوفان مَهيبٍ أغرق القوم المُشركين بالله، ونُجِّيَ نوحٌ -عليه السلام- ومَن آمن معه.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => " ما الذي دعا نوح عليه السلام قومه؟",
                    "pilihan" => [
                        "ليعبد الأصنام",
                        "ليتخلص العمل",
                        "ليعبد الله وحده",
                        "لترك العبادة",
                    ],
                    "jawaban" => "ليعبد الله وحده",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => " التالي من أنبياء أولي العزم، إلا .....",
                    "pilihan" => [
                        "نوح عليه السلام",
                        "هود عليه السلام",
                        "إبراهيم عليه السلام",
                        "عيسى عليه السلام",
                    ],
                    "jawaban" => "هود عليه السلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => " ما الفكرة الرئيسية في القصة السابقة؟",
                    "pilihan" => [
                        "إن نوح عليه السلام دعى قومه ولكنهم ينكرونه",
                        "عاش سيدنا نوح عليه السلام أكثر من ألف",
                        "صنع نوح السفينة نفسه",
                        "السفينة صغيرة الحجم ",
                    ],
                    "jawaban" => "إن نوح عليه السلام دعى قومه ولكنهم ينكرونه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => " كيف كانت دعوة نوح عليه السلام قومه؟",
                    "pilihan" => [
                        "لا تغن عنهم مأكلاته",
                        "لا تتأثر عنهم دعوته",
                        "لا تقبل عنهم سيرته",
                        "لا تسمع عنهم دعوته",
                    ],
                    "jawaban" => "لا تتأثر عنهم دعوته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => " كيف معاملة قوم نوح له؟",
                    "pilihan" => [
                        "هم يصدقونه",
                        "هم يؤمنونه",
                        "هم يكذبونه",
                        "هم يسمعونه",
                    ],
                    "jawaban" => "هم يكذبونه",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>الشيخ حسن العطار الذي تتلمذ على يديه” رفاعة الطهطاوي” رائد النهضة المصرية الحديثة، وكان “العطار” أدبياً وشاعراً ورحاله زار تركيا وفلسطين وجاب بلاد الشام وخالط ضباط الحملة الفرنسية وعلمائها وقام بتدريس اللغة العربية لهم، وتعلم حب المعرفة وضرورة التجديد. ويتذكر رفاعة الطهطاوي، دوماً ما كرره عليه أستاذه العطار “إن بلادنا لا بد أن تتغير أحوالها، ويتجدد بها من المعارف ما ليس فيها”</p>
                    <p>هو حسن بن محمد بن محمود العطار المولود (1766م / 1180 هـ) – (1835م / 1250 هـ) بالقاهرة، وتوفى يوم 22 مارس سنة 1835م 1250 هـ) وهو السادس عشر من شيوخ الجامع الأزهر على المذهب الشافعى وعلى عقيدة أهل السنة</p>
                    <p>وكان الشيخ حسن العطار أحد المشاركين الأساسيين لنهضة مصر الحديثة، وكان أول صوت طالَب بإصلاح الأزهر الشريف وشدد على الاصلاح في الازهر. وتولى مشيخة الأزهر في عام 1830م (1246 هـ وكان في الخامسة والستين من عمره، وظل شيخاً للأزهر حتى وفاته يوم 22 مارس سنة 1835م (1250 هـ، وهو أول شيخ يتولى مشيخة الأزهر من أصل غير مصرى حيث كان مغربى الاصل.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => " من تلاميذ الشيخ حسن العطار الذي يعد أحد رواد النهضة هو",
                    "pilihan" => [
                        "محمد عياد الطنطوي",
                        "محمد شهاب الدين",
                        "رفاعة الطهطوي",
                        "حسن قويدر مغريبي",
                    ],
                    "jawaban" => "رفاعة الطهطوي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => " من أحد المشاركين الأساسيين لنهضة مصر؟ ",
                    "pilihan" => [
                        "محمد عياد الطنطوي",
                        "محمد شهاب الدين",
                        "حسن العطار",
                        "حسن قويدر مغريبي",
                    ],
                    "jawaban" => "حسن العطار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => " كلمة تتلمذ بمعنى",
                    "pilihan" => [
                        "جهل",
                        "فرج",
                        "حفظ",
                        "أخذ العلم",
                    ],
                    "jawaban" => "أخذ العلم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => " موقف الإعراب كلمة ” أحد المشاركين ” في جملة وكان الشيخ حسن العطار أحد المشاركين الأساسيين لنهضة مصر الحديثة",
                    "pilihan" => [
                        "خبر",
                        "خبر كان",
                        "فاعل",
                        "مضاف إليه",
                    ],
                    "jawaban" => "خبر كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => " ما موقف الإعراب كلمة ” صوت” في جملة كان أول صوت طالَب بإصلاح الأزهر الشريف",
                    "pilihan" => [
                        "خبر",
                        "خبر كان",
                        "فاعل",
                        "مضاف إليه",
                    ],
                    "jawaban" => "مضاف إليه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => " وضح الحال أو المقام !",
                    "pilihan" => [
                        "الأمر غير  الحامل للمتكلم على أن يورد عبارته على صورة مخصوصة",
                        "الأمر الحامل للسامع على أن يورد عبارته على صورة مخصوصة",
                        "الأمر الحامل للمتكلم على أن يورد عبارته على صورة  مخصوصة",
                        "الأمر الحامل للكلام على أن يورد عبارته على صورة مخصوصة",
                    ],
                    "jawaban" => "الأمر الحامل للمتكلم على أن يورد عبارته على صورة  مخصوصة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => " ما هو المقتضى أو الاعتبار المناسب ؟",
                    "pilihan" => [
                        "الصورة غير المخصوصة التي تورَد عليها العبارة",
                        "الصورة غير الظاهرة التي تورَد عليها العبارة",
                        "الصورة العامة التي تورَد عليها العبارة",
                        "الصورة المخصوصة التي تورَد عليها العبارة",
                    ],
                    "jawaban" => "الصورة المخصوصة التي تورَد عليها العبارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => " ماهي بلاغة المتكلم ؟",
                    "pilihan" => [
                        "بلاغة المتكلم مطابقته لمقتضى الكلام مع فصاحته",
                        "بلاغة المتكلم مطابقته لمقتضى الحال مع فصاحته",
                        "بلاغة المتكلم مطابقته لمقتضى الحال",
                        "بلاغة المتكلم مطابقته لمقتضى المتكلم",
                    ],
                    "jawaban" => "بلاغة المتكلم مطابقته لمقتضى الحال مع فصاحته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => " الَر كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ’’ أين الاستعارة في هذه الآية؟’’",
                    "pilihan" => [
                        "كتاب",
                        "نور",
                        "صراط",
                        "ربهم",
                    ],
                    "jawaban" => "نور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => " نشر الملك عيونه’’ ما نوع المجاز في هذه الجملة؟ وما علاقته؟’’",
                    "pilihan" => [
                        "الاستعارة، الكلية",
                        "المجاز المرسل، الجزئية",
                        "الاستعارة المكنية، السببة",
                        "المجاز المرسل، الآلية",
                    ],
                    "jawaban" => "المجاز المرسل، الجزئية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => " يسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ ۖ قُلْ فِيهِمَا ……. وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِن نَّفْعِهِمَا",
                    "pilihan" => [
                        "ذنب كبير",
                        "إثم كبير",
                        "نعمة كبيرة",
                        "أذي كبير",
                    ],
                    "jawaban" => "إثم كبير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => " نسَاؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُوا حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا ……. ۚ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُم مُّلَاقُوهُ ۗ وَبَشِّرِ الْمُؤْمِنِينَ",
                    "pilihan" => [
                        "على أنفسكم",
                        "لأنفسكم",
                        "لأهليكم",
                        "عليكم",
                    ],
                    "jawaban" => "لأنفسكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => " حافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ ……. وَقُومُوا لِلَّهِ قَانِتِينَ",
                    "pilihan" => [
                        "الصغرى",
                        "الكبرى",
                        "الوسطى",
                        "النافلة",
                    ],
                    "jawaban" => "الوسطى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => " ولِلْمُطَلَّقَاتِ مَتَاعٌ ……. ۖ حَقًّا عَلَى الْمُتَّقِينَ",
                    "pilihan" => [
                        "بالخير",
                        "بالمعروف",
                        "بالعرف",
                        "بالأحسان",
                    ],
                    "jawaban" => "بالمعروف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "  أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ....... ",
                    "pilihan" => [
                        "الكافرون",
                        "المتّقون",
                        "المهتدون",
                        "المفلحون",
                    ],
                    "jawaban" => "المفلحون",
                ]
            ],
        ];

        return $data;
    }

    // soal to 4
    public function get_soal_to_4(){
        $data = [
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => " سافر موسى إلى الحديقة خارج المدينة ليتمتع جمال المناظر فيها.  جمع الكلمة الحديقة.... ",
                    "pilihan" => [
                        "الحادقات",
                        "الحديقات",
                        "الحدايقات",
                        "الحدائق",
                    ],
                    "jawaban" => "الحديقات",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => " أنا أحمد. وكان أبي ..... إسماعيل",
                    "pilihan" => [
                        "اسمه",
                        "اسمها",
                        "اسمهم",
                        "اسمهما",
                    ],
                    "jawaban" => "اسمه",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => " تتلمذ زهير بن أبي سلمى إلى الشعراء الجاهلية. معنى كلمة تتلمذ....",
                    "pilihan" => [
                        "ملاحظة العلم",
                        "أخذ العلم",
                        "منع العلم",
                        "مصدر العلم",
                    ],
                    "jawaban" => "أخذ العلم",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " كان عمال مصنع الدراجات ناشطين. معنى عمال صيدلي.... ",
                    "pilihan" => [
                        "Bekerja",
                        "Pekerja",
                        "Pekerjan",
                        "Kerja",
                    ],
                    "jawaban" => "Pekerja",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => " لعب الأولاد القرة في..... ",
                    "pilihan" => [
                        "الحمام",
                        "الملعب",
                        "المرعى",
                        "غرفة النوم",
                    ],
                    "jawaban" => "الملعب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => " قرأت أختي الكبيرة الكتب ...... في المكتبة.  ",
                    "pilihan" => [
                        "الديني",
                        "الدينية",
                        "ديني",
                        "دينية",
                    ],
                    "jawaban" => "الدينية",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => ' ما أكلت تفتح زينب. والجملة "تفتح زينب" هي جملة إضافية بمعنى: ',
                    "pilihan" => [
                        "من",
                        "الباء",
                        "في",
                        "اللام",
                    ],
                    "jawaban" => "اللام",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => " بحثت ......  في مكتبة الجامعة. ",
                    "pilihan" => [
                        "كتاب واحد",
                        "الكتاب الواحد",
                        "كتاب واحدة",
                        "الكتاب الواحدة",
                    ],
                    "jawaban" => "الكتاب الواحد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => ' تسلق إبراهيم على الجبال في جاوى الشرقية.  و...... حسين من خصانه.  مضاد الكلمة "تسلق" ....',
                    "pilihan" => [
                        "ارتكب",
                        " انصرف",
                        "نزل",
                        "جرى",
                    ],
                    "jawaban" => "نزل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => " أريد أن أشهاد .....  المشهورة",
                    "pilihan" => [
                        "بيت",
                        "البيوت",
                        "البيت",
                        "بيوت",
                    ],
                    "jawaban" => "البيوت",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => " ذهب أبو مريم إلى الحديقة ..... جمال المناظر فيها.",
                    "pilihan" => [
                        "لأتمتع",
                        "لتمتع",
                        "ليتمتع",
                        "لتماتع ",
                    ],
                    "jawaban" => "ليتمتع",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => " ..... إبراهيم في الامتحان الوطني في السنة الماضية",
                    "pilihan" => [
                        "فشل",
                        "يفشل",
                        "فشلت ",
                        "تفشل ",
                    ],
                    "jawaban" => "فشل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => " كتب الأستاذ ...... لامتحان الطلاب. ",
                    "pilihan" => [
                        "سؤال",
                        "الأسئلة",
                        "رسالة",
                        "تقرير",
                    ],
                    "jawaban" => "الأسئلة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => " أحمد وإبراهيم ...... في مسابقة الفوازر. ",
                    "pilihan" => [
                        "عدوان",
                        "عادون",
                        "عدون",
                        "عديان",
                    ],
                    "jawaban" => "عدوان",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => " كلية الهندسة ..... قاعة الجامعة. ",
                    "pilihan" => [
                        "قريب عن",
                        "قريب من",
                        "القريب عن",
                        "قريب ل",
                    ],
                    "jawaban" => "قريب من",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => " يا إخواني لن ...... في خدع أبينا الذكي.  ",
                    "pilihan" => [
                        "نجحوا",
                        "تنجحنا",
                        "تنجحوا",
                        "تنجح",
                    ],
                    "jawaban" => "تنجحوا",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => " يا مريم .....  الدرس",
                    "pilihan" => [
                        "أطالع",
                        "طلعت",
                        "طالع",
                        "طالعي",
                    ],
                    "jawaban" => "طالعي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => " سأستحمّ في المسبح غدا، وبالأمس قد ..... في الحمام",
                    "pilihan" => [
                        "أستحمّ",
                        "استحمت",
                        "استحممت",
                        "استسحمّ",
                    ],
                    "jawaban" => "استحممت",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => " أكل خليل شيئا ......الفواكه",
                    "pilihan" => [
                        "من",
                        "إلى",
                        "عن",
                        "ب",
                    ],
                    "jawaban" => "من",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => ' نجح يوسف أخوه في الامتحان. موقع إعراب كلمة "أخوه .....',
                    "pilihan" => [
                        "بدل كل من كل",
                        "نائب الفاعل",
                        "بدل بعض من كل",
                        "خبر",
                    ],
                    "jawaban" => "بدل كل من كل",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان عثمان بن عفان من أوائل المسلمين إسلاما، وقد تزوج برقية بنت رسول الله صلى الله عليه وسلم، وهاجر إلى الحبشة مرتين كما هاجر معها إلى المدينة، وأنجب منها ولدا سماه عبد الله، وقد عاش هذا الولد ست سنين ثم توفي في العام الرابع للهجرة، وقد سبقته أمه إلى لقاء ربها في العام الثاني للهجرة يوم أن بشر المسلمين بانتصارهم على المشركين في غزوة بدر بعد أن مرضت مرضا شديدا</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => " ما أنسب موضوع للنص السابق؟",
                    "pilihan" => [
                        "يوم وفاة عبد الله بن عثمان",
                        "من حياة رقية بنت رسول الله",
                        "يوم وفاة رقية بنت رسول الله",
                        "من حياة عثمان بن عفان",
                    ],
                    "jawaban" => "من حياة عثمان بن عفان",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => " ماذا ذهب عثمان بن عفان مع رقية بنت رسول الله إلى الحبشة؟",
                    "pilihan" => [
                        "للسباحة",
                        "لقضاء شهر العسل",
                        "للهجرة",
                        "للعمل",
                    ],
                    "jawaban" => "للهجرة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => " كم مدة بين وفاة رقية بنت رسول الله و عبد الله بن عثمان؟",
                    "pilihan" => [
                        "نصف سنة",
                        "سنتين",
                        "سنة واحدة",
                        "ثلاث سنين",
                    ],
                    "jawaban" => "سنتين",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => " ما السبب المؤدي إلى وفاة رقية بنت رسول الله؟",
                    "pilihan" => [
                        "رصاص المشركين",
                        "المرض الشديد",
                        "الولادة المتعسرة",
                        "الغرق في البحر",
                    ],
                    "jawaban" => "المرض الشديد",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    حدد معاني المفردات التالية
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => " كلمة “أنجب” بمعنى",
                    "pilihan" => [
                        "توفي",
                        "أولد",
                        "تزوج",
                        "مرض",
                    ],
                    "jawaban" => "أولد",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>سبق أبو بكر الصدِّيق، وعمر بن الخطاب -رضي الله عنهما- عليّاً في خطبة فاطمة -رضي الله عنها- من أبيها رسول الله -صلّى الله عليه وسلّم-، وكان رَدّه على كلّ واحدٍ منهما بأنّها صغيرة، وقد كانت كذلك فعلاً، فرضيا بما قرَّره رسول الله -صلّى الله عليه وسلّم-، وسمعت إحدى النساء بذلك، فانطلقت إلى عليٍّ -رضي الله عنّه- تُشجّعه على التقدُّم إلى خِطبة فاطمة من أبيها، فتقدّم عليّ -رضي الله عنه- لخِطبة فاطمة من النبيّ -عليه الصلاة والسلام-، فرَضِي بعليّ زوجاً لابنته، وكان زواجهما في السنة الثانية من الهجرة النبويّة بعد غزوة بَدر، وكان المَهر الذي قدّمه لها بسيطاً؛ وهو دِرع حُطميّة غَنِمَها في إحدى المعارك</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => " من هو علي بن أبي طالب؟",
                    "pilihan" => [
                        "عم النبي صلى الله عليه وسلم",
                        "ابن عم النبي صلى الله عليه وسلم",
                        "خادم النبي صلى الله عليه وسلم",
                        "ابن النبي صلى الله عليه وسلم",
                    ],
                    "jawaban" => "ابن عم النبي صلى الله عليه وسلم",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => " لماذا رفض رسول الله صلى الله عليه وسلم على خطبة أبي بكر الصديق و عمر بن خطاب؟",
                    "pilihan" => [
                        "لأن سيدة فاطمة رفضتهما",
                        "لأن سيدة فاطمة صغير السن",
                        "لأن سيدة فاطمة في الدراسة",
                        "لأن علي يحب سيدة فاطمة",
                    ],
                    "jawaban" => "لأن سيدة فاطمة صغير السن",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => " كيف كان أبو بكر الصديق وعمر بن خطاب بعد رفض رسول الله صلى الله عليه وسلم؟",
                    "pilihan" => [
                        "آمنا به",
                        "جادلا فيه",
                        "راضيا به",
                        "كررا إليه",
                    ],
                    "jawaban" => "راضيا به",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => " أين تزوج علي فاطمة بنت رسول الله صلى الله عليه وسلم؟ ",
                    "pilihan" => [
                        "مكة",
                        "مدينة",
                        "كوفة",
                        "طائف",
                    ],
                    "jawaban" => "مدينة",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => " ما الموضوع المناسب من الفقرة السابقة؟",
                    "pilihan" => [
                        "فاطمة بنت محمد وزوجها",
                        "علي بن أبي طالب من أهل البيت",
                        "مكان المناسب لوليمة العرش",
                        "زوج علي بن أبي طالب بفاطمة الزهراء",
                    ],
                    "jawaban" => "زوج علي بن أبي طالب بفاطمة الزهراء",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>ظل القرآن الكريم على هذه الحال مفرقًا غير مجموع في مصحف واحد، إلى أن كانت خلافة أبي بكر، فواجهته أحداث جسيمة، وقامت حروب الردة، واستحرّ القتل بالقراء في وقعة اليمامة – سنة اثنتي عشرة للهجرة – التي استشهد فيها سبعون قارئاً من حفاظ القرآن. هالَ ذلك عمر بن الخطاب، وخاف أن يضيع شيء من القرآن بموت حفظته، فدخل على أبي بكر، وأشار عليه بجمع القرآن وكتابته خشية الضياع، فنفر أبو بكر من مقالته، وكَبَرَ عليه أن يفعل ما لم يفعله النبي، فظل عمر يراوده حتى اطمئن أبو بكر لهذا الأمر. ثم كلف أبو بكر زيد بن ثابت بتتبع الوحي وجمعه، فجمعه زيد من الرقاع والعسب واللخاف وصدور الرجال. حرص زيد بن ثابت على التثبت مما جمعه، ولم يكتف بالحفظ دون الكتابة، وحرص على المطابقة بين ما هو محفوظ ومكتوب، وعلى أن الآية من المصدرين جميعًا. فكان ذلك، أول جمع للقرآن بين  دفتين في مصحف واحد. واحتفظ أبو بكر بالمصحف المجموع حتى وفاته، ثم أصبح عند حفصة بنت عمر</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => " الموضوع المناسب للنص؟",
                    "pilihan" => [
                        "أهمية جمع القرآن",
                        "القرآن مصحف واحد",
                        "جمع القرآن في عهد أبي بكر الصديق",
                        "اقتراح عمر لجمع القرآن",
                    ],
                    "jawaban" => "جمع القرآن في عهد أبي بكر الصديق",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "  المعنى من كلمة الدَّفَّةُ.... ",
                    "pilihan" => [
                        "أجهز عليه",
                        "الضمام من الجانبين",
                        "الجماعة من الناس تُقْبِل من بلد إلى بلد",
                        "المشي الخفيف",
                    ],
                    "jawaban" => "الضمام من الجانبين",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "  واحتفظ أبو بكر بالمصحف المجموع حتى وفاته. إعراب كلمة تقع بعد حتى",
                    "pilihan" => [
                        "مضاف إليه",
                        "اسم مجرور",
                        "ظرف",
                        "مفعول به",
                    ],
                    "jawaban" => "اسم مجرور",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "  وحرص على المطابقة بين ما هو محفوظ ومكتوب. صيغة المطابقة... ",
                    "pilihan" => [
                        "اسم الفعل",
                        "اسم الفاعل",
                        "مصدر",
                        "اسم المفعول",
                    ],
                    "jawaban" => "مصدر",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "  هالَ ذلك عمر بن الخطاب. كلمة “هال” تدخل في قسم من أقسام الفعل المعتل وهو",
                    "pilihan" => [
                        "مثال",
                        "أجوف",
                        "ناقص",
                        "لفبف",
                    ],
                    "jawaban" => "أجوف",
                ],
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>قصد النَّبيُّ -عليه الصلاة والسلام- ذات نهارٍ بيت أنس بن مالك -رضي الله عنه- وقد استراح نائماً وقت قيلولة الظُّهر، فإذا به -صلَّى الله عليه وسلَّم- يتعرَّق في نومه، فقدمت أمُّ أنس -رضي الله عنها- بقارورةٍ تحملها لتجمع من عرق جبينه -عليه السلام-، ولما استيقظ النَّبيُّ -عليه السلام- سألها عن صنيعها هذا، فأخبرته بأنّهم يضعون هذا العرق في طِيبهم، وإنّه أطيب الطِّيب. وقد أخرج الإمام مسلم -رحمه الله- هذه الحادثة في صحيحه عن أنس بن مالك -رضي الله عنه- قال: (دَخَلَ عَلَيْنَا النبيُّ صَلَّى اللَّهُ عليه وسلَّمَ فَقالَ عِنْدَنَا، فَعَرِقَ، وَجَاءَتْ أُمِّي بقَارُورَةٍ، فَجَعَلَتْ تَسْلِتُ العَرَقَ فِيهَا، فَاسْتَيْقَظَ النبيُّ صَلَّى اللَّهُ عليه وسلَّمَ فَقالَ: يا أُمَّ سُلَيْمٍ ما هذا الذي تَصْنَعِينَ؟ قالَتْ: هذا عَرَقُكَ نَجْعَلُهُ في طِيبِنَا، وَهو مِن أَطْيَبِ الطِّيبِ). ولم يكن عرق رسول الله -صلَّى الله عليه وسلَّم- كباقي البشر، بل كان يمتاز برائحةٍ عطرةٍ كرائحة المسك</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => ' ما المراد من كلمة "قيلولة" في الفقرة السابقة؟ ',
                    "pilihan" => [
                        "النوم قبل الظهر",
                        "النوم بعد الظهر",
                        "النوم عند الظهر",
                        "النوم أثناء الظهر",
                    ],
                    "jawaban" => "النوم قبل الظهر",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => ' لماذا حملت أم أنس القرورة؟',
                    "pilihan" => [
                        "لجمع الماء",
                        "لجمع شرب النبي",
                        "لجمع عرق النبي",
                        "لشرب الماء",
                    ],
                    "jawaban" => "لجمع عرق النبي",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => " كيف كان عرق النبي؟",
                    "pilihan" => [
                        "أقل الطيب",
                        "أطيب الطيب",
                        "أقبح الطيب",
                        "أكثر الطيب",
                    ],
                    "jawaban" => "أطيب الطيب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => " ماذا فعل الناس بعرق النبي؟",
                    "pilihan" => [
                        "يقاس الناس عرق النبي بطيبهم",
                        "ينظرون الناس عرق النبي",
                        "وضع الناس عرق النبي في طيبهم",
                        "نقص الناس عرق النبي في طيبهم",
                    ],
                    "jawaban" => "وضع الناس عرق النبي في طيبهم",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => " ما اسم أم أنس بن مالك؟",
                    "pilihan" => [
                        "أم سلامة",
                        "أم سُليم",
                        "أم سلالة",
                        "أم سلال",
                    ],
                    "jawaban" => "أم سُليم",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => " وضح التعقيد في الكلام !",
                    "pilihan" => [
                        "أن يكون الكلام خفيّ الدلالة على المعنى المراد",
                        "أن يكون الكلام قوي الدلالة على المعنى المراد",
                        "أن يكون الكلام كثير الدلالة على المعنى المراد",
                        "أن يكون الكلام غرابة الدلالة على المعنى المراد",
                    ],
                    "jawaban" => "أن يكون الكلام خفيّ الدلالة على المعنى المراد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => " كيف يأتي التعقيد اللفظي في الكلام ؟",
                    "pilihan" => [
                        "يأتي التعقيد في الكلام بسب تقديم أو تأخير أو المرض",
                        "يأتي التعقيد في الكلام بسب تقديم أو تأخذ أو فضل",
                        "يأتي التعقيد في الكلام بسب تجاهل أو تأخير أو فضل",
                        "يأتي التعقيد في الكلام بسب تقديم أو تأخير أو فضل",
                    ],
                    "jawaban" => "يأتي التعقيد في الكلام بسب تقديم أو تأخير أو فضل",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => " كيف يأتي التعقيد المعنوي في الكلام ؟",
                    "pilihan" => [
                        "استعمال قليل من مجازات و كنايات",
                        "استعمال غير مجازات و كنايات لا يفهم المراد بها",
                        "استعمال مجازات و كنايات لا يفهم المراد بها ",
                        "استعمال مجازات و كنايات",
                    ],
                    "jawaban" => "استعمال مجازات و كنايات لا يفهم المراد بها ",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => " سلمى قمر في الجمال’’ ما نوع التشبيه في هذه الجملة؟’’",
                    "pilihan" => [
                        "البليغ",
                        "المؤكد",
                        "التمثيلي",
                        "المجمل",
                    ],
                    "jawaban" => "المؤكد",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => " عن عائشة رضي الله عنها أن بعض أزواج النبي صلى الله عليه و سلم قلن للنبي صلى الله عليه و سلم أينا أسرع بك لحوقا ؟ قال ( أطولكن يدا)’’ ما الصورة البيانية في هذا الحديث؟’’",
                    "pilihan" => [
                        "التشبيه",
                        "الاستعارة",
                        "المجاز المرسل",
                        "الكناية",
                    ],
                    "jawaban" => "الكناية",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => " الَّذِيْنَ يَنْقُضُونَ عَهْدَ اللهِ مِنْ بَعْدِ مِيْثَاقِهِ مَا أَمَرَ اللهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ أُولَئِكَ هُمُ......",
                    "pilihan" => [
                        "الخاسرون",
                        "الفاسثون",
                        "الكافرون",
                        "الظالمون",
                    ],
                    "jawaban" => "الخاسرون",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "وإِذْ اَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ …….. خُذُوا مَا آَتَيْنَاكُمْ بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
                    "pilihan" => [
                        "الجبل",
                        "الطور",
                        "الطير",
                        "النار",
                    ],
                    "jawaban" => "الطور",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "ولَتَجِدَنَهُّمْ أَحْرَصَ النَّاسِ عَلَى حَيَاةٍ وَمِنَ الَّذِينَ أَشْرَكُوا يُوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ……. سَنَةٍ",
                    "pilihan" => [
                        "مليون",
                        "مائة",
                        "ألف",
                        "خمسين ألف",
                    ],
                    "jawaban" => "ألف",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "سيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا قُلْ لِلَّهِ ……… يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ",
                    "pilihan" => [
                        "المغرب والمشريق",
                        "الشرق والغرب",
                        "المشرقين",
                        "المشرق والمغرب",
                    ],
                    "jawaban" => "المشرق والمغرب",
                ],
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "قدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا فَوَلِّ وَجْهَكَ ……. المَسْجِدِ الحَرَام",
                    "pilihan" => [
                        "إلى",
                        "شطر",
                        "أمام",
                        "جانب",
                    ],
                    "jawaban" => "شطر",
                ],
            ]
        ];

        return $data;
    }

    // soal to 5 
    public function get_soal_to_5(){
        $data = [
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => " اشترى والدي سرير جديد في سوبرمركت.  جمع الكلمة سرير.... ",
                    "pilihan" => [
                        "سريرون",
                        "أَسرّة",
                        "سَريرات",
                        "أسِرات",
                    ],
                    "jawaban" => "أَسرّة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => " لي غرفة متوسطة في البيت. وكان إخواني ..... كبيرات",
                    "pilihan" => [
                        "غرَفهم",
                        "غرفتهم",
                        "غرفتي",
                        "غرفتها",
                    ],
                    "jawaban" => "غرَفهم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => " أنجب محمد من رقية ولدا سماه عبد الله",
                    "pilihan" => [
                        "توفي",
                        "أولد",
                        "تزوج",
                        "مرض",
                    ],
                    "jawaban" => "أولد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " الهندسة من أعظم ثروة لنا. معنى كلمة الهندسة.... ",
                    "pilihan" => [
                        "Arsitek",
                        "Arsitektur",
                        "Rancangan",
                        "Hindustan",
                    ],
                    "jawaban" => "Arsitektur",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "  دفن عم زهير في..... ",
                    "pilihan" => [
                        "المتحف",
                        "المقبرة",
                        "المرعى",
                        "غرفة الجلوس",
                    ],
                    "jawaban" => "المقبرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => " قرأت أختي الكبيرة الكتب ...... في موقف الباصات إنتظارا لها.  ",
                    "pilihan" => [
                        "الاجتماعي",
                        "الإجتماعية",
                        "إجتماعي",
                        "اجتماعية",
                    ],
                    "jawaban" => "الإجتماعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => ' عرفت مكان شنطة محمد. والجملة "شنطة محمد" هي جملة إضافية بمعنى: ',
                    "pilihan" => [
                        "من",
                        "الباء",
                        "في",
                        "اللام",
                    ],
                    "jawaban" => "اللام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => " أطالع ......  في مكتبة المصنع. ",
                    "pilihan" => [
                        "كتاب واحد",
                        "الكتاب الواحد",
                        "كتاب واحدة",
                        "الكتاب الواحدة",
                    ],
                    "jawaban" => "الكتاب الواحد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => ' رمى هارون الزبالة من الشباك.  و...... سلمان كتاب الرياضية.  مضاد الكلمة "رمى" ....',
                    "pilihan" => [
                        "وضع",
                        "انصرف",
                        "أخذ",
                        "جرى",
                    ],
                    "jawaban" => "أخذ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => " أريد أن ألتقي .....  المشهورة",
                    "pilihan" => [
                        "البطال",
                        "الأبطال",
                        "البطولة",
                        "الباطل",
                    ],
                    "jawaban" => "الأبطال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => " يعلمني أبي السباحة ..... في الامتحان.",
                    "pilihan" => [
                        "لينجح",
                        "لتنجح",
                        "لأنجح",
                        "لتناجح",
                    ],
                    "jawaban" => "لأنجح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => " ..... إبراهيم من خصانه عند تعلم الرياضة هذا الصباح",
                    "pilihan" => [
                        "سقط",
                        "يسقط",
                        "سقطت",
                        "تسقط",
                    ],
                    "jawaban" => "سقط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => " جهاز الطلاب ...... لامتحان غدا. ",
                    "pilihan" => [
                        "المكتب",
                        "المكاتب",
                        "مكاتبٌ",
                        "مكتب",
                    ],
                    "jawaban" => "المكاتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => " أحمد وإبراهيم ...... في الجامعة الإسلامية. ",
                    "pilihan" => [
                        "طالبان",
                        "طالبين",
                        "الطالبين",
                        "طلاب",
                    ],
                    "jawaban" => "طالبان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => " ملعب الجامعة ..... موقف الباصات. ",
                    "pilihan" => [
                        "قريب عن",
                        "قريب من",
                        "القريب عن",
                        "قريب ل",
                    ],
                    "jawaban" => "قريب من",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => " يا أولادي لن ...... في الامتحان دون التعلم.  ",
                    "pilihan" => [
                        "نجحوا",
                        "تنجحنا",
                        "تنجحوا",
                        "تنجح",
                    ],
                    "jawaban" => "تنجحوا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => " يا زهراء .....  الدرس",
                    "pilihan" => [
                        "إفتحا",
                        "أفتح",
                        "افتح",
                        "افتحي",
                    ],
                    "jawaban" => "افتحي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => " يا بني ! قد ندمتُ على ...... ولم أندم على السكوت ",
                    "pilihan" => [
                        "السلام",
                        "القتال",
                        "الكلام",
                        "الصمت",
                    ],
                    "jawaban" => "الكلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => " إذا سجدتما فضمّا بعض اللحم إلى الأرض. كلمة ضمّا في الجملة السابقة ..... ",
                    "pilihan" => [
                        "مصدر",
                        "فعل ماض",
                        "فعل مضارع",
                        "فعل أمر",
                    ],
                    "jawaban" => "فعل أمر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => " يا بني صم حتى .... الشمس",
                    "pilihan" => [
                        "يغربُ ",
                        "يغيبَ",
                        "تغربُ",
                        "تغيبَ",
                    ],
                    "jawaban" => "تغيبَ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أغلقت آلاف المدارس في مختلف أرجاء ماليزيا وإندونيسيا الخميس، ما أثر على ما لا يقل عن 1,7 مليون تلميذ، على ما اعلن مسؤولون، حيث أدى الضباب السام الناجم عن حرائق الغابات إلى تراجع جودة الهواء.</p>
                    <p>وأمرت السلطات حوالي 2,500 مدرسة بإغلاق أبوابها في ماليزيا، بما في ذلك ما يقرب من 300 مدرسة في العاصمة كوالالمبور التي يغطيها الضباب الدخاني، بسبب المخاوف الصحية المتزايدة الناجمة عن الضباب السام الذي سببته الحرائق الخارجة عن السيطرة في جزيرة سومطرة و جزيرة بورنيو الجزيرة مشتركة بين إندونيسيا وماليزيا وبروناي.</p>
                    <p>وأثرت عمليات الإغلاق على 1,7 مليون طالب على الأقل في ماليزيا. لكنّ لم يتضح بعد عدد التلاميذ الذين أُجبروا على البقاء في منازلهم في إندونيسيا المجاورة. وتغرق ولاية ساراواك الماليزية التي تقع على جزيرة بورنيو في ضباب سام، فيما يتصاعد التوتر الدبلوماسي في المنطقة بسبب الأزمة البيئية. يشكّل إغلاق المدارس الخميس أول إغلاق جماعي للمدارس في كوالالمبور حيث تراجعت جودة الهواء إلى مستويات “غير صحية” أو “غير صحية للغاية” بحسب مؤشر حكومي في أماكن متعددة في ماليزيا الواقعة إلى الشرق من سومطرة، حيث غطى الضباب الكثيف   سماء كوالالمبور</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => " يرجى تحديد الموضوع المناسب لهذا النص",
                    "pilihan" => [
                        "إغلاق آلاف المدارس في ماليزيا  نتيجة الضباب الناجم عن حرائق الغابات",
                        "إغلاق آلاف المدارس في إندونيسيا نتيجة الضباب الناجم عن حرائق الغابات",
                        "إغلاق آلاف المدارس في ماليزيا و إندونيسيا نتيجة الضباب الناجم عن حرائق الغابات",
                        "إغلاق جميع المدارس في ماليزيا إندونيسيا نتيجة الضباب الناجم عن حرائق الغابات",
                    ],
                    "jawaban" => "إغلاق آلاف المدارس في ماليزيا و إندونيسيا نتيجة الضباب الناجم عن حرائق الغابات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => " لماذا يتصاعد التوتر الدبلوماسي في المنطقة ؟",
                    "pilihan" => [
                        "الضباب السام الناجم عن حرائق الغابات إلى تراجع جودة الهواء",
                        "عمليات الإغلاق على 1,7 مليون طالب على الأقل في ماليزيا",
                        "تغرق ولاية ساراواك الماليزية التي تقع على جزيرة بورنيو في ضباب سام",
                        "إغلاق المدارس الخميس أول إغلاق جماعي للمدارس في كوالالمبور",
                    ],
                    "jawaban" => "الضباب السام الناجم عن حرائق الغابات إلى تراجع جودة الهواء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => " رجى الخيار أصح الجمل!",
                    "pilihan" => [
                        "أنشئ الأزهر في أول عهد الدولة فاطمية بمصر جامعًا باسم جامع القاهرة",
                        "أنشأ الأزهر في أول عهد الدولة الفاطمية بمصر جامعًا باسم جامع القاهرة",
                        "أنشئ الأزهر في أول عهد الدولة الفاطمية بمصر جامعًا باسم جامع القاهرة",
                        "أنشئ الأزهر في أول العهد الدولة الفاطمية بمصر جامعًا باسم جامع القاهرة",
                    ],
                    "jawaban" => "أنشئ الأزهر في أول عهد الدولة فاطمية بمصر جامعًا باسم جامع القاهرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => " يرجى الخيار أصح الجمل!",
                    "pilihan" => [
                        "المَصرِف والبنك مُصطلحان يُستخدَمان للإشارة إلى المكان الذي يعتمد على التقاء كلٍّ من الطّلب والعرض على النّقود",
                        "المَصرِف والبنك مُصطلحان تُستخدَمان للإشارة إلى المكان الذي يعتمد على التقاء كلٍّ من الطّلب والعرض على النّقود",
                        "المَصرِف والبنك مُصطلحان يُستخدَمان للإشارة إلى المكان التي يعتمد على التقاء كلٍّ من الطّلب والعرض على النّقود",
                        "المَصرِف والبنك مُصطلحتان يُستخدَمان للإشارة إلى المكان الذي يعتمد على التقاء كلٍّ من الطّلب والعرض على النّقود",
                    ],
                    "jawaban" => "المَصرِف والبنك مُصطلحان يُستخدَمان للإشارة إلى المكان الذي يعتمد على التقاء كلٍّ من الطّلب والعرض على النّقود",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يُذكر أنّ خليفةً أنشد قصيدة أمام مدعوويه وحاشيته، وكان بينهم شاعر، فبعد أن انتهى الخليفة من إلقاء قصيدته التفت إلى الشاعر وسأله: هل أعجبتك القصيدة يا شاعر؟ أليست بليغة؟ فأجابه الشاعر: لا أشم بها رائحة البلاغة والله! فغضب الخليفة وأمر أن يُحبس هذا الشاعر في الاصطبل مع الخيول والحمير، فظلّ الشاعر محبوساً في الاصطبل شهراً كاملاً، ولمّا أُفرج عنه الخليفة وعاد إلى مجلسه عاد الخليفة إلى إلقاء الشعر، وقبل أن ينتهي من الإلقاء نهض الشاعر وهمَّ بالخروج من المجلس خلسة، فلمحه الخليفة ثم سأله: إلى أين يا شاعر؟ فأجاب الشاعر: إلى الاصطبل يا مولاي!</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => ' المرادف من كلمة "أنشد".....',
                    "pilihan" => [
                        "يقرأ",
                        "يسمع",
                        "يغني",
                        "يستلزم",
                    ],
                    "jawaban" => "يغني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => " لماذا حبس الشاعر؟",
                    "pilihan" => [
                        "لأنه يقول أن القاصدة لا بلاغة فيها",
                        "لأنه يعلم البلاغة",
                        "لأنه لا يعرف البلاغة",
                        "لأنه محب البلاغة",
                    ],
                    "jawaban" => "لأنه يقول أن القاصدة لا بلاغة فيها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => " أين سجن الشاعر؟",
                    "pilihan" => [
                        "القصر",
                        "المحكمة",
                        "الاصطبل",
                        "السجن ",
                    ],
                    "jawaban" => "الاصطبل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => " بمن سجن الشاعر؟",
                    "pilihan" => [
                        "الخيل والفرس",
                        "الخيل والقنفذ",
                        "الخيل والبغال",
                        "الخيل والحمير",
                    ],
                    "jawaban" => "الخيل والحمير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => " كم مدة حبس الشاعر؟",
                    "pilihan" => [
                        "شهر",
                        "قبل شهر",
                        "أكثر من شهر",
                        "زاد من شهر",
                    ],
                    "jawaban" => "شهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => " ماذا فعل الخليفة بعد خروج الشاعر من حبسه؟",
                    "pilihan" => [
                        "يقرأ له القصيدة",
                        "يغني له القصيدة",
                        "يصنع له القصيدة",
                        "يقبل منه القصيدة ",
                    ],
                    "jawaban" => "يغني له القصيدة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>الإنسان ضئيل الجسم، ضعيف القوى، محدود العمر، ولكن آماله لا تحد، و طموحه لا ينتهى، يحاول أن يدرك كل شيئ، و يسيطر على كل شيئ. وطعامه و شرابه، ولذاته الحسية، و قدرته على العمل، لها حدود قريبة، فلذة الطعام تنقلب عيفا حين يشبع، و الرغبة في العمر تصير نفورا حين يكل</p>
                    <p>و قدرته على الشيئ في حال تحول عجزا فى أحوال، و لكن شغفه بالمعرفة، و نزوعه إلى الإطلاع، و لذاته الروحية التى يدركها في كل جميل حسي أو معنوي، و ينالها في الحب على كثرة أشكاله و ضروبه، كل أولئك غير محدود، لا يحده زمان و لا مكان و لا حال، فالإنسان إذن صغير بجسمه و صورته وما يتصل بالجسم و الصورة، غير محدود بروحه و معناه و ما يتصل بالروح و المعنى. روح الإنسان موصولة بالله سبحانه، و الله هو الأول و الآخر و الظاهر و الباطن، المحيط بكل شيئ، الذى لا يحيط به شيئ</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => ' "ولكن آماله لا تحد، كلمة ” لا تحد',
                    "pilihan" => [
                        "كبيرة",
                        "عظيمة",
                        "ليس لها نهاية",
                        "لا أحد يمنعه",
                    ],
                    "jawaban" => "ليس لها نهاية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => ' "و قدرته على الشيئ في حال تحول عجزا فى أحوال، كلمة ” تحول',
                    "pilihan" => [
                        "تصير",
                        "تكون",
                        "تصبح",
                        "تنخفض",
                    ],
                    "jawaban" => "تصير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => ' "و لكن شغفه بالمعرفة، كلمة ” شغفه',
                    "pilihan" => [
                        "كراهيته",
                        "كثرة حبه",
                        "رغبته",
                        "إرادته",
                    ],
                    "jawaban" => "رغبته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => ' "الإنسان ضئيل الجسم، كلمة ” ضئيل',
                    "pilihan" => [
                        "صغير",
                        "حقير",
                        "قليل",
                        "خفيف",
                    ],
                    "jawaban" => "صغير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => " الفكرة الرئيسية من الفقرة السابقة هي ؟",
                    "pilihan" => [
                        "أن الإنسان حلمهم كثير",
                        "الإنسان متحدد جدا",
                        "ليس للإنسان طموح",
                        "الأمنية لمن زكبر في الجسم والسن.",
                    ],
                    "jawaban" => "أن الإنسان حلمهم كثير",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>خلق الله تعالى الكائنات الحيّة على سطح الأرض بأنواع وأشكالٍ مختلفة وجعل لكل منها لغة للتخاطب فيما بينها لا يتعرف عليها الإنسان. فكما يوجد الكلام والإشارات كنوع من لغة التخاطب من أجل التواصل فيما بين البشر، كذلك هو شأن الكائنات الحية الأخرى. فالله تعالى كيفها على وسائل معينة متفق عليها فيما بينها لأجل سهولة التواصل مما يسّهل نمط الحياة عليها. وقد ظهرت هذه اللغات في القرآن الكريم عندما فهم سيدنا سليمان لغة النملة التي حذرت قومها من جنود سليمان للاختباء لكيلا يحطموهم من دون أن يعلموا، وقد شكر سيدنا سليمان الله عز وجل على نعمة قدرته فهم لغات الكائنات الحية الأخرى.</p>
                    <p>تؤدّي النحلة رقصات مختلفة لإيصال معلومات مختلفة لبقية النحلات. فمثلا ترقص النحلة رقصة دائريّة عندما تجد الغذاء على مسافة لا تتعدى 50 متراً عن الخلية، حيث إنّها ترقص بشكلٍ دائري باتجاه اليمين أو الشمال فوق أقراص الخليّة، كما أنها ترقص بشكل اهتزازي عندما يكون الغذاء يقع على بعد أكثر من 50 متراً وأقل من 100 متر.</p>
                    <p>تفرز النحلات مواد كيميائية خاصة للدلالة على معلومات معينة. فمثلاً عندما تفرز الملكة الفرمون الخاص بها تفهم النحلات العاملات والذكور أنّه يجب تنظيم العمل داخل الخلية، ويجب إتمام عملية التزاوج، بينما تصدِر النحلات العاملات اللواتي يبحثن عن الرحيق مادة كيميائية على الأزهار الموجود فيها الرحيق لتدلّل النحلات العاملات الأخريات على مكان وجود الرحيق. ولقد تمّ اكتشاف لغة إصدار الأصوات بين فئةٍ قليلة من النحلات للتواصل فيما بينها، حيث لوحِظ أنَّ الملكات الصغيرات اللواتي خرجن من البيوت الملكيّة حديثا يلجأن إلى إصدار أصوات خاصة فيما بينها يشبه صفير البط، وهذه الأصوات تنظم عمليّة التطريد.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => " كيف تخبر النحلة النحلات الأخرى عند وجود الطعام؟",
                    "pilihan" => [
                        "برقصات طويلة",
                        "بإخراج فرمونات خاصة",
                        "ترقص رقصة دائرية أو اهتزازية",
                        "كل الإجابة غير صحيحة",
                    ],
                    "jawaban" => "ترقص رقصة دائرية أو اهتزازية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => " لماذا فهم سيدنا سليمان لغة النملة؟",
                    "pilihan" => [
                        "لأجل تمرينات طويلة",
                        "لأنه نبيّ",
                        "لأن الله سبحانه وتعالى وهبه إياه",
                        "لأن النملة أرادت أن يسمعه سيدنا سليمان",
                    ],
                    "jawaban" => "لأن الله سبحانه وتعالى وهبه إياه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => " كيف تخبر النحلة النحلات الأخرى وجود الرحيق في الأزهار؟",
                    "pilihan" => [
                        "بإصدار مادة كيميائية على الأزهار",
                        "بإخراج فرمونات خاصة",
                        "برقصات قصيرة",
                        "برقصات دائرية",
                    ],
                    "jawaban" => "بإصدار مادة كيميائية على الأزهار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => " ما معنى ’’حطم’’؟",
                    "pilihan" => [
                        "مشى",
                        "كسّر",
                        "أصابه الحطم",
                        "انهدم",
                    ],
                    "jawaban" => "كسّر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => " ما معنى ’’فئة’’؟",
                    "pilihan" => [
                        "فرقة",
                        "جامعة",
                        "ناس",
                        "كل الإجابة صحيحة",
                    ],
                    "jawaban" => "فرقة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "ما  المثال من اسلوب القصر؟",
                    "pilihan" => [
                        "هل محمد ناجح؟",
                        "لا إله إلا الله",
                        "لا تأكل الأطعمة",
                        "متى نذهب إلى السوق؟",
                    ],
                    "jawaban" => "متى نذهب إلى السوق؟",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => " زيد كالبحر، ما نوع التشبيه في العبارة؟",
                    "pilihan" => [
                        "التشبيه البليغ",
                        "التشبيه المجمل",
                        "التشبيه المفصل",
                        "التشبيه المؤكد",
                    ],
                    "jawaban" => "التشبيه المجمل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => " من يهن يسهل الهوان عليه ما لجرح بميت إيلام .ما نوع التشبيه في العبارة السابقة؟",
                    "pilihan" => [
                        "التشبيه التمثيلي",
                        "التشبيه الضمني",
                        "التشبيه المفصل",
                        "التشبيه المجمل",
                    ],
                    "jawaban" => "التشبيه الضمني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => ' "كم بعثنا الجيش جرارا وأرسلنا العيون" "ما نوع المجاز المرسل في العبارة السابقة؟',
                    "pilihan" => [
                        "سببية",
                        "مسببية",
                        "جزئية",
                        "كلية",
                    ],
                    "jawaban" => "جزئية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => ' ألقى عصاه". ما نوع الكناية في العبارة السابقة؟',
                    "pilihan" => [
                        "كناية عن الموصوف",
                        "كناية عن الصفة",
                        "كناية عن النسبة",
                        "كناية عن المعنى",
                    ],
                    "jawaban" => "كناية عن الصفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => " فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ ……… (٨) فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيْرًا (٩)",
                    "pilihan" => [
                        "بشماله",
                        "بيمينه",
                        "بجواره",
                        "بيده",
                    ],
                    "jawaban" => "بيمينه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => " فأَنْبَتْنَا فِيهَا ……….. (27) وَعِنَبًا وَقَضْبًا (28) وَزَيْتُونًا وَنَخْلاً",
                    "pilihan" => [
                        "رزّا",
                        "حبّة",
                        "جنّة",
                        "حبّا",
                    ],
                    "jawaban" => "حبّا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => " وَفُتِحَتِ السَّمَاءُ فَكَانَتْ......",
                    "pilihan" => [
                        "سرابا",
                        "أبوابا",
                        "مرصادا",
                        "أحقابا",
                    ],
                    "jawaban" => "أبوابا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => " هو الذى خلق لكم مافي الأرض جميعا ثم استوى إلى السماء … … … سبع سموات وهو بكل شيئ عليم",
                    "pilihan" => [
                        "فخلقهن",
                        "فجععلهن",
                        "فسواهن",
                        "فكتبهن",
                    ],
                    "jawaban" => "فسواهن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => " و إذا لقوا الذين امنوا قالوا امنا، و إذا خلا بعضهم إلى بعض قالوا أتحدثونهم بما فتح الله عليكم … … … به عند ربكم, أفلا تعقلون",
                    "pilihan" => [
                        "ليجادلوكم",
                        "ليحدثوكم",
                        "ليكذبوكم",
                        "ليحاجوكم",
                    ],
                    "jawaban" => "ليحاجوكم",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav6(){
        $data = [
            [
                "tipe" => "audio",
                "data" => "v6 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "يزيد يحضر في الفصل",
                        "الطلاب يمزحون مع يزيد",
                        "غاب يزيد عن الفصل",
                        "ما ذهب الطلاب إلى يزيد",
                    ],
                    "jawaban" => "غاب يزيد عن الفصل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "محمد مغلوب على عدوه",
                        "لم يستطيع محمد على إجابة الأسئلة",
                        "فاز محمد في مسابقته",
                        "المسابقة صعبة للغاية",
                    ],
                    "jawaban" => "فاز محمد في مسابقته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "فرض طلب العلم",
                        "الصين قبلة العلم",
                        "العلم المفضل في الصين",
                        "الصين بلاد بعيد",
                    ],
                    "jawaban" => "فرض طلب العلم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "المرض",
                        "الطبيب",
                        " المعلم",
                        "القاضي",
                    ],
                    "jawaban" => "الطبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "لأنها تنتظر محمد",
                        "لأن أحمد عائد",
                        "لأنه تائبة",
                        "لأن أحمد يشتري لها البيت",
                    ],
                    "jawaban" => "لأن أحمد عائد",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6.,
                    "soal" => "",
                    "pilihan" => [
                        "مطالعة الدروس",
                        "للراحة",
                        "للرحلة",
                        "لتسليم مع إخوانه",
                    ],
                    "jawaban" => "للرحلة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "الأربعاء",
                        "الخميس",
                        "الجمعة",
                        "السبت",
                    ],
                    "jawaban" => "الجمعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8.,
                    "soal" => "",
                    "pilihan" => [
                        "سيرمي الرماء",
                        "سيرمي الزبالة",
                        "سيرمي المزبلة",
                        "سيتعلم الرماية",
                    ],
                    "jawaban" => "سيرمي الزبالة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "القراءة",
                        "ركول الحصان",
                        "التطعيم",
                        "الكتابة ",
                    ],
                    "jawaban" => "القراءة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "المحكمة",
                        "المرعى",
                        "المدرسة",
                        "المزرعة",
                    ],
                    "jawaban" => "المزرعة",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11.,
                    "soal" => "",
                    "pilihan" => [
                        "المتعلمات",
                        "المؤمنات",
                        "المشتريات",
                        "المعلمات",
                    ],
                    "jawaban" => "المتعلمات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12.,
                    "soal" => "",
                    "pilihan" => [
                        "مرتبة",
                        "متبثرة",
                        "مفتوحة",
                        "فاسدة",
                    ],
                    "jawaban" => "متبثرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "الطالب",
                        "الرعي",
                        "مدير الجامعة",
                        "الطالبة",
                    ],
                    "jawaban" => "الطالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14.,
                    "soal" => "",
                    "pilihan" => [
                        "الحافلة",
                        "المرعى",
                        "موقف الحافلة",
                        "سائق الحافلة",
                    ],
                    "jawaban" => "موقف الحافلة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "التاجر",
                        "الإمام",
                        "المدرس",
                        "الطلاب",
                    ],
                    "jawaban" => "التاجر",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16.,
                    "soal" => "",
                    "pilihan" => [
                        "في النهار",
                        "في الليل",
                        "في الصباح",
                        "في المساء",
                    ],
                    "jawaban" => "في الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "إشترينا الأشياء",
                        "ذهبنا إلى السوق",
                        "أوصلنا إلى المرعى",
                        "وجدنا السوق",
                    ],
                    "jawaban" => "ذهبنا إلى السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18.,
                    "soal" => "",
                    "pilihan" => [
                        "الصبح",
                        "العشاء",
                        "التهجد",
                        "الضحى ",
                    ],
                    "jawaban" => "التهجد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "المدرسة",
                        "الجامعة",
                        "القرية",
                        "المسجد",
                    ],
                    "jawaban" => "الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "الخالة",
                        "الأخت",
                        "الجدة",
                        "العمة",
                    ],
                    "jawaban" => "الجدة",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "القهوة قليلة",
                        "يحي يحب القهوة قليلة",
                        "القهوة شيء عجيب",
                        "تمتع مولنا بشربها",
                    ],
                    "jawaban" => "تمتع مولنا بشربها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "الأم",
                        "الأب",
                        "الحاكم",
                        "الراعي",
                    ],
                    "jawaban" => "الأب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "لابد لنا أن نقّل من الصدق",
                        "الصدق أمر مهم",
                        "الصديق قليل",
                        "صدق الصديق",
                    ],
                    "jawaban" => "الصدق أمر مهم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "العشاء",
                        "الصبح",
                        "التهجد",
                        "الجمعة",
                    ],
                    "jawaban" => "الجمعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25.,
                    "soal" => "",
                    "pilihan" => [
                        "القاضي",
                        "المعلم",
                        "الراعي",
                        "القاضي ",
                    ],
                    "jawaban" => "الراعي",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "عائشة وخالد",
                        "خالد ومريم",
                        "خالد وأحمد",
                        "سلمان وخالد",
                    ],
                    "jawaban" => "سلمان وخالد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "كرة القدم",
                        "كرة السلة",
                        "كرة الريشة",
                        "كرة اليد",
                    ],
                    "jawaban" => "كرة القدم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "في المدرسة الدوام",
                        "في المدرسة السلام",
                        "في المدرسة الكلام",
                        "في المدرسة القلام",
                    ],
                    "jawaban" => "في المدرسة السلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "الرسم",
                        "جمع الطوابع",
                        "كرة القدم",
                        "كرة السلة",
                    ],
                    "jawaban" => "جمع الطوابع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "المدرسة",
                        "الشخصية",
                        "التعارف",
                        "التنافس",
                    ],
                    "jawaban" => "التعارف",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في المأوى",
                        "في السكن",
                        "في المسجد",
                        "في الفندوق",
                    ],
                    "jawaban" => "في السكن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "نعم، المسجد بعيد",
                        "نعم، المسجد قريب",
                        "لا، ليس هناك مسجد",
                        "لا، المسجد بعيد",
                    ],
                    "jawaban" => "نعم، المسجد قريب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "نعم، في الحي مدارس كثيرة",
                        "نعم، في الحي مدرسة واحدة",
                        "لا، في الحي مدرسة واحدة",
                        "لا، لا توجد المدرسة فيه",
                    ],
                    "jawaban" => "لا، لا توجد المدرسة فيه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "جانب المسجد",
                        "أمام المسجد",
                        "خلف المسجد",
                        "داخل المسجد",
                    ],
                    "jawaban" => "خلف المسجد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "الفواكه",
                        "الخضروات",
                        "الأطئمة",
                        "المشروبات",
                    ],
                    "jawaban" => "المشروبات",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "أحمد طالب يشاهد الحريق",
                        "الحريق في بيت أحمد",
                        "الحريق في البيت",
                        " الحريق في مصنع الدراجة",
                    ],
                    "jawaban" => " الحريق في مصنع الدراجة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37.,
                    "soal" => "",
                    "pilihan" => [
                        "الحريق",
                        "سيارة الإسعاف",
                        "الشرطة",
                        "الدراجة",
                    ],
                    "jawaban" => "الحريق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "سيارة الإسعاف",
                        "سيارة الشرطة",
                        "سيارة الإطفاء",
                        " سيارة الركاب",
                    ],
                    "jawaban" => " سيارة الركاب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "دراجة جديدة وساعة وكرة",
                        "دراجة جديدة وقلما وحقيبة",
                        "كتبا جديدة وساعة وحقيبة",
                        "دراجة جديدة وساعة وحقيبة",
                    ],
                    "jawaban" => "دراجة جديدة وساعة وحقيبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40.,
                    "soal" => "",
                    "pilihan" => [
                        "أخبر أحمد إلى رجال الإطفاء بعد مشاهدة الحريق",
                        "ما أخبر أحمد إلى رجال الإطفاء بعد مشاهدة الحريق",
                        "أخبر أحمد إلى رجال المرور بعد مشاهدة الحريق",
                        "أخبر أحمد إلى رجال الشرطة بعد مشاهدة الحريق",
                    ],
                    "jawaban" => "أخبر أحمد إلى رجال الإطفاء بعد مشاهدة الحريق",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v6 41-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        " في الليل",
                    ],
                    "jawaban" => "في الصباح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة الثالثة صباحا",
                        "في الساعة الثالثة مساء",
                        "في الساعة الرابعة صباحا",
                        "في الساعة الثانية صباحا",
                    ],
                    "jawaban" => "في الساعة الثالثة صباحا",
                ]
            ],
            
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "كان تلميذا في المدرسة المتوسطة وحينئذ مات أمه",
                        "كان تلميذا في المدرسة المتوسطة وحينئذ مات أبوه",
                        "كان تلميذا في المدرسة الثانوية وحينئذ مات أمه",
                        "كان تلميذا في المدرسة الثانوية وحينئذ مات أبوه",
                    ],
                    "jawaban" => "كان تلميذا في المدرسة المتوسطة وحينئذ مات أبوه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "لَمَّا يدرس في المدرسة الثانوية",
                        "لَمَّا يدرس في المدرسة الجامعة",
                        "لَمَّا يدرس في المدرسة المتوسطة",
                        "لَمَّا يدرس في المدرسة الإبتدائية",
                    ],
                    "jawaban" => "لَمَّا يدرس في المدرسة المتوسطة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                        "خمس سنوات",
                    ],
                    "jawaban" => "خمس سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "ينبغي علينا أن ندرس مستمرا إلى الأبد",
                        "طلب العلم فريضة على كل مسلم",
                        "طلب العلم منذ الصغار",
                        "لا تطلبوا العلم بعد الشيوخ",
                    ],
                    "jawaban" => "ينبغي علينا أن ندرس مستمرا إلى الأبد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "يدرس في الصباح",
                        "يدرس في المساء",
                        "يدرس في الليل",
                        "يدرس خلال العمل",
                    ],
                    "jawaban" => "يدرس في المساء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                        "خمس سنوات",
                    ],
                    "jawaban" => "سنتين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "في كلية التربية",
                        "في كلية الطب",
                        "في كلية الشريعة",
                        "في كلية الهندسة",
                    ],
                    "jawaban" => "في كلية الطب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                        "خمس سنوات",
                    ],
                    "jawaban" => "خمس سنوات",
                ]
            ],
            
        ];

        return $data;
    }

    public function get_soal_tarakibv6(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    القسم الثاني : فهم التراكيب والتعبيرات"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'عمل محمد ليلا ونهارا من .... أن يذيق أولاده طعم التعليم.',
                    "pilihan" => [
                        "أجل",
                        "ثم",
                        "ناحية",
                        "رغم",
                    ],
                    "jawaban" => "أجل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'جاء زملائك متأخرين. ما المفرد من كلمة "زملاء" ...',
                    "pilihan" => [
                        "زملة",
                        "زمل",
                        "زميل",
                        "زميلة",
                    ],
                    "jawaban" => "زميل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'جاء زملائك متأخرين. ما المرادف من كلمة "زملاء" ...',
                    "pilihan" => [
                        "أعداء",
                        "أصدقاء",
                        "أولاد",
                        "أبناء",
                    ],
                    "jawaban" => "أصدقاء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'ضافر محمد إلى ألمانيا يوم الخميس. كلمة "يوم" في الجملة السابقة....',
                    "pilihan" => [
                        "منصوب",
                        "مجرور",
                        "مرفوع",
                        "مجزوم",
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'المعلم : متى تستيقظين يا ليلى ؟<br>ليلى : أستيقظ في .... صباحا',
                    "pilihan" => [
                        "الساعة الثلثة",
                        "الساعة الثلث",
                        "الساعة ثالثة",
                        "الساعة الثالثة",
                    ],
                    "jawaban" => "الساعة الثالثة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'سنبدأ العام الدراسي ....  في الشهر يولي.',
                    "pilihan" => [
                        "جديد",
                        "جديدة",
                        "الجديد",
                        "الجديدة",
                    ],
                    "jawaban" => "الجديد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'هناك المباراة بين نادي برسيلون و نادي أرسينال في التلفاز. ما المراد بكلمة " المبارة" ...',
                    "pilihan" => [
                        "الملعب",
                        "المصاحبة",
                        "المسابقة",
                        "اللعاب",
                    ],
                    "jawaban" => "المسابقة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'أعلنت الحكومة  قبل قليل أن غدا عيد الفطر. كلمة "قبل" ...',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم ",
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'عرفنا أن سليمة <u>طالبة</u> <u>مجتهدة</u> و<u>ماهر</u> في هذه <u>الجامعة</u>. إين الكلمة الخاطئة في هذه الجملة؟ ',
                    "pilihan" => [
                        "طالبة",
                        "مجتهدة",
                        "ماهر",
                        "الجامعة",
                    ],
                    "jawaban" => "ماهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'احتفل المسلمون ليلة نزول القرآن في اليوم السابع عشر من شهر رمضان. كلمة "رمضان" ....',
                    "pilihan" => [
                        "رمضانُ",
                        "رمضانَ",
                        "رمضانِ",
                        "رمضانْ",
                    ],
                    "jawaban" => "رمضانَ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'ينزل المطر غزيرا. المراد بكلمة "غزيرا"...',
                    "pilihan" => [
                        "رذاذا",
                        "خفيفا",
                        "شديدا",
                        "قويا",
                    ],
                    "jawaban" => "شديدا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'المسلمون ..... في المسجد.',
                    "pilihan" => [
                        "يصلي",
                        "تصلي",
                        "تصلون",
                        "يصلون",
                    ],
                    "jawaban" => "يصلون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'قام الرجل قيام الشرطي. نفهم من الجملة أن كلمة "قيام" ....',
                    "pilihan" => [
                        "مفعول لأجله",
                        "مفعول مطلق",
                        "مفعول معه",
                        "مفعول فيه",
                    ],
                    "jawaban" => "مفعول مطلق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'الإنسان يتنفس .... الرئتين، وكذالك بعض الحيونات. ',
                    "pilihan" => [
                        "على",
                        "مع",
                        "ب",
                        "عبر",
                    ],
                    "jawaban" => "ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'في القرآن ثلاثون ....',
                    "pilihan" => [
                        "أجزاءٍ",
                        "جزءٍ",
                        "أجزاءًا",
                        "جزءًا",
                    ],
                    "jawaban" => "جزءًا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'فسوف .... الرياضية غدا.',
                    "pilihan" => [
                        "أُدرس",
                        "تدرسين",
                        "درست",
                        "درسنا",
                    ],
                    "jawaban" => "تدرسين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'إن المسلمين إخوة. الخبر في هذه الجملة ؟',
                    "pilihan" => [
                        "إن",
                        "المسلمين",
                        "إخوة",
                        "كل الإجابة خاطئة",
                    ],
                    "jawaban" => "إخوة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'انتظرنا نصف الساعة ولكن الأستاذ لم يأت بعد. كلمة "بعد" في الجملة السابقة..',
                    "pilihan" => [
                        "بعدَ",
                        "بعدُ",
                        "بعدِ",
                        "بعدْ",
                    ],
                    "jawaban" => "بعدُ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => 'إذا غفلت .... ذكر الله يقسو قلبك شيئا فشيئا. ',
                    "pilihan" => [
                        "على",
                        "عن",
                        "من",
                        "ب",
                    ],
                    "jawaban" => "عن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'اقتبس هذه المقالة .... آية القرآن.',
                    "pilihan" => [
                        "على",
                        "عن",
                        "من",
                        "ب",
                    ],
                    "jawaban" => "من",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'كان رسول الله رجلا شجاعا. عرفنا من الجملة السابقة أن كلمة "رسول"...',
                    "pilihan" => [
                        "مبتدأ",
                        "خبر كان",
                        "مصدر مؤول",
                        "اسم كان",
                    ],
                    "jawaban" => "اسم كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'في البستان أعشاب وأشجار كثيرة. ما المفرد من كلمة "أعشاب" ...؟',
                    "pilihan" => [
                        "أشب",
                        "أعش",
                        "عشبأ",
                        "عشب",
                    ],
                    "jawaban" => "عشب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'قام الحاضرون بحضور الشيخ احتراما له. كلمة احتراما هي؟',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "مفعول لأجله",
                        "تمييز",
                    ],
                    "jawaban" => "مفعول لأجله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => 'هذه الفتاة حزينة بسبب فقدان الدراجة. الفتاة في هذه الجملة هي؟',
                    "pilihan" => [
                        "اسم الإشارة",
                        "خبر",
                        "مشار إليه",
                        "مفعول به",
                    ],
                    "jawaban" => "مشار إليه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'ذهب رجل عطشان إلى المقهى. كلمة "عطشان" في الجملة السابقة؟',
                    "pilihan" => [
                        "مرفوع بالضمة",
                        "منصوب بالفتحة",
                        "مجرور بالكسرة",
                        "مجرور بالفتحة",
                    ],
                    "jawaban" => "مرفوع بالضمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'يذهب – صباحا – السوق – و- مساء –إلى – التاجر – يرجع',
                    "pilihan" => [
                        "يرجع التاجر صباحا ويذهب صباحا و إلى السوق",
                        "يذهب التاجر يرجع إلى السوق صباحا ومساء",
                        "يرجع التاجر مساء وإلى السوق يذهب صباحا",
                        "يذهب التاجر إلى السوق صباحا ويرجع مساء",
                    ],
                    "jawaban" => "يذهب التاجر إلى السوق صباحا ويرجع مساء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'أحب ما تحب من الأشياء. حرف "ما"....',
                    "pilihan" => [
                        "النافي",
                        "الموصولة",
                        "الاستفهام",
                        "الابتدائية",
                    ],
                    "jawaban" => "الموصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => 'المدرس		: أليس محمد غائب ؟ <br> الطلاب		: ........',
                    "pilihan" => [
                        "نعم هو غائب",
                        "لا هو حاضر",
                        "بلى هو غائب",
                        "بلى هو حاضر",
                    ],
                    "jawaban" => "بلى هو غائب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'من يتكاسل في التعلم يندم في الإمتحان. حرف "من" .....',
                    "pilihan" => [
                        "النافي",
                        "الموصولة",
                        "الاستفهام",
                        "الشرط",
                    ],
                    "jawaban" => "الشرط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'تحسنت مريم شيئا فشيئا بعد تناولها الأدوية. كلمة "الأدوية" ....',
                    "pilihan" => [
                        "الأدويةُ",
                        "الأدويةَ",
                        "الأدويةِ",
                        "الأدويةْ",
                    ],
                    "jawaban" => "الأدويةَ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'لا بد لك أن تملك نفسا ....',
                    "pilihan" => [
                        "هادء",
                        "هادئ",
                        "هادئة",
                        "هادءة",
                    ],
                    "jawaban" => "هادئة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'لا داعي ... الخوف، ما ارتكبت أي خطاء.',
                    "pilihan" => [
                        "على",
                        "ب",
                        "في",
                        "ل",
                    ],
                    "jawaban" => "ل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'ذهبت ..... طالبة إلى حديقة الحيوانات.',
                    "pilihan" => [
                        "سبعون",
                        "سبع",
                        "سبعة",
                        "سبعة عشر",
                    ],
                    "jawaban" => "سبعون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => 'في كل سنبلة مائة حبة والله يضاعف لمن يشاء. كلمة "حبة" ....',
                    "pilihan" => [
                        "مفعول به",
                        "مضاف إليه",
                        "مضاف",
                        "مبتدأ",
                    ],
                    "jawaban" => "مضاف إليه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'لا يسيل الجليد. كلمة "يسيل"...',
                    "pilihan" => [
                        "منصوب",
                        "مرفوع",
                        "مجرور",
                        "مجزوم",
                    ],
                    "jawaban" => "مرفوع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'من علامة إعراب النصب هي ...',
                    "pilihan" => [
                        "الضمة",
                        "السكون",
                        "ثبوت النون",
                        "الكسرة",
                    ],
                    "jawaban" => "الكسرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => 'الأم – المشقة – من – تتألم – لا',
                    "pilihan" => [
                        "الأم لا المشقة من تتألم",
                        "لا المشقة من الأم تتألم",
                        "لا تتألم الأم من المشقة",
                        "الأم لا تتألم المشقة من",
                    ],
                    "jawaban" => "لا تتألم الأم من المشقة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'الأخطاء ..... التدريب شيء عادي.',
                    "pilihan" => [
                        "وسط",
                        "أثناء",
                        "جانب",
                        "أمام",
                    ],
                    "jawaban" => "أثناء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'يبيع التاجر البضاءة في السوق. ما البناء من كلمة "يبيع" ....',
                    "pilihan" => [
                        "مثال",
                        "أجواف",
                        "نقص",
                        "لفيف",
                    ],
                    "jawaban" => "أجواف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'يا .... المدرسة، اجتهدوا!',
                    "pilihan" => [
                        "معلمون",
                        "معلمين",
                        "معلمو",
                        "معلمي",
                    ],
                    "jawaban" => "معلمي",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv6(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center><b>فهم المقروء</b></center></p>
                    <p>روي أنّ الصحابي الجليل عبد الرحمن بن عوف لمّا هاجر إلى المدينة آخى النبي -صلّى الله عليه وسلّم- بينه وبين صاحبه سعد بن الربيع الذي كان صاحب أموالٍ كثيرةٍ،     فأخبر عبد الرحمن بأنّه سيتنازل له عن نصف ماله وعن زوجةٍ من زوجاته ليتزوّجها، فما كان ردّ عبد الرحمن بن عوف -رضي الله عنه- إلّا أن قال له: "بارك الله لك في مالك وأهلك؛ بل دلّوني على السوق"، ويُذكر أنّه كان صاحب تجارةٍ عظيمةٍ بعد ذلك، وكان يتصدّق على جيوش المسلمين وفقرائهم بمئات الآلاف من الدنانير</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'المراد بكلمة "الجليل" ... ',
                    "pilihan" => [
                        "الواسع",
                        "الجبار",
                        "الكريم",
                        "الصديق",
                    ],
                    "jawaban" => "الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'هل سعد بن الربيع من رجل ثري؟ ',
                    "pilihan" => [
                        "نعم، هو رجل ثري",
                        "ليس هو رجل ثري",
                        "لا، هو ليس رجل ثري",
                        "بلى، هو رجل ثري",
                    ],
                    "jawaban" => "نعم، هو رجل ثري",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'ما المراد بهذا القول "دلّوني على السوق"؟',
                    "pilihan" => [
                        "أن عبد الرحمن بن عوف سيذهب إلى السوق",
                        "أن سعد بن الربيع تاجر في السوق",
                        "أن سعد بن الربيع هو رئيس السوق",
                        "أن عبد الرحمن يريد التجارة في السوق",
                    ],
                    "jawaban" => "أن عبد الرحمن يريد التجارة في السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'المرادف من كلمة "الجيوش"... ',
                    "pilihan" => [
                        "الجنود",
                        "البوليس",
                        "الحافظ",
                        "الأمن",
                    ],
                    "jawaban" => "الجنود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'أين سكن عبد الرحمن بن عوف قبل الهجرة؟ ',
                    "pilihan" => [
                        "الكوفة",
                        "البصرة",
                        "مكة",
                        "البغداد",
                    ],
                    "jawaban" => "مكة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'المفرد من كلمة "الدنانير"',
                    "pilihan" => [
                        "الدنر",
                        "الدينر",
                        "الدينار",
                        "الدوار",
                    ],
                    "jawaban" => "الدينار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'المراد من "بأنه سيتنازل له"....',
                    "pilihan" => [
                        "بأنه سيخبره",
                        "بأنه سيمنحه",
                        "بأنه سيتركه",
                        "بأنه سيمنعه",
                    ],
                    "jawaban" => "بأنه سيمنحه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'من أصبح بصاحب تجارةٍ عظيمةٍ؟',
                    "pilihan" => [
                        "عبد الرحمن بن عوف",
                        "النبي صلى الله عليه وسلم",
                        "سعد بن الربيع",
                        "علي بن أبي طالب",
                    ],
                    "jawaban" => "عبد الرحمن بن عوف",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>في غابة جميلة غنّاء سمعت الحيوانات صوت شجار غرابين واقفين على غصن شجرة عالِ، فقَدِم الثعلب. وحاول أن يفهم سبب شجارهما، وما إن اقترب أكثر حتى سأل الغرابين: ما بالكما أيها الغرابين؟ فقال أحدهما: اتفقنا على أن نتشارك قطعة الجبن هذه بعد أن نقسمها بالتساوي، لكنّ هذا الغراب الأحمق يحاول أن يأخذ أكثر من نصيبه، فابتسم الثعلب وقال: إذن ما رأيكما أن أساعدكما في حل هذه المشكلة، وأقسم قطعة الجبن </p>
                    <p>بينكما بالتساوي؟ نظر الغرابان إلى بعضهما ووافقا على اقتراح الثعلب، وأعطياه قطعة الجبن، فقسم الثعلب قطعة الجبن وقال: يا إلهي لقد أخطأت في قسمتها، فهذه القطعة تبدو أكبر من تلك، سآكل من القطعة الكبيرة قليلاً حتى تتساوى القطعتان في الحجم، فالعدل هو الأساس، وأكل من القطعة الكبيرة قضمة حتى أصبحت أصغر من الأولى، فاعتذر للغرابين على خطئه وقرّر أن يأكل من القطعة الأولى حتى تصبحان متساويتين فهذا هو الحل الوحيد، وظلّ الثعلب على هذه الحال يقسم القطعة بشكل غير متساوِ متعمداً، ثمّ يأكل من قطعة فتصبح أصغر من الأخرى حتى أكل قطعة الجبن كاملة كما خطّط وفرّ من الغرابين هارباً، بينما تعلّم الغرابان أن يحلّا مشاكلهما بنفسيهما دون الاستعانة بالثعلب الشرير.</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'المرادف من كلمة "العالي"....',
                    "pilihan" => [
                        "المجتبى",
                        "المنادى",
                        "المرتفع",
                        "السامي",
                    ],
                    "jawaban" => "المرتفع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'الجمع من كلمة "الغصن" في فقوة الأولى... ',
                    "pilihan" => [
                        "الغصان",
                        "الأغصن",
                        "الغصون",
                        "الأغصان",
                    ],
                    "jawaban" => "الأغصان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'من قام بتقسيم قطعة الجبن؟',
                    "pilihan" => [
                        "الغرابين",
                        "النملة",
                        "الثعلب",
                        "الفيل",
                    ],
                    "jawaban" => "الثعلب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'لماذا شاجر الغرابان؟',
                    "pilihan" => [
                        "لأنهما سيأكلان قطعة من الجبن",
                        "لأنهما سيقسمان قطعة من الجبن",
                        "لأنهما وجدا قطعة من الجبن",
                        "لأنهما يريدان قطعة من الجبن",
                    ],
                    "jawaban" => "لأنهما سيقسمان قطعة من الجبن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'المرادف من كلمة "قسم" في الفقرة السابقة هي...',
                    "pilihan" => [
                        "وزّع",
                        "بذر",
                        "أسلف",
                        "بادر",
                    ],
                    "jawaban" => "وزّع",
                ]
            ],
            
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'المرادف من كلمة "شاجر"... ',
                    "pilihan" => [
                        "ساوم",
                        "شارك",
                        "أصلح",
                        "خاصم",
                    ],
                    "jawaban" => "خاصم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'مذا شعر الغرابان في النهاية؟',
                    "pilihan" => [
                        "الفرحة",
                        "الحزينة",
                        "الندامة",
                        "السعادة",
                    ],
                    "jawaban" => "الندامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'اشتهر الثعلب بأنه حيوان....',
                    "pilihan" => [
                        "الصدق",
                        "المكّار",
                        "الأمانة",
                        "الذاكي",
                    ],
                    "jawaban" => "المكّار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'هل أكل الغربان قطعة الجبن؟',
                    "pilihan" => [
                        "نعم، أكل الغربان قطعة الجبن",
                        "نعم، ليس أكل الغربان قطعة الجبن",
                        "لا، ما أكل الغربان قطعة الجبن",
                        "لا، ليس أكل الغربان قسمة الجبن",
                    ],
                    "jawaban" => "لا، ما أكل الغربان قطعة الجبن",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p> انتقلت الصين من النظام الاقتصادي المغلق والمركزي إلى النظام المفتوح المتجه نحو السوق العالمي، وكان ذلك منذ أواخر السبعينيات، حيث إنّ الحكومة الصينية قامت بعدة إصلاحات تدريجية أدت إلى زيادة الناتج المحلي الإجمالي بأكثر من عشرة أضعاف ما كان عليه منذ عام 1978م، وقد اشتملت هذا الإصلاحات على الزراعة وتحرير الأسعار، وزادت استقلال الشركات الحكومية، كما أنّها ساعدت على نمو القطاع الخاص، وزادت إلى تنمية الأنظمة المصرفية، وزادت في الانفتاح على التجارة والاستثمار الخارجي، كما دعمت الدولة القطاعات الرئيسية بشكل كبير، وفي عام 2013م أصبحت الصين من أكبر الدول التجارية العالمية، وفي عام 2014م تفوقت الصين على الولايات المتحدة الأمريكية من ناحية الاقتصاد، والجدير بالذكر أنّه وبحلول عام 2016م اصبحت الصين من الدول ذات الاقتصاد الكبير في العالم، وبالرغم من ذلك يعدّ دخل الفرد الصيني اقل من المتوسط العالمي</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'ما عاصمة بلاد الصين؟',
                    "pilihan" => [
                        "شنغاهي",
                        "بكين",
                        "تيونكوك",
                        "فيكنج",
                    ],
                    "jawaban" => "بكين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => 'لماذا انتقلت الصين من النظام الاقتصادي المغلق والمركزي إلى النظام المفتوح المتجه نحو السوق العالمي؟',
                    "pilihan" => [
                        "لزيادة النتاج العالمي",
                        "لزيادة النتاج المحلي",
                        "لزيادة النتاج السنوي",
                        "لزيادة النتاج البشري",
                    ],
                    "jawaban" => "لزيادة النتاج المحلي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'متى قام بلاد الصين بتغيير النظام الإقتصادي؟',
                    "pilihan" => [
                        "١٩٧٨",
                        "٢٠١٣",
                        "٢٠١٤",
                        "٢٠١٦",
                    ],
                    "jawaban" => "١٩٧٨",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'حيث إنّ الحكومة الصينية قامت بعدة إصلاحات تدريجية أدت إلى زيادة الناتج المحلي الإجمالي. المراد بكلمة "تدريجية" في الجملة السابقة هي؟',
                    "pilihan" => [
                        "مهلا بمهل",
                        "شيئا فشيئا",
                        "نمو سريعا",
                        "أسرع وقت",
                    ],
                    "jawaban" => "شيئا فشيئا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'من ساعد على نمو القطاع الخاص في بلاد الصين؟',
                    "pilihan" => [
                        "النظام الإقتصادي",
                        "النظام المحلي",
                        "الرئيس الجمهرية",
                        "الفلاحون",
                    ],
                    "jawaban" => "النظام الإقتصادي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'أين تقع بلاد الصين؟',
                    "pilihan" => [
                        "قارة آسيا",
                        "قارة أستراليا",
                        "قارة افريقية",
                        "قارة أمركية",
                    ],
                    "jawaban" => "قارة آسيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => 'متى اصبحت الصين من الدول ذات الاقتصاد الكبير في العالم؟',
                    "pilihan" => [
                        "١٩٧٨",
                        "٢٠١٣",
                        "٢٠١٤",
                        "٢٠١٦",
                    ],
                    "jawaban" => "٢٠١٦",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'من المزايا تغيير النظام الإقتصادي هي.... ',
                    "pilihan" => [
                        "زادت استقلال الشركات الحكومية",
                        "ساعدت على نمو القطاع العام",
                        "زادت إلى نقصان الأنظمة المصرفية",
                        "وزادت في الإغلاق على التجارة والاستثمار الخارجي",
                    ],
                    "jawaban" => "زادت استقلال الشركات الحكومية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'متى تفوقت الصين على الولايات المتحدة الأمريكية من ناحية الاقتصاد؟ ',
                    "pilihan" => [
                        "١٩٧٨",
                        "٢٠١٣",
                        "٢٠١٤",
                        "٢٠١٦",
                    ],
                    "jawaban" => "٢٠١٤",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>من قصص الصَّحابة التي وردت قصة أبي الدحداح والنَّخلة، فقد جاء رجلُ يشتكي لرسول الله -صلى الله عليه وسلم- أنَّه كان يبني سورًا حول بستانه، وفي مكان بناء السُّور كان هناك نخلةُ لجاره سببت اعوجاج السُّور، فطلب من صاحب هذه النَّخلة أن يعطيه إياها مقابل مال حتَّى يستقيم بناؤه فرفض، وحينما استدعى رسول الله هذا الرُّجل وسؤاله إياه عن النَّخلة أقرَّ بالأمر.</p>
                    <p>فطلب منه الرَّسول أن يعطيه النَّخلة مقابل نخلةٍ في الجنَّة فرفض الرَّجل، فتمنَّى أبو الدَّحداح أن تكون تلك النَّخلة التي في الجنة من نصيبه، فاشترى تلك النَّخلة بكامل بستانه ونخيله، فهنَّأه رسول الله وبشَّره بأشجار النَّخيل التي له في الجنة، وقد ورد هذا في حديث أنس بن مالك حينما قال:"قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: كم مِن عذقٍ رداحٍ لأبي الدحداحِ في الجنةِ قالها مرارًا فأتى امرأتَه فقال: يا أمَّ الدحداحِ اخرُجي منَ الحائطِ فإني قد بِعتُه بنخلةٍ في الجنةِ فقالت: ربِح البيعُ أو كلمةً تُشبِهُها".</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'لماذا جاء الرجل إلى النبي؟',
                    "pilihan" => [
                        "للصلاة معه",
                        "ليخبر مشاكله",
                        "ليسمع نصيحته",
                        "ليتقرب منه",
                    ],
                    "jawaban" => "ليتقرب منه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => 'هل قابل صاحب النخلة على رأي الرجل؟',
                    "pilihan" => [
                        "نعم، قابل صاحب النخلة على رأي الرجل",
                        "نعم، ليس قابل صاحب النخلة على رأي الرجل",
                        "لا، ما قابل صاحب النخلة على بستان الرجل",
                        "لا، رفض صاحب النخلة على رأي الرجل",
                    ],
                    "jawaban" => "لا، رفض صاحب النخلة على رأي الرجل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'لماذا اشترى أبو الدحداح تلك النَّخلة بكامل بستانه ونخيله؟',
                    "pilihan" => [
                        "لأنه كثرة الفلوس لشراء النخلة",
                        "لأنه يحب شجرة النخلة",
                        "لأنه يريد أن يملك النخلة في الجنة",
                        "لأنه يتأسف على بائع النخلة",
                    ],
                    "jawaban" => "لأنه يريد أن يملك النخلة في الجنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'من قال هذا القول "ربِح البيعُ"؟',
                    "pilihan" => [
                        "رسول الله صلى الله عليه وسلم",
                        "أبوالدحداح",
                        "أم الدحداح",
                        "أنس بن مالك",
                    ],
                    "jawaban" => "أم الدحداح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'المضاد من كلمة "رفض".... ',
                    "pilihan" => [
                        "قابل",
                        "أنجب",
                        "بيّن",
                        "استسلم",
                    ],
                    "jawaban" => "قابل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'المرادف من كلمة "تمنى"....',
                    "pilihan" => [
                        "رجى",
                        "أنقذ",
                        "سار",
                        "أوصل",
                    ],
                    "jawaban" => "رجى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'لماذا طلب الرَّسول من الرجل أن يعطيه النَّخلة مقابل نخلةٍ في الجنَّة؟',
                    "pilihan" => [
                        "لأن جاره هدم السورا",
                        "ليكون عوضا لجاره",
                        "ليكون تسليما على السور",
                        "ليكون الأمن فيهم",
                    ],
                    "jawaban" => "ليكون عوضا لجاره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => 'المرادف من كلمة "اعوجاج"؟',
                    "pilihan" => [
                        "القوام",
                        "انعطاف",
                        "انكسار",
                        "إبطال",
                    ],
                    "jawaban" => "انعطاف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'من هو أبو الدحداح؟',
                    "pilihan" => [
                        "التابعين",
                        "الصحابة",
                        "عم النبي",
                        "تابع التابعين",
                    ],
                    "jawaban" => "الصحابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'لماذا اشتكى الناس رسول الله صلى الله عليه وسلم؟',
                    "pilihan" => [
                        "ليحل مشاكلهم",
                        "ليتأسف مشاكلهم",
                        "لينظر مشاكلهم",
                        "لينال الأجرة منهم",
                    ],
                    "jawaban" => "ليحل مشاكلهم",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>غلب الجانب العلمي والفكري في سيرة الشيخ رشيد رضا على كفاحه السياسي، فرغم كونه ظهر في وقت عصيب، هو وقت تمكن الاحتلال من الديار المصرية، حيث تمكن الاحتلال الإنجليزي من مصر ولم يزل رشيد رضا في السابعة عشرة من عمره، فكانت جريدة "العروة الوثقى" التي يصدرها الأفغاني وعبده من أوائل من حرك همه إلى السياسة وشؤون المسلمين، ثم التقى بمحمد عبده وصار رفيقه، ورغم انصراف محمد عبده إلى شأن التربية والتعليم والإصلاح بعد رجوعه إلى مصر دون اشتباك بشأن السياسة إلا أن مجلة المنار -التي صدرت قبل سبع سنوات من وفاة محمد عبده، واستمرت سبعة وثلاثين عاما حتى وفاة رشيد رضا- هي وثيقة تاريخية حافلة بالهم السياسي الواسع لرشيد رضا، والمتابعة الوافرة لشؤون المسلمين عبر العالم.</p>
                    <p>إلا أن شأنه لم يكن فقط الكتابة، فلقد شارك في المؤتمرين الإسلاميين المنعقدين في مكة (1926م) والقدس (1931م)، ولعب دورا في كفاح سوريا السياسي، فقد كان في حزب اللامركزية قبل 1914، وفي المفاوضات التي جرت أثناء الحرب مع البريطانيين، ورأس المؤتمر السوري (1920م)، وكان عضوا بالوفد السوري الفلسطيني إلى جنيف (1921م)، وفي اللجنة السياسية في القاهرة عند وقوع الثورة السورية عامي 1925و 1926م. ولهذا النشاط السياسي وضعنا رشيد رضا ضمن زعماء التغيير في دراستنا هذه، مع أن الشيخ الغزالي لم يتناول إلا الجانب المشتهر منه، وهو الجانب العلمي الفكري، وهو كثيرا ما يتناوله ضمن موقعه من مدرسة الأفغاني ومحمد عبده.</p>
                    <p>ولقد بلغ تقدير الغزالي لرشيد رضا أن يسبغ عليه وعلى مدرسته هذا الوصف الكبير، يقول: "كان محمد رشيد رضا ترجمان القرآن وشارة السلفية الصحيحة والمفتي العارف بأهداف الإسلام والمستوعب لآثاره"، وإن "مدرسة المنار هي المهاد الأوحد للصحوة الإسلامية الحاضرة، وعلى الذين يرفعون القواعد من هذا المهاد أن يتجنبوا بعض الهنات التي فات فيها الصواب إمامنا الكبير، فما نزعم عصمة له أو لغيره"</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => 'ما هو "العروة الوثقى"؟',
                    "pilihan" => [
                        "الصحف",
                        "الكتاب",
                        "المكان",
                        "المسجد",
                    ],
                    "jawaban" => "الصحف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'من شارك في عديد من المؤتمرين الإسلاميين؟',
                    "pilihan" => [
                        "محمد عبده",
                        "الأفغاني",
                        "رشيد رضا",
                        "محمد جنيد",
                    ],
                    "jawaban" => "رشيد رضا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'من قام بتصدير "العروة الوثقى"؟',
                    "pilihan" => [
                        "محمد عبده",
                        "الأفغاني",
                        "رشيد رضا",
                        "محمد جنيد",
                    ],
                    "jawaban" => "رشيد رضا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'لماذا دخل رشيد رضا في السياسة وشؤون المسلمين؟',
                    "pilihan" => [
                        "لأنه سيساعد المسلمين",
                        "لأنه لم يتمكن على التربية",
                        "لأنه سيصلح السياسة في بلاده",
                        "لأن يعرف السياسة ",
                    ],
                    "jawaban" => "لأنه سيصلح السياسة في بلاده",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => 'متى قام رشيد رضا برأس المؤتمر السوري؟',
                    "pilihan" => [
                        "١٩١٦",
                        "١٩٢١",
                        "١٩٢٠",
                        "١٩٢٥",
                    ],
                    "jawaban" => "١٩٢٠",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => 'أين تقع مدرسة المنار؟',
                    "pilihan" => [
                        "الجزيرة",
                        "مصر",
                        "بريطانيا",
                        "الهولند",
                    ],
                    "jawaban" => "مصر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'هل الغزالي يتفق برشيد رضا؟',
                    "pilihan" => [
                        "لا، ليس يتفق معه",
                        "نعم، لا يتفق معه",
                        "لا، ما اتفق به",
                        "نعم، يتفق معه",
                    ],
                    "jawaban" => "نعم، يتفق معه",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>من الأخلاق الكثيرة التي تميّز بها نبيّ الله محمّد عليه الصّلاة والسّلام خلق التّسامح بكلّ ما يتضمّنه من معاني العفو، والصّفح، والغفران، فلم يَعرف النّبي الكريم الحقد، ولم تتسلّل إلى قلبه رغبات الانتقام ممّن يسيء إليه، ولم يفكّر يوماً في مقابلة الإساءة بالإساءة، على الرّغم من الأذى الشّديد، والصدّ الكبير الذي تعرّض له من قبل قومه في بداية دعوته؛ بل كان مثالاً في العفو عمّن ظلمه وأساء إليه ابتغاء رضوان الله تعالى وجنّته، متمثلاً قوله تعالى: (ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيم ) [فصلت:34]، وراجياً من وراء عفوه وتسامحه أن يخرج الله من أصلاب من أساء إليه من يعبد الله ولا يُشرك به شيئاً.</p>
                    <p>قصّة النّبي مع الرّجل الذي أراد قتله؛ فقد روى جابر بن عبد الله قصّةً تدلّ على تسامح النّبي عليه الصّلاة والسّلام، ففي غزوة الرّقاع استراح النبي الكريم تحت شجرةٍ بعد أن علّق سيفه عليها، فاستغلّ رجلٌ من المشركين ذلك فباغت النّبي وأخذ سيفه على حين غرّة، ثمّ رفعه في وجه النّبي وهو يقول، أتخافني، فقال النّبي: لا، فقال الرّجل: "فمن يمنعك مني"، قال: الله، فسقط السّيف من يد الرّجل فأخذه النّبي الكريم ورفعه في وجه الرّجل وهو يقول من يمنعني منك، فقال الرّجل، كن خير آخذ، فلم يَفعل النّبي الكريم معه شيئاً وعفى عنه بعد أن تعهّد بأن لا يُقاتل المسلمين أو يقف مع قوم يقاتلونهم، فجاء قومه وهو يقول: (جئتكم من عند خير النّاس).</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => 'المرادف من كلمة "الحقد"؟',
                    "pilihan" => [
                        "الحسود",
                        "الجريمة",
                        "الشر",
                        "الاستقامة",
                    ],
                    "jawaban" => "الحسود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => 'المفرد من كلمة "رضوان" ؟',
                    "pilihan" => [
                        "راض",
                        "ريضى",
                        "رضى",
                        "رضا",
                    ],
                    "jawaban" => "رضا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'من هو "جابر بن عبد الله"؟',
                    "pilihan" => [
                        "التابعين",
                        "تابع التابعين",
                        "الصحابة",
                        "آل النبي",
                    ],
                    "jawaban" => "الصحابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'لماذا أراد الرجل أن يقتل النبي؟',
                    "pilihan" => [
                        "لأنه مرض",
                        "لأنه أخذ سيفه",
                        "لأنه يكرهه",
                        "لأنه خاف منه",
                    ],
                    "jawaban" => "لأنه يكرهه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => 'لماذا لا يخاف النبي من الرجل؟',
                    "pilihan" => [
                        "لأن النبي يخاف الله",
                        "لأن النبي ينظر الله",
                        "لأن النبي يفهم الله",
                        "لأن النبي خليل الله",
                    ],
                    "jawaban" => "لأن النبي يخاف الله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'في أي غزوة حدثت هذه الواقعة؟',
                    "pilihan" => [
                        "غزوة البدر",
                        "غزوة الأحد",
                        "غزوة الرقاع",
                        "غزة الحنين",
                    ],
                    "jawaban" => "غزوة الرقاع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'هل قتل النبي الرجل الذي أراد قتله؟',
                    "pilihan" => [
                        "نعم، قتله النبي",
                        "نعم، لم يقتله النبي",
                        "لا، يقبل النبي قتله",
                        "لا، ما قتله النبي",
                    ],
                    "jawaban" => "لا، ما قتله النبي",
                ]
            ],
            
        ];

        return $data;
    }



}
/* End of file Soal_model.php */
