<?php

defined('BASEPATH') OR exit('No direct script access allowed');

class Soal_model extends CI_Model {
    public function get_soal_istimav1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>إختبار اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>
                "
            ],
            [
                "tipe" => "audio",
                "data" => "v1 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الإثنين",
                        "بالحافلة",
                        "نعم هو يذهب إلى الجامعة",
                        "لأنه طالب مجتهد",
                    ],
                    "jawaban" => "بالحافلة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "سأكون مدرسا",
                        "نعم ، أخي تاجر",
                        "لا هو تاجر",
                        "أبي طبيب",
                    ],
                    "jawaban" => "سأكون مدرسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "هذا دكتور إبراهيم",
                        "نعم هو محاضر",
                        "في الأسبوع القادم",
                        "نعم، في الجامعة",
                    ],
                    "jawaban" => "في الأسبوع القادم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "الممرض",
                        "الطبيب",
                        "الشرطى",
                        "الفلاح",
                    ],
                    "jawaban" => "الفلاح"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "معاني القرآن الكريم",
                        "سور القرآن الكريم",
                        "أسماء القرآن الكريم",
                        "إعجاز القرآن",
                    ],
                    "jawaban" => "معاني القرآن الكريم"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "لا يتناول الغداء",
                        "يتناول العشاء",
                        "لا يتناول الفطور",
                        "يتناول الفطور",
                    ],
                    "jawaban" => "لا يتناول الفطور"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "وصل المسافرون المطار و لم تصل الطائرة",
                        "وصلت الطائرة و يصل المسافرون",
                        "وصل المسافرون المطار بعد مغادرة الطائرة",
                        "ركب المسافرون الطائرة و غادروا المطار",
                    ],
                    "jawaban" => "وصل المسافرون المطار بعد مغادرة الطائرة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "مكارم الأخلاق",
                        "الأخلاق",
                        "غرض البعث",
                        "الرسول",
                    ],
                    "jawaban" => "غرض البعث"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "بدأ الإمتحان في السابعة و النصف",
                        "بدأ الإمتحان في الثامنة و النصف",
                        "بدأ الإمتحان في التاسعة تماما",
                        "بدأ الإمتحان في السابعة إلا النصف",
                    ],
                    "jawaban" => "بدأ الإمتحان في السابعة و النصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "الشبكة الدولية",
                        "السفن",
                        "الطائرات",
                        "الحافلة",
                    ],
                    "jawaban" => "الشبكة الدولية"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "النظافة",
                        "النوم مبكرا",
                        "الوضوء",
                        "الاغتسال بعد النوم",
                    ],
                    "jawaban" => "النظافة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "لأن القرد نظر إليهم",
                        "لأن القرد في رقبته سلسلة",
                        "لأن القرد كان يرقص",
                        "لأن القرد أخذ العصا",
                    ],
                    "jawaban" => "لأن القرد كان يرقص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "أن الله يحبّ المؤمن الضعيف أكثر من القويّ",
                        "أن الله يحبّ المؤمن القوي أكثر من الضعيف",
                        "المؤمن الضعيف مثل المؤمن القويّ",
                        "أن الله يحبّ المؤمن",
                    ],
                    "jawaban" => "أن الله يحبّ المؤمن القوي أكثر من الضعيف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "مريض",
                        "ممرض",
                        "صيدلي",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طالب",
                        "دكتور",
                        "مريض",
                    ],
                    "jawaban" => "دكتور"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "طلب مبلغا كبيرا من المال",
                        "لم يشتر الحاسوب",
                        "عنده مبلغ كبير",
                    ],
                    "jawaban" => "لم يشتر الحاسوب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "الطعام مفيد",
                        "العملُ مهمٌّ",
                        "المالُ فيه خير",
                        "اتّباع بالأنبياء مهم",
                    ],
                    "jawaban" => "العملُ مهمٌّ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "ليلة التي خير من ألف شهر",
                        "شهر رمضان",
                        "نزول القران",
                        "ليلة القدر",
                    ],
                    "jawaban" => "شهر رمضان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "الحادية عشرة",
                        "الحادية عشرة والنصف",
                        "الثانية عشرة والنصف",
                        "الثانية عشرة إلا النصف",
                    ],
                    "jawaban" => "الثانية عشرة والنصف"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "خمسين مسافرا",
                        "ستين مسافرا",
                        "خمسة و عشرين مسافرا",
                        "عشرين مسافرا",
                    ],
                    "jawaban" => "خمسين مسافرا"
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v1 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "الطلاب سوف يواجهون الامتحان",
                        "نصيحة المدرس لطلابه قبل الامتحان",
                        "الطلاب يدرسون بجهد",
                        "المدرس سوف يواجه الامتحان",
                    ],
                    "jawaban" => "نصيحة المدرس لطلابه قبل الامتحان"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "السادسة",
                        "الثامنة",
                        "التاّسعة",
                        "السابعة",
                    ],
                    "jawaban" => "السابعة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "المدينة المنوّرة",
                        "جدّة",
                        "مكّة المكرمة",
                        "المنزل",
                    ],
                    "jawaban" => "مكّة المكرمة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "عبد الرحمن و أبوه",
                        "أبو عبد الرحمن",
                        "عبد الرحمن",
                        "أم عبد الرّحمن",
                    ],
                    "jawaban" => "أبو عبد الرحمن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في مكان الاستئجار",
                        "في جاكرتا",
                        "في البيت",
                    ],
                    "jawaban" => "في مكان الاستئجار"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم أربعين، استمع إلى الحوارات ثم اختر أنسب جواب بعد كل تعبير :</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak2.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "يعمل الآن طبيبا",
                        "يعمل مهندسا",
                        "لا يعمل",
                        "يعمل مدرسا",
                    ],
                    "jawaban" => "لا يعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "أربع و عشرون سنةً",
                        "ستة وعشرون سنةً",
                        "خمس	و عشرون سنةً",
                        "سبعة و عشرون سنةً",
                    ],
                    "jawaban" => "ستة وعشرون سنةً"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "في السوق",
                        "في المطعم",
                        "في الفصل",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المكتبة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "دول الشرق",
                        "دول الشرق الأوسط",
                        "الدول النامية",
                        "الدول الغربية",
                    ],
                    "jawaban" => "الدول النامية"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة الثامنة",
                        "في الساعة السابعة",
                        "في الساعة التاسعة",
                    ],
                    "jawaban" => "في الساعة الثامنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في السوق",
                        "في المستشفى",
                    ],
                    "jawaban" => "في المطعم"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مريض",
                        "يصلي الصبح",
                        "لا يعرف الملعب الرياضي",
                        "سيزور أحد أصدقائه",
                    ],
                    "jawaban" => "سيزور أحد أصدقائه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاث سنوات",
                        "خمس سنوات",
                        "سنتين",
                        "أربع  سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم أربعة وثلاثين  إلى سبعة وثلاثين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak3.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "عمل أبيه",
                        "عمل أخيه",
                        "عمل جده",
                        "اختيار المهنة",
                    ],
                    "jawaban" => "اختيار المهنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "طبيب",
                        "طياّر",
                        "مهندس",
                        "مدرّس",
                    ],
                    "jawaban" => "طبيب"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "مهندسا",
                        "مدرّسا",
                        "طياّرا",
                        "طبيبا",
                    ],
                    "jawaban" => "مدرّسا"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "الطّبّ",
                        "التّعليم",
                        "الطّيران",
                        "الهندسة",
                    ],
                    "jawaban" => "الطّيران"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ثمانية وثلاثين  إلى اثنين وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak4.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "رجل وزوجته",
                        "امرأة وابنتها",
                        "أمّ وابنتها",
                        "امرأة وأختها",
                    ],
                    "jawaban" => "أمّ وابنتها"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "وضع الماء في اللبن",
                        "وضع اللبن في الماء",
                        "بيع اللبن في السوق",
                        "بيع اللبن في بيت عمر",
                    ],
                    "jawaban" => "وضع الماء في اللبن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "الله",
                        "الابنة",
                        "الأمّ",
                        "الأخت",
                    ],
                    "jawaban" => "الابنة"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "زوج المرأة",
                        "الأب",
                        "عمر",
                        "الله",
                    ],
                    "jawaban" => "عمر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة",
                        "الأمّ",
                        "عمر",
                        "لا أحد",
                    ],
                    "jawaban" => "لا أحد"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center> للإجابة عن الأسئلة من رقم ثلاثة وأربعين إلى خمسة وأربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "حياة الناس",
                        "فوائد السفر",
                        "بلاد العالم",
                        "السفارة",
                    ],
                    "jawaban" => "فوائد السفر"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "أربع قارات",
                        "ست قارات",
                        "خمس قارات",
                        "قارات كثيرة",
                    ],
                    "jawaban" => "خمس قارات"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "السفر",
                        "الأمم الأخرى",
                        "الإستماع",
                        "القراءة",
                    ],
                    "jawaban" => "السفر"
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين  إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيار المتعدد المتاح  بعده:</center></p>",
            ],
            [
                "tipe" => "audio",
                "data" => "v1 istimak6.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في لندن",
                        "في بلده",
                        "في الطائرة",
                    ],
                    "jawaban" => "في لندن"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "هو في استقبال صديقه",
                        "ليذهب إلى المستشفى",
                        "للعمل",
                        "للتَنَزُّه",
                    ],
                    "jawaban" => "للعمل"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "هو مشغول في المكتب",
                        "هو لا يريد السفر",
                        "ستتأخر طائرته",
                        "هو مريض",
                    ],
                    "jawaban" => "ستتأخر طائرته"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "للسفر إلى لندن",
                        "لاستقبال صديقه",
                        "ليأخذ تذكرة الطائرة",
                        "لطلب العمل",
                    ],
                    "jawaban" => "لاستقبال صديقه"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "صباح الغد",
                        "مساء اليوم",
                        "بعد الظهر",
                        "هذه الليلة",
                    ],
                    "jawaban" => "صباح الغد"
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'اشترى أحمد سبعة ...',
                    "pilihan" => [
                        "كتبٍ",
                        "كتابا",
                        "كتابٍ",
                        "كتابٌ"
                    ],
                    "jawaban" => "كتبٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'الإتحاد أساس النجاح. الإتحاد في هذه الجملة تكون ؟',
                    "pilihan" => [
                        "فاعل",
                        "نائب الفاعل",
                        "مبتدأ",
                        "خبر"
                    ],
                    "jawaban" => "مبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'نشأت اللغة العربية في جزيرة العرب قبل الإسلام.إعراب  "الإسلام" في هذه الجملة؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "مجرور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كان في المدرسة أستاذ مَشْهُوْرٌ. اسم كان في هذه الجملة ؟',
                    "pilihan" => [
                        "كان",
                        "في المدرسة",
                        "المدرس",
                        "أستاذ"
                    ],
                    "jawaban" => "أستاذ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'لا شكّ أن اللغة العربية ..... في ديننا للمسلمين والمسلمات.',
                    "pilihan" => [
                        "لغةً مهمةً",
                        "لغةٍ مهمةٍ",
                        "لغةَ مهمةٍ",
                        "لغةٌ مهمةٌ"
                    ],
                    "jawaban" => "لغةٌ مهمةٌ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني ........؟',
                    "pilihan" => [
                        "جديدا",
                        "جديدٍ",
                        "جديدةً",
                        "جديدةٍ"
                    ],
                    "jawaban" => "جديدةً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => '........ مشكلة الأفراد في مواجهة الحياة',
                    "pilihan" => [
                        "تختلف",
                        "يختلف",
                        "أختلف",
                        "نختلف"
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'صاد الرجل الأسماك الكثيرة هذه الليلة. کلمة <b>الكثيرة</b> فی الجملة السابقة؟',
                    "pilihan" => [
                        "مضاف إلیه",
                        "مفعول",
                        "توكيد",
                        "نعت"
                    ],
                    "jawaban" => "نعت"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'لا أصدق بما قاله عدنان عن هذا الخبر. "ما" فی الجملة السابقة؟',
                    "pilihan" => [
                        "تعجبیة",
                        "موصولة",
                        "استفهامیة",
                        "نافیة"
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'قال تعالی: (قال رب إنی وهن العظم منی و اشتعل الرأس شیبا. کلمة (شیبا) ؟',
                    "pilihan" => [
                        "منصوب",
                        "مرفوع",
                        "مجرور",
                        "مجزوم"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'قال تعالی: ( إن الإنسان خلق هلوعا. کلمة (هلوعا) هي؟',
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "اسم إن",
                        "تمییز"
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'مرحلة الشباب أهم <u>مرحلة</u> في حياة الإنسان، وأغلى <u>ثروة</u> عند الأمة. ما الإعراب من كلمة التي تحتها خط؟',
                    "pilihan" => [
                        "مرفوع",
                        "منصوب",
                        "مجزوم",
                        "مجرور"
                    ],
                    "jawaban" => "منصوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'بین هذه الجمل جملة صحیحة هي؟',
                    "pilihan" => [
                        "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاول فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولتا فاطمة أن تنهي كتابة الرسالة هذه السنة",
                        "حاولت فاطمة أن ينهي كتابة الرسالة هذه السنة"
                    ],
                    "jawaban" => "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'الموظفان يعملان في شريكة الطباعة معا. الموظفان في هذه الجملة؟',
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "مبتدأ مرفوع بالنون",
                        "خبر مرفوع بالألف",
                        "خبر مرفوع  بالنون"
                    ],
                    "jawaban" => "مبتدأ مرفوع بالألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'قال: <u>لا تُظلمْ</u> الناس فتندم. الكلمة التي تحتها خط هي؟',
                    "pilihan" => [
                        "فعل ماض",
                        "فعل الأمر",
                        "الفعل الناهي",
                        "اسم فعل"
                    ],
                    "jawaban" => "الفعل الناهي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'هذه الجامعة مناسبة لمن يريدون أن يعمقوا علوما طبية. كلمة مناسبة؟',
                    "pilihan" => [
                        "خبر",
                        "مبتدأ",
                        "نعت",
                        "موصوف"
                    ],
                    "jawaban" => "خبر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => '...... الأم الدجاجة المشوية في الصباح لأنني أحب بهذا الطبخ. ',
                    "pilihan" => [
                        "طبخت",
                        "طبخ",
                        "طبختا",
                        "طبخوا"
                    ],
                    "jawaban" => "طبخت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'الجد والجدة  ..... في سعادة مع أولادهما و أحفادهما. ',
                    "pilihan" => [
                        "يعيشان",
                        "يعيش",
                        "تعيش ",
                        "تعيشان "
                    ],
                    "jawaban" => "يعيشان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => '...... الأساتيذ الطلاب والطالبات أن يراجعوا الدروس لمقابلة الاختبار الآخر في هذه المدرسة. ',
                    "pilihan" => [
                        "يأمرون",
                        "يأمر",
                        "تأمرون",
                        "تأمر"
                    ],
                    "jawaban" => "يأمر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كثير من الناس ......  بذكري مولدي النبي صلى الله عليه وسلم ',
                    "pilihan" => [
                        "يفكرون",
                        "يسمعون",
                        "ينظرون",
                        "يحتفلون"
                    ],
                    "jawaban" => "يحتفلون"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'يريد صالح أن يذهب إلى مصر في الأسبوع القادم.  القادم في هذه الجملة تعني؟ ',
                    "pilihan" => [
                        "الماضي",
                        "الآتي",
                        "أمس",
                        "الآن"
                    ],
                    "jawaban" => "الآتي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'صبح لاعب كرة القدم مشهورا بسبب صناعة هدف ......',
                    "pilihan" => [
                        "رائعٍ",
                        "رائعٌ",
                        "رائعاً",
                        "رائعين"
                    ],
                    "jawaban" => "رائعٍ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'أن تحفظ العالم – يجب علينا – حولنا – مهم لحياة الناس – لأن حفظ العالم. ',
                    "pilihan" => [
                        "يجب علينا حولنا أن نحفظ العالم لأن حفظ العالم مهم لحياة الناس",
                        "أن نحفظ العالم حولنا مهم لحياة الناس لأن حفظ العالم يجب علينا",
                        "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                        "مهم لحياة الناس أن نحفظ العالم لأن حفظ العالم حولنا يجب علينا"
                    ],
                    "jawaban" => "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => ' ليست – الشهادة – الدراسة – لنيل– أغراض – إن- فحسب <br>الترتيب الصحيح مِن الكَلِماتِ السَابِقَةِ هُوَ.......',
                    "pilihan" => [
                        "ليست لنيل الشهادة إن أغراض الدراسة فحسب",
                        "إن فحسب أغراض الدراسة ليست لنيل الشهادة",
                        "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                        "إن أغراض الدراسة لنيل الشهادة ليست فحسب "
                    ],
                    "jawaban" => "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'تجتهد – إن – في الإمتحان – تنجح  <br>الترتيب الصحيح من الكلمات السابقة هو....... ',
                    "pilihan" => [
                        "تجتهد في الامتحان إن تنجح ",
                        "إن  تنجح تجتهد في الامتحان",
                        "إن تجتهد تنجح في الامتحان",
                        "إن تنجح  في الإمتحان تجتهد"
                    ],
                    "jawaban" => "إن تجتهد تنجح في الامتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => ' يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. أين نائب الفاعل في هذه العبارة؟',
                    "pilihan" => [
                        "تقدم الدول",
                        "بالنظافة",
                        "اليوم",
                        "وسكانها"
                    ],
                    "jawaban" => "تقدم الدول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'لن ترجع الأيام التي مضت. ترجع في هذه الجملة؟',
                    "pilihan" => [
                        "منصوب بالفتحة",
                        "منصوب بالألف",
                        "منصوب بالكسرة",
                        "منصوب بحذف حرف العلة"
                    ],
                    "jawaban" => "منصوب بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => 'الموضوع الذي قدمه الدكتور في هذه المحاضرة <u>مناسب</u> بحال الناس في هذا العصر. الكلمة التي تحتها خط تعني؟',
                    "pilihan" => [
                        "متجانس",
                        "لائق",
                        "مفيد",
                        "منخفض"
                    ],
                    "jawaban" => "لائق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => ' لا يوافق أكثر الحاضرين برأي رئيس القرية عن أمور مجيئ الضيوم من خارج البلاد لاحتفال يوم استقلال اندونيسي. هذه العبارة تعني؟',
                    "pilihan" => [
                        "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                        "يوجد بعض الضيوم من خارج البلاد  في يوم الاستقلال",
                        "لا يوجد يوم الاستقلال "
                    ],
                    "jawaban" => "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>اقترح</u> أحد السكان في هذه القرية لصناعة الجسر بين قريتين لتسهيل المرور بينهما. ماذا نقصد  الكلمة التي تحتها خد؟',
                    "pilihan" => [
                        "قدم رأيا",
                        "قدم جسرا",
                        "قدم مالا",
                        "قدم سكان "
                    ],
                    "jawaban" => "قدم رأيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => '<u>كانوا</u> الإنسان <u>في</u> هذا العصر <u>لا يهتمون</u> <u>بالتربية</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "كانوا",
                        "في",
                        "لا يهتمون",
                        "بالتربية"
                    ],
                    "jawaban" => "كانوا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => '<u>يبني</u> <u>المهندس</u> <u>هذا البناء</u> العالي بعشرة <u>يوم</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يبني",
                        "هذا البناء",
                        "يوم",
                        "المهندس"
                    ],
                    "jawaban" => "يوم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => '<u>تفحص</u> الطبيبة <u>المريض</u> في <u>هذه</u> المستشفي  <u>بكل فرح</u> وسرور. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "تفحص",
                        "المريض",
                        "هذه",
                        "بكل فرح"
                    ],
                    "jawaban" => "هذه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => '<u>كان</u> المدافع في هذه المباراة <u>يرفسون</u> الكرة بشدة حتى <u>يحصل</u> على <u>الهدف</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟ ',
                    "pilihan" => [
                        "كان",
                        "يرفسون",
                        "يحصل",
                        "الهدف"
                    ],
                    "jawaban" => "يرفسون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => '<u>يزور</u> الطلاب والطالبات <u>المتاحف</u> <u>المتنوعة</u> لزيادة <u>المعلوماتُ</u> .  ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "يزور",
                        "المتاحف",
                        "المتنوعة",
                        "المعلوماتُ"
                    ],
                    "jawaban" => "المعلوماتُ"
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => '<u>يستمعون</u> <u>الطلاب</u> محاضرة عميد <u>الجامعة</u> في الجامعة <u>الإسلامية</u>. ما هي الكلمة الخاطئة من هذه الجملة؟',
                    "pilihan" => [
                        "يستمعون",
                        "الطلاب",
                        "الجامعة",
                        "الإسلامية"
                    ],
                    "jawaban" => "يستمعون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => '<u>مشكلة الأسرة</u> <u>يؤدي</u> إلى نجاح <u>أولادهم</u> في <u>المدرسة</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                    "pilihan" => [
                        "مشكلة الأسرة",
                        "يؤدي",
                        "أولادهم",
                        "المدرسة"
                    ],
                    "jawaban" => "يؤدي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرت هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحروا هذا الرجل في علم النحو والصرف والبلاغة",
                        "تبحرا هذا الرجل في علم النحو والصرف والبلاغة"
                    ],
                    "jawaban" => "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "ليس للمسلمين عدوٌّ ",
                        "ليس للمسلمين عدوًّا",
                        "ليس للمسلمين عدوٍّ",
                        "ليس للمسلمين عدوين"
                    ],
                    "jawaban" => "ليس للمسلمين عدوٌّ ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                    "pilihan" => [
                        "الطلاب لم يرموا الزبالة في أي مكان",
                        "الطلاب لم يرمون الزبالة في أي مكان",
                        "الطلاب لم يرم الزبالة في أي مكان",
                        "الطلاب لم يرمي الزبالة في أي مكان"
                    ],
                    "jawaban" => "الطلاب لم يرموا الزبالة في أي مكان",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv1(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>القسم الثالث: فهم المقروء</center></p>
                    <p>نشأت اللغة العربية في جزيرة العرب قبل الإسلام، وكان العرب قبائل متفرقة، وكانت لبعض القبائل لهجات خاصة بها. وكانت الاختلافات قليلة بين تلك اللهجات. وكانت للعرب لغة مشتركة، هي اللغة العربية الفصيحة، لغة الشعر والخطابة، التي كان العرب يتحدثون بها. ثم جاء الإسلام، وأنزل الله القرآن الكريم، باللغة العربية الفصيحة. قال الله تعالى: (إنا أنزلناه قرآنًا عربيا لعلكم تعقلون).</p>
                    <p>أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة، وجاء بأساليب جديدة، لم تعرفها العربية من قبل. وكان القرآن سببًا في نشأة علوم اللغة العربية؛ كالنحو والصرف، والبلاغة، والعلوم الإسلامية، كعلم التفسير والحديث والفقه وغيرها.</p>
                    <p>أثرت اللغة العربية في لغات الشعوب الإسلامية، كالفارسية والأردية والسواحلية، فأقرضتها كثيرًا من الألفاظ، وكتب كثير من تلك اللغات بالحرف العربي. واقترضت لغات أخرى بعض الألفاظ العربية، مثل: الإنجليزية والفرنسية والإسبانية.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'عما تتحدث الفقرة السابقة؟',
                    "pilihan" => [
                        "اللغة العربية ",
                        "اللغة العربية الفصيحة وآثرها",
                        "الجزيرة العربية ",
                        "الدولة العربية ",
                    ],
                    "jawaban" => "اللغة العربية الفصيحة وآثرها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'ما المرادف من كلمة "نَشَأَتْ " من تلك الفقرة ؟',
                    "pilihan" => [
                        "صارت",
                        "ارتقت",
                        "كبرت",
                        "أصبحت",
                    ],
                    "jawaban" => "ارتقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'متي نشأت اللغة العربية ؟',
                    "pilihan" => [
                        "بعد الاسلام ",
                        "قبل الاسملام ",
                        "في عصر الخلافة ",
                        "في عصر الحديث ",
                    ],
                    "jawaban" => "قبل الاسملام ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'كل هذه العبارة مخطيئة. إلا ؟',
                    "pilihan" => [
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الجديدة معاني جديدة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني صحيحة",
                        "أعطى القرآن الكريم بعض الألفاظ العربية الصحيحة معاني جديدة",
                    ],
                    "jawaban" => "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => 'ما سبب نشأة علوم اللغة العربية ؟',
                    "pilihan" => [
                        "الحديث ",
                        "الفقه",
                        "القرآن",
                        "الشعب ",
                    ],
                    "jawaban" => "القرآن",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>یا محمد ابعث  لی هذه الرسالة بالبرید الإلکترونی إلی الحج یوسف فی کوالالمبور، واکتب له أن یحضر إلینا هنا فی الریاض بعد رمضان مباشرة.  حتی ندخل الشبکة الدولیة إلی مکتبنا فی اليبان کما فعلنا فی مکتبنا فی کوریا.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => 'أین یوسف الآن؟',
                    "pilihan" => [
                        "فی کوریا",
                        "فی مالیزیا",
                        "فی الیابان",
                        "فی الریاض",
                    ],
                    "jawaban" => "فی مالیزیا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => 'متی سیحضر یوسف إلی الریاض؟',
                    "pilihan" => [
                        "‌فی رمضان",
                        "‌فی شعبان",
                        "‌فی شوال",
                        "‌قبل رمضان",
                    ],
                    "jawaban" => "‌فی شوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => 'ما المرادف من كلمة "المكتب" في تلك الفقرة؟',
                    "pilihan" => [
                        "‌المكتبة",
                        "‌المدرسة",
                        "‌الديوان",
                        "‌الفصل",
                    ],
                    "jawaban" => "‌الديوان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبحت مشكلة زيادة السكان من أهم المشكلات التى تعانى منها معظم دول العالم، وقد اتجهت معظم هذه الدول إلى تحديد النسل، فالصين-ألف مليون نسمة – قد حددت النسل طفلا للأسرة الواحدة وما زاد عن ذلك فهناك عقاب صارم للأبوين، ولكن الشعب الصينى مطيع للأوامر ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء، وقد جعلت هذه المشكلة مشكلات اقتصادية واجتماعية كثيرة.</p>
                ",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => 'الفكرة الرئيسة للفقرة السابقة هى :',
                    "pilihan" => [
                        "عدد سكان الصين ألف مليون نسمة.",
                        "تحديد النسل يكون عن طريق تحديد طفل واحد للأسرة.",
                        "زيادة السكان من أهم مشكلات معظم دول العالم.",
                        "القانون يعاقب من لايطيع قانون تحديد النسل.",
                    ],
                    "jawaban" => "زيادة السكان من أهم مشكلات معظم دول العالم.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => 'كيف حددت الصين النسل :',
                    "pilihan" => [
                        "طفل واحد لكل أسرة.",
                        "طفلين للأسرة.",
                        "طفلين للأسرتين.",
                        "ثلاثة أطفال للأسرة.",
                    ],
                    "jawaban" => "طفل واحد لكل أسرة.",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => 'أدى تزايد السكان إلى :',
                    "pilihan" => [
                        "مشكلة اقتصادية",
                        "مشكلات اجتماعية",
                        "مشكلات سياسية",
                        "مشكلات اقتصادية واجتماعية",
                    ],
                    "jawaban" => "مشكلات اقتصادية واجتماعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => 'ولكن <u>الشعب</u> <u>الصينى</u> <u>مطيع</u> <u>للأوامر</u> ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء مشكلة اقتصادية. أين خبر لكنّ ؟',
                    "pilihan" => [
                        "للأوامر",
                        "الشعب",
                        "الصيني",
                        "مطيع",
                    ],
                    "jawaban" => "مطيع",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>مرحلة الشباب أهم مرحلة في حياة الإنسان، وأغلى ثروة عند الأمة. ومرحلة الشباب هي مرحلة العطاء والعمل. والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره. وكان كثير من أصحاب الرسول - صلى الله عليه وسلم - من الشباب، وقد ولاهم مسؤوليات كبيرة؛ حيث ولى كثيرا منهم قيادة الجيش، وفيه شيوخ المهاجرين والأنصار؛ فقد ولى زيد بن حارثة، وجعفر بن أبي طالب، وعبد الله بن أبي رواحة، قيادة الجيش في غزوة مؤتة، كما ولى أسامة بن زيد قيادة الجيش الإسلامي، لغزو الروم، وعمره ثماني عشرة سنة، وأرسل معاذ بن جبل قاضيا إلى اليمن، وهو في مرحلة الشباب.</p>
                    <p>تحتاج الأمة إلى الشاب القوي الجاد، الذي يعطي أكثر مما يأخذ، ولا تحتاج إلى الشاب الكسلان، الذي يهتم بطعامه ومظهره فقط، ولا يحب العمل والعطاء. وكما تحتاج الأمة إلى قوة الشباب، تحتاج إلى خبرة الشيوخ، حتى تتقدم البلاوتخطئ الأمة إذا اعتمدت على قوة الشباب وحدهم، وأهملت خبرات الشيوخ. وهذا يعني أن تكون هناك علاقة طيبة بين جميع أفراد المجتمع، كبارا وصغارا، رجالا ونساء، حتى تصل الأمة إلى ما تريد.</p>",
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الرجولة",
                        "حياة الشباب",
                        "الحياة البشرية المتعددة ",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => ' ما المضاد من الكلمة " الشباب " حسب النص ؟',
                    "pilihan" => [
                        "الرجال",
                        "الأولاد",
                        "الشابة",
                        "الشيوخ",
                    ],
                    "jawaban" => "الشيوخ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "مرحلة الشباب ليست من  أهم مرحلة في حياة الإنسان",
                        "مرحلة الشباب هي مرحلة التنزه ",
                        "لا تحتاج الأمة إلى الشاب القوي الجاد",
                        "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                    ],
                    "jawaban" => "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'ما المرادف من كلمة " الثروة" في النص ؟',
                    "pilihan" => [
                        "الغني ",
                        "الفقر",
                        "المال",
                        "النقود",
                    ],
                    "jawaban" => "الغني ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => 'ما هو الذي تحتاجه الأمة من الشباب ؟',
                    "pilihan" => [
                        "تحتاج الأمة إلى الشاب القوي الجاد",
                        "الأمة تحتاج إلي الشباب الغني بالمال",
                        "الامة تحتاج إلي الشباب الكسلان",
                        "الامة تحتاج الي الشباب الغضبان",
                    ],
                    "jawaban" => "تحتاج الأمة إلى الشاب القوي الجاد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => 'المرادف من كلمة "العطاء " في النص ؟',
                    "pilihan" => [
                        "البخيل",
                        "المتكبر",
                        "الإحسان",
                        "الكسلان",
                    ],
                    "jawaban" => "الإحسان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => 'ما معنى "المرحلة" في هذه الفقرة ؟',
                    "pilihan" => [
                        "المستوى",
                        "الجامعة",
                        "الترتيب",
                        "الفروق",
                    ],
                    "jawaban" => "المستوى",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>النظافة نوعان؛ نظافة خاصة، ونظافة عامة. فالنظافة الخاصة نظافة جسم الإنسان وثوبه وطعامه وبيئته. أما النظافة العامة، فنظافة الأماكن العامة، كالشوارع والحدائق. وتقع مسؤولية النظافة الخاصة على الأفراأما مسؤولية النظافة العامة، فتقع على الأفراد والحكومات.</p>
                    <p>يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. وهناك دول مشهورة في العالم بالنظافة، وهي قليلة مثل ماليزيا وسنغافورة. وهناك دول أخرى مشهورة بالقذارة، وهي كثيرة.</p>
                    <p>تنفق بعض الدول أموالا كثيرة على النظافة، ونشاهد - الآن - في كل مدينة عمال النظافة، يجوبون الشوارع، يحملون حاويات النظافة، ويضعونها في سارات خاصة، تحملها خارج المدينة؛ لتحرق. ويشارك المواطن الدولة الاهتمام بالنظافة، حيث يضع النفايات الخاصة ببيته، والتي يجدها في الشوارع والحدائق في الحاويات، وهذا ما دعا إليه الرسول - صلى الله عليه وسلم - في قوله: (إماطة الأذى عن الطريق صدقة).</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => 'كم نوعا من النظافة حسب النص ؟',
                    "pilihan" => [
                        "نظافة جسمية، ونظافة روحية ",
                        "نظافة غرفة، ونظافة بيت",
                        "نظافة خاصة، ونظافة خارجية",
                        "نظافة خاصة، ونظافة عامة",
                    ],
                    "jawaban" => "نظافة خاصة، ونظافة عامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                    "pilihan" => [
                        "نظافة البيئة",
                        "نظافة البيت",
                        "نظافة الجسم",
                        "نظافة الأمة ",
                    ],
                    "jawaban" => "نظافة الأمة ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ما المراد بالناظافة الخاصة ؟',
                    "pilihan" => [
                        "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                        "نظافة قلب الانسان و روحه",
                        "نظافة فكر الانسان و حركته ",
                        "نظافة طعام الانسان وشربه",
                    ],
                    "jawaban" => "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => 'ما هي الدولة المشهورة في العالم بالنظافة حسب النص ؟',
                    "pilihan" => [
                        "ماليزيا وسنغافورة",
                        "مصر و يمان ",
                        "ج.عراق و إيران",
                        "تركي و يابان ",
                    ],
                    "jawaban" => "ماليزيا وسنغافورة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => 'ما المراد بالدولة المتحضرة حسب النص ؟',
                    "pilihan" => [
                        "الدولة وسكانها يهتمون بالنظافة",
                        "الدولة وسكانها يهتمون بالتقدم",
                        "الدولة وسكانها يهتمون بالمال",
                        "الدولة وسكانها يهتمون بالتربية",
                    ],
                    "jawaban" => "الدولة وسكانها يهتمون بالنظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => 'ماالمرادف بكلمة " القذارة " في النص ؟',
                    "pilihan" => [
                        "النظافة",
                        "الحديثة",
                        "الجديدة",
                        "الوسخة ",
                    ],
                    "jawaban" => "الوسخة ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>قال الرسول صلّى الله عليه وسلم : بينما رجل يمشي بطريق، اشتدّ عليه العطش، فوجد بئرا، فنزل فيها، فشرب منها ثمّ خرج، فإذا هو بكلب يلهث (يأكل الثرى من العطش) فقال : لقد بلغ هذا الكلب من العطش مثل الذي بلغ بي. فنزل البئر فملأ خفّه ماء، ثمّ أمسكه بفيه، ثمّ رقى، فسقى الكلب، فشكر الله له، فغفر له.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'ما العنوان المناسب لهذا الحديث ؟',
                    "pilihan" => [
                        "الرجل العطشان",
                        "الرفق بالحيوان",
                        "الكلب العطشان",
                        "البئر فى الطريق",
                    ],
                    "jawaban" => "الرفق بالحيوان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ما المرادف من "يلهث" في هذه القراءة ؟',
                    "pilihan" => [
                        "ظمئ",
                        "سبع",
                        "حزن",
                        "بكا",
                    ],
                    "jawaban" => "ظمئ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>هناك اختلافات كثيرة، بين التعليم في الماضي، والتعليم في الحاضر. ومن تلك الاختلافات، أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون، هم - في الغالب - أبناء الأغنياء وسكان المدن. أما اليوم، فقد أصبح التعليم حقا لكل مواطن. فكثر عدد الطلاب، وانتشرت المدارس في كل مكان، وشاع القول: "التعليم كالماء والهواء".</p>
                    <p>كان طلاب العلم - في الماضي - يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب؛ فكانوا يركبون الجمال أياما وأشهرا. أما ليوم، فالمدارس والجامعات كثيرة، في كل مدينة وقرية تقريبا، حيث يذهب الطالب إلى مدرسته، أو جامعته بالسيارة، أو سيرا على الأقدام. ومن ناحية أخرى، يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية.</p>
                    <p>من الاختلافات أيضا، أن المعلم كان لا يطلب أجرا على عمله في الماضي؛ لأنه كان يطلب الأجر من الله. وكان هدف الطالب طلب العلم. أما اليوم، فقد اختلف الأمر، فالمعلم يطلب كثيرا من الأجر، والطالب يفكر في الشهادة قبل العلم؛ لأنها وسيلة إلى العمل.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => ' كل هذه العبارات غير الصحيحة. إلا ؟',
                    "pilihan" => [
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت كثيرة  في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في المستقبل، حيث كان يلتحق بالمدارس طلاب قليلون",
                        "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب كثيرون ",
                    ],
                    "jawaban" => "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => 'مالفرق بين التعليم في الماضي و التعليم في الحاضر حسب النص ؟',
                    "pilihan" => [
                        "التعليم في الحاضر  والتعليم في الماضي خاصة للأغنياء",
                        "التعليم في الحاضر للأغنياء والتعليم في الماضي لجميع الأفراد",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للمساكين",
                        "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                    ],
                    "jawaban" => "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => 'كيف كان الطلاب في الماضي حسب النص ؟',
                    "pilihan" => [
                        "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                        "يذهب الطالب إلى مدرسته، أو جامعته بالسيارة",
                        "يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية",
                        "كل العبارات صحيحة ",
                    ],
                    "jawaban" => "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => 'كيف كان المعلم في الماضي حسب النص ؟',
                    "pilihan" => [
                        "لا يطلب أجرا على عمله",
                        "يطلب أجرا على عمله ",
                        "يستخدمون الأدوات  المتحدثة في التعليم ",
                        "يعلم الطلاب عبر الشبكة الدولية",
                    ],
                    "jawaban" => "لا يطلب أجرا على عمله",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>العمل نعمة من نعم الله، ولا يعرف هذه النعمة، إلا من فقدها بسبب مرض، أو غيره. ومع ذلك فبعض النّاس لا يحبون العمل، ويعتمدون على غيرهم، أو يتسوّلون في الطريق. قال الرسول صلى الله عليه وسلم : ما أكل أحد طعاما قطّ خيرا من أن يأكل من عمل يده، وقال : لأن يأخذ أحدكم حبله، ثمّ يغدو إلى الجبل، فيحتطب، فيبيع، فيأكل، ويتصدّق خير له من أن يسأل النّاس.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => 'ما الفكرة الرئيسة في الفقرة السابقة ؟',
                    "pilihan" => [
                        "الناس لايعرف هذه النعمة",
                        "إنّ نبيّ الله داوود كان يأكل من عمل يده",
                        "بعض النّاس لا يحبون العمل",
                        "العمل خير في الحياة",
                    ],
                    "jawaban" => "العمل خير في الحياة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => 'الجملة المناسبة بالفقرة السابقة ؟',
                    "pilihan" => [
                        "ينبغي علينا أن نأكل مما كسبنا",
                        "ينبغي علينا أن نأكل ما أعطانا الجار",
                        "ينبغي علينا أن نأكل مما كسب الأب",
                        "ينبغي علينا أن نسأل الآخر",
                    ],
                    "jawaban" => "ينبغي علينا أن نأكل مما كسبنا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هناك خرافات تحدث دائما بين الآباء والأبناء. فالآباء ينظرون إلى الأبناء على أنهم كبار، وينسون فارقة السن بينهم، ويريدون من الأبناء أن يكونوا صورة ثانية منهم. والأبناء ينظرون إلى الأباء على أنهم من عصر قديم، وأنهم يفكرون تفكيرا متأخرا، ولايمكن أن يتفقوا معهم فى الرأى. وهذه هي أهم أسباب الخلاف. ولكن إذا نظر الأباء إلى أبنائهم نظرة أخرى ليفهموهم بطريقة أفضل، وإذا تذكروا كيف أنهم كانوا فى نفس هذا الموقف من آبائهم، لأدركوا أنهم يجب أن يغيروا معاملتهم لأبنائهم، ويكونوا أكثر صبرا وفهما. أما الأبناء فيجب أن يدركوا أن طاعة الوالدين من طاعة الله، أنهم فى كثير من الأحيان لايعرفون ماينفعهم وما يضرهم، وإذا أطاعوا أبويهم كان ذلك خيرا لهم وأفضل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => 'أفضل العنوان للفقرات السابقة :',
                    "pilihan" => [
                        "نظرة الآباء إلى الأبناء",
                        "نظرة الأبناء إلى الآباء",
                        "اختلاف الرأي بين الآباء والأبناء",
                        "تفكير الآباء المتأخر",
                    ],
                    "jawaban" => "اختلاف الرأي بين الآباء والأبناء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => 'خطأ الآباء فى نظرتهم للأبناء .......',
                    "pilihan" => [
                        "أنهم يأمرون أولادهم دائما بدون سبب",
                        "أنهم يحسبون جيدا فارقا لسن بينهم",
                        "أنهم ينظرون إلى الأبناء على أنهم كبار",
                        "أنهم لايحبون لأولادهم أن يكونوا مثلهم",
                    ],
                    "jawaban" => "أنهم ينظرون إلى الأبناء على أنهم كبار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => 'خطأ الأبناء فى نظرتهم الآباء ...........',
                    "pilihan" => [
                        "أنهم نالوا السهولة أن يتّفقوا معهم فى الرأي",
                        ". أن الآباء يفكرون تفكيرا متأخرا",
                        "أنّ الآباء يجب أن يكونوا أكثر صبرا",
                        "أن الآباء يتمنون لهم الخير",
                    ],
                    "jawaban" => ". أن الآباء يفكرون تفكيرا متأخرا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => 'التعبير المناسب من هذه القراءة ؟',
                    "pilihan" => [
                        "ينبغي على الأبناء أن يطيعوا آبائهم",
                        "ينبغي على الأبناء أن يرحوا آبائهم",
                        "ينبغي على الأبناء أن يستمعوا إلى آبائهم",
                        "ينبغي على الأبناء أن لا يطيعوا آبائهم",
                    ],
                    "jawaban" => "ينبغي على الأبناء أن يطيعوا آبائهم",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تأثّر العالم كثيرا – وخاصّة أوروبا – بحضارة المسلمين. وكان المسلمون في العصر العباسي، قد نشروا العلم والثقافة في مناطق واسعة، فقد وصلوا إلى الصين في الشّرق، وإلى بلاد السّودان في إفريقيا في الجانوب.</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'الفكرة الرئيسة في الفقرة السابقة تتحدّث عن ......',
                    "pilihan" => [
                        "انتشار الحضارة الإسلاميّة في العالم",
                        "انتشار الإسلام في العالم",
                        "انتشار العلم والثقافة في الصين",
                        "انتشار العلم والثقافة في أوروبا",
                    ],
                    "jawaban" => "انتشار الحضارة الإسلاميّة في العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => 'أين يقع بلاد السودان ؟',
                    "pilihan" => [
                        "في إفريقيا",
                        "في شرق الأوسط",
                        "في الدول الغربي",
                        "في آسيا",
                    ],
                    "jawaban" => "في إفريقيا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>فكّر صديقي <u>أن يترك</u> العمل في الحكومة، وأن يعمل<u> تاجرا</u>، وفعلا فتح محلا صغيرا، لبيع الملابس، وبدأ يعامل النّاس معاملة طيبة، يبيع لهم الملابس رخيصة، فاشتهر كثيرا بين النّاس. وبعد سنة ترك صديقي المحلّ الصّغير، وفتح محلا كبيرا في وسط المدينة، وبعد ثلاث سنوات أنشأ شركة كبيرة لصناعة الملابس. أصبح صديقي <u>من أغنياء المدينة</u>، وقد أحبّه النّاس كثيرا، فهو رجل كريم يساعد النّاس في بناء المساجد والمدارس والمستشفيات.</p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'كم سنة أنشأت تلك الشركة ؟',
                    "pilihan" => [
                        "سنة واحدة",
                        "ب.سنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => 'وصف الرجل في هذه الفقرة بأنه رجل ؟',
                    "pilihan" => [
                        "جميل",
                        "شريف",
                        "حكيم",
                        "لطيف",
                    ],
                    "jawaban" => "شريف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => '"من أغنياء المدينة " ؟',
                    "pilihan" => [
                        "اسم أصبح",
                        "خبر أصبح",
                        "مبتدأ مؤخر",
                        "بدل",
                    ],
                    "jawaban" => "خبر أصبح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'ما عمل هذا الرجل قبل أن يكون تاجرا؟',
                    "pilihan" => [
                        "الموظف الحكومي",
                        "الموظف الأهلي",
                        "رجال العمل",
                        "مهندس",
                    ],
                    "jawaban" => "الموظف الحكومي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>حسن طالب إندونسي يدرس في الجامعة الإسلامية بالمدينة المنورة سافر حسن إلى المدينة المنورة قبل ثلاث سنوات لتعليم اللغة العربية ويدرس الإسلام. يتحدث حسن العربية الآن جيدا، وقد بدأ حفظ القرآن في بلده، والآن يحفظه كله. أصبح حسن الآن يفهم أحاديث الرسول صلى الله عليه وسلم، ويقرأ الكتب العربية والمجلات الأسبوعية والصحف اليومية. بعد هذه السنوات الثلاث يستطيع حسن أن يكتب باللغة العربية. فقد كتب إلى أصدقائه وقال لهم: "إن اللغة العربية لغة سهلة، وهي لغة العبادة لأكثر من مليار من المسلمين ولغة القرآن والإسلام.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => 'حسن طالب مسلم من اندونيسيا، وهي تقع في قارة ؟',
                    "pilihan" => [
                        "آسيا",
                        "أفريقا",
                        "أوربا",
                        "أوستراليا",
                    ],
                    "jawaban" => "آسيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => ' يدرس حسن في المرحلة ؟',
                    "pilihan" => [
                        "المتوسطة",
                        "الثانوية",
                        "الجامعية",
                        "الإبتدائية",
                    ],
                    "jawaban" => "الجامعية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'متى حضر حسن الى المدينة المنورة؟',
                    "pilihan" => [
                        "قبل ثلاث سنوات",
                        "قبل أشهر",
                        "قبل سنتين",
                        "قبل أربع سنوات",
                    ],
                    "jawaban" => "قبل ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>تخرج زوجتي كل يوم في الصّباح، ولا ترجع إلا في السّاعة الخامسة مساءً، هذه مشكلتي معها. نحن نتناول الوجبات خارج البيت: لأنّ زوجتي لا تجد وقتاً لإعداد الطّعام، وأنا أغسل ملابسي وملابس أبنائنا وحدي، وأنظّف البيت أحياناً بعد التدريس ظهرا. لا أجد وقتا للحديث معها في أمور البيت والأسرة: لأنها عندما ترجع تكون متعبةً  .أمّا في عطلة الأسبوع، فهي تحبّ أن تزور الأهل والصّديقات، أو تذهب إلى السّوق، أو تحضّر دروس الأسبوع القادم أو تعالج المرضى في البيت.</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'ماذا تعمل هذه الزّوجة ..؟',
                    "pilihan" => [
                        "موظّفة",
                        "مدرّسة",
                        "ممرّضة",
                        "طبيبة",
                    ],
                    "jawaban" => "طبيبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => ' ماذا يعمل هذا الزّوج....؟',
                    "pilihan" => [
                        "طبيبا",
                        "طيارا",
                        "مدرسا",
                        "فلاحا ",
                    ],
                    "jawaban" => "مدرسا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'يعمل الزّوج في ....؟',
                    "pilihan" => [
                        "الصبّاح",
                        "المساء",
                        "الصّباح والمساء",
                        "غير معين",
                    ],
                    "jawaban" => "الصبّاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'متى تعود الزّوجة إلى البيت  ؟',
                    "pilihan" => [
                        "بعد العصر",
                        "بعد الظّهر",
                        "بعد المغرب",
                        "بعد العشاء",
                    ],
                    "jawaban" => "بعد العصر",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>إختبار  اللغة العربية لغير الناطقين بها</center></p>
                    <p><center>القسم الأول : فهم المسموع</center></p>
                    <p><center>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</center></p>
                    <p><center>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "",
                    "pilihan" => [
                        "إبراهيم طالب ماهر",
                        "إبراهيم أمهر من الآخرين",
                        "الآخرون أمهر من إبراهيم",
                        "طالب أمهر إبرهيم",
                    ],
                    "jawaban" => "إبراهيم أمهر من الآخرين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "",
                    "pilihan" => [
                        "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                        "الأستاذ يحضر في حفلة استقبال الطلاب الجدد",
                        "أن الأستاذ يوجد في حفلة استقبال الطلاب الجدد",
                        "لا توجد حفلة استقبال الطلاب الجدد",
                    ],
                    "jawaban" => "أن الأستاذ لا يوجد في حفلة استقبال الطلاب الجدد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سيصبح طبيبا",
                        "إنه ليس طبيب",
                        "إنه طبيب",
                        "هو سيكون طبيبا",
                    ],
                    "jawaban" => "إنه طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "",
                    "pilihan" => [
                        "لاعب كرة القدم",
                        "حارس المرمى",
                        "مشاهد",
                        "مدرب",
                    ],
                    "jawaban" => "مدرب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "",
                    "pilihan" => [
                        "سيسكن في الفندق",
                        "سيأكل في المطعم",
                        "سيستأجر السيارة",
                        "سيذهب إلى خارج البلاد",
                    ],
                    "jawaban" => "سيسكن في الفندق",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "",
                    "pilihan" => [
                        "هو ذاهب إلى الجامعة",
                        "هو لا يريد أن يذهب إلى الجامعة",
                        "هو لا يذهب إلى الجامعة بسبب المطر",
                        "المطر غزير حتى الآن",
                    ],
                    "jawaban" => "هو لا يذهب إلى الجامعة بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة السادسة",
                        "في الساعة السادسة والنصف",
                        "في الساعة السابعة",
                        "في الساعة السابعة والنصف",
                    ],
                    "jawaban" => "في الساعة السادسة والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "",
                    "pilihan" => [
                        "لغة النبي",
                        "أهمية اللغة العربية",
                        "نشأة اللغة العربية",
                        "اللغة الأجنبية",
                    ],
                    "jawaban" => "نشأة اللغة العربية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب أهم مرحلة",
                        "مرحلة الشباب غير مهم",
                        "مرحلة الشباب مرحلة طويلة",
                        "مرحلة الشباب كمرحلة الشيوخة",
                    ],
                    "jawaban" => "مرحلة الشباب أهم مرحلة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "",
                    "pilihan" => [
                        "عشرون",
                        "واحدة و عشرون",
                        "اثنتان و عشرون",
                        "ثلاث و عشرون",
                    ],
                    "jawaban" => "ثلاث و عشرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة كتب",
                        "خمسة كتب",
                        "ستة كتب",
                        "كتابين",
                    ],
                    "jawaban" => "ستة كتب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "",
                    "pilihan" => [
                        "يحاول أن يكون تاجرا",
                        "يحاول أن يكون موظفا حكوميا",
                        "يحاول أن يكون مهندسا",
                        "يحاول أن يكون طبيبا",
                    ],
                    "jawaban" => "يحاول أن يكون موظفا حكوميا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "",
                    "pilihan" => [
                        "اثنتا عشرة سنة",
                        "تسع سنوات",
                        "ست سنوات",
                        "ثلاث سنوات",
                    ],
                    "jawaban" => "اثنتا عشرة سنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "",
                    "pilihan" => [
                        "الأب يمنع الأولاد اللعب في الصباح",
                        "الأب يمنع الأولاد اللعب في النهار",
                        "الأب يمنع الأولاد اللعب في المساء",
                        "الأب لا يمنع الأولاد اللعب في المساء",
                    ],
                    "jawaban" => "الأب يمنع الأولاد اللعب في المساء",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "",
                    "pilihan" => [
                        "اشتري الحاسوب",
                        "باخرة",
                        "الجوال",
                        "سيارة كبيرة",
                    ],
                    "jawaban" => "الجوال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "",
                    "pilihan" => [
                        "رمضان",
                        "شعبان",
                        "شوال",
                        "رجب",
                    ],
                    "jawaban" => "شعبان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "",
                    "pilihan" => [
                        "مائة ألف",
                        "مائتي ألف",
                        "ثلاثمائة ألف",
                        "أربمعمائة ألف",
                    ],
                    "jawaban" => "مائتي ألف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "",
                    "pilihan" => [
                        "إنه سعيد لأن السماء مظلم",
                        "إنه سعيد لأن السماء بيضاء",
                        "إنه سعيد لأن السماء ممطر",
                        "إنه سعيد لأن السماء واضح",
                    ],
                    "jawaban" => "إنه سعيد لأن السماء واضح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "",
                    "pilihan" => [
                        "مرحلة الشباب",
                        "مرحلة الشيوخ",
                        "مرحلة الطفولة",
                        "مرحلة الدراسة",
                    ],
                    "jawaban" => "مرحلة الشباب",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v2 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "",
                    "pilihan" => [
                        "موظف",
                        "أستاذ",
                        "دكتور",
                        "طالب",
                    ],
                    "jawaban" => "طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "",
                    "pilihan" => [
                        "مهندس",
                        "مدرس",
                        "تاجر",
                        "فلاح",
                    ],
                    "jawaban" => "فلاح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "يومين",
                        "ثلاثة أيام",
                        "أربعة أيام",
                    ],
                    "jawaban" => "يومين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "",
                    "pilihan" => [
                        "طالبة",
                        "مدرسة",
                        "طبيبة",
                        "ممرضة",
                    ],
                    "jawaban" => "مدرسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "",
                    "pilihan" => [
                        "الابنة وأمها",
                        "الابنة وأبها",
                        "الابنة وأختها",
                        "الابنة وجدتها",
                    ],
                    "jawaban" => "الابنة وأمها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "",
                    "pilihan" => [
                        "مريم وأبوها",
                        "مريم وأمها",
                        "مريم وصديقها",
                        "مريم وأختها",
                    ],
                    "jawaban" => "مريم وصديقها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "",
                    "pilihan" => [
                        "في المسجد",
                        "في البيت",
                        "الجامعة",
                        "الفصل",
                    ],
                    "jawaban" => "في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "",
                    "pilihan" => [
                        "سيارة",
                        "قلنسوة",
                        "مسطرة",
                        "شنطة",
                    ],
                    "jawaban" => "شنطة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "",
                    "pilihan" => [
                        "في شهر يناير",
                        "في شهر مارس",
                        "في شهر يوني",
                        "في شهر أغسطس",
                    ],
                    "jawaban" => "في شهر يوني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في التلفون",
                        "في السوق",
                        "في المدرسة",
                    ],
                    "jawaban" => "في التلفون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>لإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "",
                    "pilihan" => [
                        "في الجامعة الإسلامية",
                        "في المدرسة المتوسطة",
                        "في الجامعة الأهلية",
                        "في المدرسة الثانوية",
                    ],
                    "jawaban" => "في الجامعة الإسلامية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "",
                    "pilihan" => [
                        "هو مدرّس",
                        "هو ممرض",
                        "هو مهندس",
                        "هو طبيب",
                    ],
                    "jawaban" => "هو طبيب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "",
                    "pilihan" => [
                        "في المدينة",
                        "في القرية",
                        "في قمة الجبل",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "في المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "",
                    "pilihan" => [
                        "من حديد",
                        "من بلاستيك",
                        "من جلد",
                        "من خشب",
                    ],
                    "jawaban" => "من خشب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "",
                    "pilihan" => [
                        "حديقة كبيرة",
                        "حديقة صغيرة",
                        "حديقة واسعة",
                        "حديقة نظيفة",
                    ],
                    "jawaban" => "حديقة كبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "",
                    "pilihan" => [
                        "في المدرسة",
                        "في الجامعة",
                        "في المستشفى",
                        "في المطعم",
                    ],
                    "jawaban" => "في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "",
                    "pilihan" => [
                        "شيء جميل",
                        "شيء كبير",
                        "شيء رائع",
                        "شيء ممل",
                    ],
                    "jawaban" => "شيء رائع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "",
                    "pilihan" => [
                        "إلى المطعم",
                        "إلى الدكان",
                        "إلى المكتبة",
                        "إلى النهر",
                    ],
                    "jawaban" => "إلى المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "",
                    "pilihan" => [
                        "نعم، توجد المكتبة",
                        "نعم، لا توجد المكتبة",
                        "لا، توجد المكتبة",
                        "لا، لا توجد المكتبة",
                    ],
                    "jawaban" => "نعم، توجد المكتبة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "",
                    "pilihan" => [
                        "داخل الجامعة",
                        "تحت الأشجار الكبيرة",
                        "جانب المسجد",
                        "وراء البيت",
                    ],
                    "jawaban" => "تحت الأشجار الكبيرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "",
                    "pilihan" => [
                        "في يوم الأربعاء",
                        "في يوم الخميس",
                        "في يوم الجمعة",
                        "في يوم السبت",
                    ],
                    "jawaban" => "في يوم الجمعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "",
                    "pilihan" => [
                        "الشقة الجميلة",
                        "عمل ميرم",
                        "المطار وما فيه",
                        "الاستقبال في المطار",
                    ],
                    "jawaban" => "الاستقبال في المطار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "",
                    "pilihan" => [
                        "إلى الجامعة",
                        "إلى الفندق",
                        "المطعم",
                        "الحمام",
                    ],
                    "jawaban" => "إلى الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "",
                    "pilihan" => [
                        "طعام لذيذ",
                        "طعاما غربيا",
                        "طعاما شرقيا",
                        " طعام إندويسي",
                    ],
                    "jawaban" => "طعاما شرقيا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "",
                    "pilihan" => [
                        "كمترجمة في السفارة",
                        "كمدرسة في المدرسة",
                        "كموظفة حكومية",
                        "كموظفة أهلية",
                    ],
                    "jawaban" => "كمترجمة في السفارة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</center></p>'
            ],
            [
                "tipe" => "audio",
                "data" => "v2 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "",
                    "pilihan" => [
                        "في المطار",
                        "في الفندق",
                        "في المطعم",
                        "في الغرفة",
                    ],
                    "jawaban" => "في الفندق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "",
                    "pilihan" => [
                        "نعم الإنترنيت موجود",
                        "نعم الإنترنيت غير موجود",
                        "لا، الإنترنيت موجود",
                        "الإنترنيت موجود لكن قليل",
                    ],
                    "jawaban" => "نعم الإنترنيت موجود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في المساء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "",
                    "pilihan" => [
                        "غرفة لشخصين",
                        "غرفة لشخص",
                        "غرفة لثلاثة أشخاص",
                        "غرفة لأربعة أشخاص",
                    ],
                    "jawaban" => "غرفة لشخص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>القسم الثاني : فهم التراكيب والتعبيرات</center></p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "قال تعالى : { و لا تمش في الأرض مرحا } كلمة مرحا هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "حال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "قال تعالى : { إن الله لا يستحيٓ أن يضرب مثلا ما بعوضة فما فوقها } فعل يستحيٓ في الآية الكريمة مضارع معتال الآخر :",
                    "pilihan" => [
                        "مرفوع و علامة رفعه ضمة ظاهرة",
                        "مجزوم وعلامة جزمه حذف حرف علة وهي الواو",
                        "مرفوع و علامة رفعه ضمة مقدرة",
                        "محزوم وعلامة جزمه حذف حرف علة وهي الألف",
                    ],
                    "jawaban" => "مرفوع و علامة رفعه ضمة مقدرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "بين هذه الجمل جملة صحيحة هي؟",
                    "pilihan" => [
                        "انتشر فايروس كورونا في الكل العالم",
                        "انتشر فايروس كورونا في الكل عالم",
                        "انتشر فايروس كورونا في كل العالم",
                        "انتشر فايروس كورونا في كل عالما",
                    ],
                    "jawaban" => "انتشر فايروس كورونا في كل العالم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "في مكة المكرمة كعبة. كلمة (كعبة) في الجملة؟ ",
                    "pilihan" => [
                        "مبتدأ مرفوع بالألف",
                        "خبر مقدم مرفوع بالضمة",
                        "مبتدأ مرفوع بالضمة المقدرة",
                        "مبتدأ مرفوع بالضمة الظاهرة",
                    ],
                    "jawaban" => "مبتدأ مرفوع بالضمة الظاهرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال تعالى : إن يشأ يذهبكم. كلمة (يذهبكم) في الجملة؟",
                    "pilihan" => [
                        "استدراكية",
                        "جواب الشرط",
                        "استئنافية",
                        "سببية",
                    ],
                    "jawaban" => "جواب الشرط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "تسكن عائلة أحمد في شقة بسيطة. كلمة أحمد؟",
                    "pilihan" => [
                        "مجرور بالفتحة",
                        "مجرور بالكسرة",
                        "منصوب بالفتحة",
                        "منصوب بالكسرة",
                    ],
                    "jawaban" => "مجرور بالفتحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "..... الأمة إلى الشاب القوي الجاد",
                    "pilihan" => [
                        "نحتاج",
                        "أحتاج",
                        "تحتاج",
                        "يحتاج",
                    ],
                    "jawaban" => "تحتاج",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "..... معاذ بن جبل قاضيا إلى اليمن",
                    "pilihan" => [
                        "أرسلتْ",
                        "أرسلتا",
                        "أرسل",
                        "أرسلا",
                    ],
                    "jawaban" => "أرسل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "مشكلة أحمد ...  عن مشكلة حسن",
                    "pilihan" => [
                        "يختلف",
                        "يختلفان",
                        "يختلفون",
                        "تختلف",
                    ],
                    "jawaban" => "تختلف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "...... الشوارع مبسوطة في فترة جوكو ويدودو",
                    "pilihan" => [
                        "كان",
                        "كانا",
                        "كانوا",
                        "كانت",
                    ],
                    "jawaban" => "كانت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "قال : في ثلاثة مواضع أشد استحبابا. كلمة (استحبابا) هي:",
                    "pilihan" => [
                        "مفعول به",
                        "حال",
                        "تمييز",
                        "مفعول له",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "يشارك المواطن الدولة الإهتمام ... النظافة",
                    "pilihan" => [
                        "على",
                        "في",
                        "عن",
                        "الباء",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "سأزورك غدا ... الطعام",
                    "pilihan" => [
                        "إذن سأعدّك",
                        "إذن ستعدّك",
                        "إذن سأعدّه",
                        "إذن سأعدّها",
                    ],
                    "jawaban" => "إذن سأعدّك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "كان هدف الطالب طلب العلم. الخبر في هذه الجملة؟",
                    "pilihan" => [
                        "كان",
                        "هدف",
                        "الطالب",
                        "طلب العلم",
                    ],
                    "jawaban" => "طلب العلم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "انتشر الخبر ... الناس",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => 'شرح الأستاذ الدرس اليوم شرحا واضحا. "واضحا" في هذه الجملة؟',
                    "pilihan" => [
                        "نعت",
                        "ظرف",
                        "مفعول به",
                        "حال",
                    ],
                    "jawaban" => "نعت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "التحق ... المدراسة في الوقت المناسب",
                    "pilihan" => [
                        "الباء",
                        "في",
                        "إلى",
                        "على",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "قال تعالى :{وورث سليمان داوود}. كلمة داوود في الآية الكريمة هي؟",
                    "pilihan" => [
                        "فاعل",
                        "مفعول الذي لم يسم فاعله",
                        "مفعول به",
                        "مفعول له",
                    ],
                    "jawaban" => "مفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "قال تعالى :{فمنهم من يمشي على بطنه}. (من) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "استفهامية",
                        "موصولة",
                        "شرطية",
                        "زائدة",
                    ],
                    "jawaban" => "موصولة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "قال تعالى :{وفجرنا الأرض عيونا}. كلمة (عيونا) في الآية الكريمة هي؟",
                    "pilihan" => [
                        "مفعول به",
                        "مفعول له",
                        "حال",
                        "تمييز",
                    ],
                    "jawaban" => "تمييز",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'كان الطلاب يريدون أن ينالوا مهنة طيبة وشريفة. ما الجمع من "مهنة"؟',
                    "pilihan" => [
                        "مهن",
                        "مهنات",
                        "ميهان",
                        "مهنة",
                    ],
                    "jawaban" => "مهن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "خير ... من يدلك على الخير",
                    "pilihan" => [
                        "الصحيب",
                        "الصحيبان",
                        "الصحيبون",
                        "الأصحاب",
                    ],
                    "jawaban" => "الأصحاب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "تمسك المسلمون على القرآن الكريم",
                        "تمسك المسلمون في القرآن الكريم",
                        "تمسك المسلمون بالقرآن الكريم",
                        "تمسك المسلمون إلى القرآن الكريم",
                    ],
                    "jawaban" => "تمسك المسلمون بالقرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعدها",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقلا إلى المرحلة التي بعده",
                        "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                    ],
                    "jawaban" => "أنهى محمد مرحلة تعليمية وانتقل إلى المرحلة التي بعدها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "أين الجملة الصحيحة من هذه الخيارات؟",
                    "pilihan" => [
                        "يبيع البائع سلعته في السوق",
                        "يبيعان البائع سلعته في السوق",
                        "تبيع البائع سلعته في السوق",
                        "تبيعان البائع سلعته في السوق",
                    ],
                    "jawaban" => "يبيع البائع سلعته في السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "<u>زعمت</u> <u>أحمد</u> <u>حاضر</u> في <u>هذا</u> اللقاء. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "زعمت",
                        "أحمد",
                        "حاضر",
                        "هذا",
                    ],
                    "jawaban" => "حاضر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "<u>أصبحت</u> <u>الحق</u> بعدما <u>ساد</u> <u>الظلم</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "أصبحت",
                        "الحق",
                        "ساد",
                        "الظلم",
                    ],
                    "jawaban" => "أصبحت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "إنك <u>تعمل</u> وكأن <u>عملك</u> <u>بنيانا</u> <u>راسخ</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "تعمل",
                        "عملك",
                        "بنيانا",
                        "راسخ",
                    ],
                    "jawaban" => "بنيانا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "<u>ليتها</u> <u>كانت</u> <u>سمع</u> <u>كلآمي</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "ليتها",
                        "كانت",
                        "سمع",
                        "كلآمي",
                    ],
                    "jawaban" => "سمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "<u>حاول</u> أحمد أن <u>يتعلم</u> <u>لغتين</u> <u>أجنبية</u> عربية و إنجليزية. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "حاول",
                        "يتعلم",
                        "لغتين",
                        "أجنبية",
                    ],
                    "jawaban" => "أجنبية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "<u>دعا</u> <u>الإسلام</u> <u>في</u> <u>النظافة</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "دعا",
                        "الإسلام",
                        "في",
                        "النظافة",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "وحث <u>الإسلام</u> المسلم على نظافة <u>جسده</u> وملبسه ومسكنه وبيئته التي <u>يعيش</u> <u>فيه</u>. ما هي الكلمة الخاطئة من هذه الجملة؟",
                    "pilihan" => [
                        "الإسلام",
                        "جسده",
                        "يعيش",
                        "فيه",
                    ],
                    "jawaban" => "فيه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "قبل الدخول - أهم مرحلة - في الحياة الزوجة - اختيار الزوجة",
                    "pilihan" => [
                        "أهم مرحلة احتيار الزوجة في الحياة الزوجة قبل الدخول",
                        "في الحياة الزوجة أهم مرحلة قبل الدخول احتيار الزوجة",
                        "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                        "قبل الدخول أهم مرحلة في الحياة الزوجة احتيار الزوجة",
                    ],
                    "jawaban" => "احتيار الزوجة أهم مرحلة قبل الدخول في الحياة الزوجة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "تكمل - إن - إيمانك - تزوجت - وحياتك <br>الترتيب الصحيح من الكلمات السابقة هو....",
                    "pilihan" => [
                        "تكمل إيمانك إن تزوجت وحياتك",
                        "تزوجت إيمانك وحياتك إن تكمل",
                        "إيمانك و حياتك تكمل إن تزوجت",
                        "إن تزوجت تكمل إيمانك وحياتك",
                    ],
                    "jawaban" => "إن تزوجت تكمل إيمانك وحياتك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "تنجح - حتى - في الإمتحان - تعلم - العربية <br>الترتيب الصحيح من الكلمات السابقة هو...",
                    "pilihan" => [
                        "تعلم في الإمتحان حتى تنجح العربية",
                        "تعلم العربية حتى تنجح في الإمتحان",
                        "العربية في الإمتحان تنجح حتى تعلم",
                        "في الإمتحان تنجح حت تعلم العربية",
                    ],
                    "jawaban" => "تعلم العربية حتى تنجح في الإمتحان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "والمرأة لا ينبغي لها أن تقبل من الأزواج . إلا من هو على خلق ودين. قال صلى الله عليه وسلم :( إذا أتاكم من ترضون خلقه ودينه فزوجوه. إن لا تفعلوا تكن فتنة في الأرض وفساد عريض). جملة الشرط في هذ الحديث هي؟",
                    "pilihan" => [
                        "المرأة لا ينبغي لها",
                        "إلا من هو على خلق ودين",
                        "قال صلى الله عليه وسلم",
                        "إذا أتاكم من ترضون خلقه ودينه",
                    ],
                    "jawaban" => "إذا أتاكم من ترضون خلقه ودينه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "هوايتي الجديدة هي أن ... إلى الخبر من راديو كل العطلة",
                    "pilihan" => [
                        "يستمع",
                        "تستمع",
                        "أستمع",
                        "نستمع",
                    ],
                    "jawaban" => "أستمع",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => 'المسلمون يتبعون المذاهب الأربعة. ما المفرد من "المذاهب"؟',
                    "pilihan" => [
                        "مذهب",
                        "مذهبة",
                        "هذب",
                        "ذهب",
                    ],
                    "jawaban" => "مذهب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "تحتوي معظم <u>الوجبات</u> السريعة على نسبة كبيرة من الكربوهيدرات. الكلمة التي تحتها خط تعني؟ ",
                    "pilihan" => [
                        "الوظيفة",
                        "الأعمال",
                        "الأكلات",
                        "المفروضة",
                    ],
                    "jawaban" => "الأكلات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => 'تعلموا العربية لأنها جزء من من دينكم. ما الجمع من "جزء"؟',
                    "pilihan" => [
                        "أجزاء",
                        "جزوء",
                        "جزاء",
                        "أجزيات",
                    ],
                    "jawaban" => "أجزاء",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv2(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center>النص الأول :</center></p>
                    <p>ذهبت نملة صغيرة الى جدول ماء لتشرب وتستريح، بعد أن تعبت كثيرا فى جمع قوتها. فزلت قدمها وسقطت فى الماء، ولم يمكنها الخروج منه لأنها لا تعرف السباحة وكادت تغرق. وكانت حمامة بيضاء جميلة واقفة على حجر فى الماءن ورأت ما حصل للنملة. فرق لها قلبها وسعت فى خلاصها، فطارت الى البر ورجعت، وفى منقارها عود من الحشيش، مدته على الماء الى البر. فتعلقت به النملة وخرجت من الماء بسلام.</p>
                    <p>وفى يوم التالى، نزلت الحمامة على فرع شجرة تتظلل بأوراقها. فمر صياد من بعد ورآها. فوقف يصيب بندقية نحوها ليصيدها، وهي لم ترها فتطير. ولكن النملة التى خلصتها تلك الحمامة رأت الصياد وعرفت ما عزم عليه، فصعدت فى جسمه. ولما هم بإطلاق بندوقية، فرصته قرصة شديدة أفزعته، فتحرك فمالت الرصاصة ولم تصب الحمامة، بل نجت جزاء إحسانها الى النملة. </p>
                    <p>اختر أصح الأجوبة الآتية </p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين وقفت الحمامة ؟",
                    "pilihan" => [
                        "على الأشجار",
                        "على الماء",
                        "على الأوراق",
                        "على الحجر",
                    ],
                    "jawaban" => "على الحجر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "ذهبت النملة الصغيرة الى جدول لأن ......؟",
                    "pilihan" => [
                        "تريد النملة أن تشرب وتستريح",
                        "تريد الحمامة أن تلتقى بها",
                        "الصياد يصوب بندوقية",
                        "تغرق الحمامة",
                    ],
                    "jawaban" => "تريد النملة أن تشرب وتستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "لماذا يصوب الصياد البندوقية ؟",
                    "pilihan" => [
                        "لأنه سيصيد النملة",
                        "لأنه سيستريح فى الغابة",
                        "لأنه سيصيد الحمامة",
                        "لأنه سيذهب الى الجدول",
                    ],
                    "jawaban" => "لأنه سيصيد الحمامة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => " الرجل الذى كانت حرفته صيد الحيوان يسمى بــــــــــ........؟",
                    "pilihan" => [
                        "الراعى",
                        "الصياد",
                        "أهل الحيوان",
                        "صاحب الحيوان",
                    ],
                    "jawaban" => "الصياد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "صعدت النملة فى جسم الصياد لـــــــــــ.....؟",
                    "pilihan" => [
                        "يقتله",
                        "نجدته",
                        "تأكل",
                        "قرصته",
                    ],
                    "jawaban" => "قرصته",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "كيف الحمامة عندما ترى النملة تقع فى الماء ؟",
                    "pilihan" => [
                        "رق لها قلبها وسعت فى خلاصها",
                        "تدعو الصياد لنجدتها",
                        "نزلت الحمامة على فرع شجرة",
                        "ترجع الى القفص ولا تبالى",
                    ],
                    "jawaban" => "رق لها قلبها وسعت فى خلاصها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لا تستطيع النملة الخروج من الماء لأنها ؟",
                    "pilihan" => [
                        "تشرب الماء",
                        "تقرص الصياد",
                        "لا تعرف السباحة",
                        "تساعد الحمامة",
                    ],
                    "jawaban" => "لا تعرف السباحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "كيف تخرج النملة من الماء؟",
                    "pilihan" => [
                        "تدعو الحمامة",
                        "تتعلق بعود من الحشيش",
                        "تقرص الصياد",
                        "تشرب الماء",
                    ],
                    "jawaban" => "تتعلق بعود من الحشيش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "أين المكان الذي يصود الصياد الحمامة ؟",
                    "pilihan" => [
                        "الغابة",
                        "النهر",
                        "الشجر",
                        "البر",
                    ],
                    "jawaban" => "الغابة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كيف تجزى النملة إحسان الحمامة ؟",
                    "pilihan" => [
                        "زلت قدمها الى الماء",
                        "تسلمها من الصياد",
                        "تخرج من الماء",
                        "تأخذ عود من الحشيش",
                    ],
                    "jawaban" => "تسلمها من الصياد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الثانى :</center></p>
                    <p>كان مُصوِّر مسافرا وهو يحمل مبلغا كبيرا من النقود، في كيس علقه حول عنقه. فنزل ليلا ببلد لم يجد فيه خانا، فأنزله أحد الأهالي ضيفا عنده. ولما رأى أنه يحمل ذلك المال الكثير، لبث يرقبه حتى نام، ودخل عليه حجرته يستق الخطى لكيلا يستيقظ، وسلبه المال، وحمله بلطف وخفةن وألقاه فى الطريق بعيدا عن الدار. ولما استيقظ الرجل من نومه فى الصباح، وجد نفسه فى الطريق ولا مال معه. فذهب الى الحاكم وشكا اليه أمره. فسأل الحاكم: "أتعرف من مضيفك بالأمس؟" فقال: "لا، لكنّي مصور ماهر، أستطيع أن أصور لك أهل البيت الذى كنت فيه فتعرفهم أنت وعمالك"</p>
                    <p>ثم اختلى المصور فى غرفة، وصور كل أعضاء تلك الأسرة الخائنة. فعرضت الصورة على الأهالي فعرفهم، وجائوا بهم الى الحاكم، فأقروا بذنبهم، وردوا المال الى صاحبه، وعاقبهم الحاكم عقابا شديدا، لأنهم خانوا على من ائتمنهم على نفسه وماله </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ماذا يحمل المصور في السفار ؟",
                    "pilihan" => [
                        "مبلغ كبير من النقود",
                        "مبلغ كبير من القرطاس",
                        "مبلغ كبير من الرغيف",
                        "مبلغ كبير من اللباس",
                    ],
                    "jawaban" => "مبلغ كبير من النقود",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "صور المصور أعضاء الأسرة الخائنة لأن ؟",
                    "pilihan" => [
                        "تضع الصورة على الجدار",
                        "تساعد المصور فى السفر",
                        "يريد قبض الأسرة الخائنة",
                        "يضع الصورة فى المعرض",
                    ],
                    "jawaban" => "يريد قبض الأسرة الخائنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "أين ذهب المصور بعد ما سلبت ماله ؟",
                    "pilihan" => [
                        "المقهى",
                        "الحاكم",
                        "المسجد",
                        "الخان",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما الذى سلب من المصور ؟",
                    "pilihan" => [
                        "الملابس",
                        "الخان",
                        "المال",
                        "الصورة",
                    ],
                    "jawaban" => "المال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "كيف حال المصور بعد ما استيقظ من النوم؟",
                    "pilihan" => [
                        "لا مال معه",
                        "لا لباس معه",
                        "لا فراش معه",
                        "لا أهل معه",
                    ],
                    "jawaban" => "لا مال معه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ماذا فعل المصور عن هذه المصيبة ؟",
                    "pilihan" => [
                        "بكى وعاد الى بيته",
                        "حمل المال فى كيس",
                        "رد المال الى الحاكم",
                        "شكا الى الحاكم عن أمره",
                    ],
                    "jawaban" => "شكا الى الحاكم عن أمره",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "الرجل الذي عدل العدالة يسمى بــــــــــ......؟",
                    "pilihan" => [
                        "النائب",
                        "الحاكم",
                        "المدرس",
                        "المسافر",
                    ],
                    "jawaban" => "الحاكم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "فذهب الى الحاكم وشكا اليه <u>أمره</u>. الضمير الذي تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "أهل البيت",
                        "المضيف",
                        "المصور",
                        "الأهالى",
                    ],
                    "jawaban" => "المصور",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أدرك المصور من نومه أنه؟ ",
                    "pilihan" => [
                        "فى الحكومة",
                        "فى الطريق",
                        "فى البيت",
                        "فى الغرفة",
                    ],
                    "jawaban" => "فى الطريق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "لا يدرك المصور أنه سلبه المال لأن ؟",
                    "pilihan" => [
                        "يصور",
                        "يسافر",
                        "يشكو",
                        "ينام",
                    ],
                    "jawaban" => "ينام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>النص الثالث: </p>
                    <p>كان عمر بن الخطاب (ض) رجلا شجاعا، وعندما أراد الهجرة من مكة الى المدينة، حمل سيفه وذهب ال الكعبة وطاف حول اليت سبعة أشواط ثم صلى الله.</p>
                    <p>وفى إحدى الليالي، خرج عمر يتفقده أحوال المسلمين وكان البرد شديدا فى تلك الليلة. شاهد عمر نارا فى الطريق، فأسرع اليها وعندما أقرب من النار رأى امرأة تجلس هي وأطفالها حول قدر على النار. وكان الأطفال يبكون ويصرخون. اقترب عمر من المرأة وقال لها: "السلام عليكم". فقالت له: "وعليكم السلام". ثم سألها: "لماذا يبكي هؤلاء الأطفال ؟ فأجبته: "إنهم جائعون". قال لها: وماذا فى القدر ؟ قالت له: فيه ماء يغلى، يستمع الأطفال الى صوته فينامون". انطلق عمر الى بيت الدقيق وأحضر دقيقا وزيتا. فتح عمر القدر وصب فيه الدقيق وعندما نضج طلب منها طبقا، صب فيه الطعام ثم طلي منها أن تطعم أطفالها. أكل الأطفال حتى شبعوا ثم أخذوا يضحكون ويلعبون حتى ناموا. شكرت المرأة عمر وقالت له: "جزاك الله خيرا"</p>
                '
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "كيف الجو حين يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "هادئ",
                        "جاف",
                        "بريد شديد",
                        "حار شديد",
                    ],
                    "jawaban" => "بريد شديد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "اقترب عمر من المرأة لأن ؟",
                    "pilihan" => [
                        "الأطفال يبكون ويصرخون",
                        "صب الرقيق والزيت فى القدر",
                        "الأطفال يضحكون حتى ناموا",
                        "أحضر دقيقا وزيتا",
                    ],
                    "jawaban" => "الأطفال يبكون ويصرخون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كم شوطا طاف عمر حول البيت قبل صلى الله ؟",
                    "pilihan" => [
                        "خمسة أشواط",
                        "ستة أشواط",
                        "سبعة أشواط",
                        "ثمانية أشواط",
                    ],
                    "jawaban" => "سبعة أشواط",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "متى يتفقد عمر أحوال المسلمين ؟",
                    "pilihan" => [
                        "فى صباح مبكر",
                        "فى الليل",
                        "فى النهار",
                        "فى المساء",
                    ],
                    "jawaban" => "فى الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "ماذا تطبخ المرأة لأطفالها قبل مجيئ عمر ؟",
                    "pilihan" => [
                        "الرز",
                        "الرغيف",
                        "البيض",
                        "الماء",
                    ],
                    "jawaban" => "الماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "عمر رجل شجاع ويريد أن يهجر من",
                    "pilihan" => [
                        "الشام الى المكة",
                        "المدينة الى المكة",
                        "المكة الى المدينة",
                        "المكة الى الشام",
                    ],
                    "jawaban" => "المكة الى المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "تطبخ المرأة الماء لأطفالها لأن ؟",
                    "pilihan" => [
                        "لا دقيقا ولا زيتا لها",
                        "تحب الماء المغلى",
                        "تصنع اللبن لأطفالها",
                        "تغتسل به لأن الجو بارد",
                    ],
                    "jawaban" => "لا دقيقا ولا زيتا لها",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "صب <u>فيه</u> الطعام ثم طلب منها أن تطعم أطفالها. الضمير الذى تحت الخط يعود الى ؟",
                    "pilihan" => [
                        "الأطفال",
                        "الماء",
                        "الدقيق",
                        "الطبق",
                    ],
                    "jawaban" => "الأطفال",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "من القصة السابقة عرفنا أن عمر ؟",
                    "pilihan" => [
                        "سخي للمساكين",
                        "خبير بما يعملون",
                        "بخيل",
                        "متكبر",
                    ],
                    "jawaban" => "سخي للمساكين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "ماذا يشعر الأطفال بعد ما أكلوا الطعام ؟",
                    "pilihan" => [
                        "يحزنون",
                        "يفرحون",
                        "يقلقون",
                        "يخافون",
                    ],
                    "jawaban" => "يفرحون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الرابع </center></p>
                    <p>في البيت أب وأم، ولكل واحد منهما عمل خاص. اشتغل الأب خارج البيت. فذهب الى الحقول أو الى المزارع أو قصد سوقا أو دكانا للتجارة أو توظف فى بعض الدواوين أو علم فى المدارس. وليست الأم مثل ذلك بل هي اشتغلت فى المنزل فرتب كل شيئ فى البيت ونظفته وغسلت الملابس الواسخة. ثم استعدت وابتدأت فى الطهي. أتمت الأم تلك الأعمال الكثيرة هي وحدها. أو ساعدتها ابنة لها،ثم استرحت من الأعمال. </p>
                    <p>فالواجب عليك أيتها الفتاة المتعلمة الإخلاص فى خدمة الأم. فإذا اشتغلت معها وقبلت منها الإرشادات تقدمت وربحت بالعلوم والتجارب ربحا عظيما. </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "أين يشتغل الأب كل يوم ؟",
                    "pilihan" => [
                        "في البيت",
                        "في المزرعة",
                        "خارج البيت",
                        "فى السوق",
                    ],
                    "jawaban" => "خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "تعمل الأم عمل البيت وتسمى بــــــــــ......؟ ",
                    "pilihan" => [
                        "تاجرة",
                        "ربة البيت",
                        "عمال",
                        "موطفة",
                    ],
                    "jawaban" => "ربة البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا تعمل الأم بعد ما أتمت من الأعمال الكثيرة ؟ ",
                    "pilihan" => [
                        "تغسل الملابس",
                        "تنظف البيت",
                        "تربي أبنائها",
                        "تستريح",
                    ],
                    "jawaban" => "تستريح",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "أين توظف الأب ؟",
                    "pilihan" => [
                        "السوق",
                        "المزرعة",
                        "بعض الدواوين",
                        "الدكان",
                    ],
                    "jawaban" => "بعض الدواوين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "لا تعمل الأم خارج البيت لأن ؟",
                    "pilihan" => [
                        "تنام فى البيت",
                        "تشتغل فى عمل البيت",
                        "تستريح فى البيت",
                        "تغسل الملابس",
                    ],
                    "jawaban" => "تشتغل فى عمل البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "أين يعمل الأب التجارة ؟",
                    "pilihan" => [
                        "السوق",
                        "المدرسة",
                        "الحقول",
                        "المزارع",
                    ],
                    "jawaban" => "السوق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "أين اشتغلت الأم كل يوم ؟",
                    "pilihan" => [
                        "المزرعة",
                        "السوق",
                        "المدرسة",
                        "البيت",
                    ],
                    "jawaban" => "البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "من التى تساعد الأم فى عملية البيت ؟",
                    "pilihan" => [
                        "الأب",
                        "الابنة",
                        "الابن",
                        "الصديقة",
                    ],
                    "jawaban" => "الابنة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "ما الذى اشتغل الأب ؟",
                    "pilihan" => [
                        "اشتغل الأب المزارع",
                        "اشتغل الأب عمل البيت",
                        "اشتغل الأب عمل خارج البيت",
                        "اشتغل الأب عمل الإدارى",
                    ],
                    "jawaban" => "اشتغل الأب عمل خارج البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "استرحت الأم من الأعمال الكثيرة لأن ؟",
                    "pilihan" => [
                        "أتمت جميع عمالها",
                        "ذهبت الى المزارع",
                        "وظفت فى الدواوين",
                        "علمت فى المدرسة",
                    ],
                    "jawaban" => "أتمت جميع عمالها",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p><center>النص الخامس </center></p>
                    <p>زاد عدد المسلمين فى العالم فى الأعوام الماضية الى حوالي المليار والنصف. وحسب التقديرات الجديدة سيبلغ هذا العدد حوالي ملياري مسلم فى كل أنحاء العالم قبل نهاية القرن الحالي. وغالبية المسلمين أي 90 بالمائة تقريبا تتبع مذهبا من مذاهب أهل السنة الاساسية الأربعة التي ضاع أسسها كل من أبي حنيفة النعمان بن ثابت (ت. 767 م) ومالك بن أنس (ت. 795م) ومحمد بن إدريس الشافعي (ت. 820م) وأحمد بن حنبل (ت. 855م) حسب الترتيب التاريخي. </p>
                    <p>ونبي الإسلام هو محمد بن عبد الله ن عبد المطلب بن هاشم ﷺ وهو من بنى هاشم من قريش فى مكة المكرمة. وبعد أن دعا محمد ﷺ أهل مكة الى الإسلام هاجر فى سنة 622م الى يثرب، وهذه السنة هي بداية التقويم الهجري على أساس السنة القمرية أي 354 يوما، وبقي هناك الى أن توفي عام 632م. بعد وفاة النبى خلفه أبو بكر الصديق  (632-634م) ثم عمر بن الخطاب (634-633م) ثم عثمان بن عفان (644-656م) ثم علي بن أبي طالب (656-662م) </p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "من أية القبيلة نبي محمد ؟",
                    "pilihan" => [
                        "مرة",
                        "قريش",
                        "غسان",
                        "محرب بن خفصة",
                    ],
                    "jawaban" => "قريش",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "أية سنة بدأ التقويم الهجري ؟",
                    "pilihan" => [
                        "304",
                        "634",
                        "622",
                        "661",
                    ],
                    "jawaban" => "622",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => "كم عدد المسلمين فى الأعوام الماضية ؟",
                    "pilihan" => [
                        "مليون تقريبا",
                        "حوالى مليار والنصف",
                        "مليار والربع",
                        "ربع مليار",
                    ],
                    "jawaban" => "حوالى مليار والنصف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "يبدل اسم يثرب بسمى ؟",
                    "pilihan" => [
                        "القاهرة",
                        "المكة",
                        "اللبنان",
                        "المدينة",
                    ],
                    "jawaban" => "المدينة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "كان المسلمون تتبع .......مذاهب السنة الأساسية",
                    "pilihan" => [
                        "أربعة",
                        "أربع",
                        "ثلاثة",
                        "ثلاث",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => "الرجل الذى يبدل النبى فى قيادة البلاد يسمى بـــــــــــ...؟",
                    "pilihan" => [
                        "رئيس الجمهور",
                        "رئيس البلاد",
                        "الخليفة",
                        "النائب",
                    ],
                    "jawaban" => "الخليفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => "من الخليفة الثالث من خلفاء الرسول ؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن أبى طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => "الخليفة الذي قاد الحكومة أقل فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عثمان بن عفان",
                        "عمر بن خطاب",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "أبو بكر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => "كم سنة يكون أبو بكر خليفة ؟",
                    "pilihan" => [
                        "سنة واحدة",
                        "سنتين اثنتين",
                        "ثلاث سنوات",
                        "أربع سنوات",
                    ],
                    "jawaban" => "ثلاث سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => "الخليفة الذي قاد الحكومة أطول فترة هو؟",
                    "pilihan" => [
                        "أبو بكر",
                        "عمر بن خطاب",
                        "عثمان بن عفان",
                        "على بن ابي طالب",
                    ],
                    "jawaban" => "عثمان بن عفان",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_istimav3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>إختبار  اللغة العربية لغير الناطقين بها</b></center></p>
                    <p><center><b>القسم الأول : فهم المسموع</b></center></p>
                    <p>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</p>
                    <p>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "1",
                    "soal" => "",
                    "pilihan" => [
                        "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                        "الدراجة النارية في الجامعة",
                        "هو لا يحب الدراجة النارية",
                        "هو لا يذهب بالدراجة النارية",
                    ],
                    "jawaban" => "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "2",
                    "soal" => "",
                    "pilihan" => [
                        "الصياد يسترحون",
                        "الصياد لا يسترحون",
                        "الصياد لا يريدون أن يصيدوا الأسماك",
                        "الأسماك غير موجودة في البحر",
                    ],
                    "jawaban" => "الصياد يسترحون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "3",
                    "soal" => "",
                    "pilihan" => [
                        "إنها قوية",
                        "إنها لطيفة",
                        "إنها ضعيفة",
                        " إنها صابرة",
                    ],
                    "jawaban" => "إنها قوية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "4",
                    "soal" => "",
                    "pilihan" => [
                        "الطبيب",
                        "الصديق",
                        "الأب",
                        "المدرّس",
                    ],
                    "jawaban" => "المدرّس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "5",
                    "soal" => "",
                    "pilihan" => [
                        "هو يريد الأفلام",
                        "هو يشاهد الأفلام",
                        "هو يريد أن يشاهد الأفلام مع صديقه",
                        "هو يريد يشاهد الأفلام",
                    ],
                    "jawaban" => "هو يريد أن يشاهد الأفلام مع صديقه",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "6",
                    "soal" => "",
                    "pilihan" => [
                        "بعد صلاة الصبح",
                        "بعد صلاة العصر",
                        "بعد صلاة المغرب",
                        "بعد صلاة العشاء",
                    ],
                    "jawaban" => "بعد صلاة العشاء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "7",
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة الواحدة",
                        "في الساعة الثانية",
                        "في الساعة الثالثة",
                        "في الساعة الرابعة",
                    ],
                    "jawaban" => "في الساعة الرابعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "8",
                    "soal" => "",
                    "pilihan" => [
                        "أهمية النية",
                        "أقسام النية",
                        "النية وترتيبها",
                        "فوائد النية",
                    ],
                    "jawaban" => "أهمية النية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "9",
                    "soal" => "",
                    "pilihan" => [
                        "كريم الأخلاق جزء من سعادة الناس",
                        "سعادة الناس جزء من كريم الأخلاق",
                        "سعادة الناس بدون الأخلاق",
                        "الأخلاق الكريمة السعيدة",
                    ],
                    "jawaban" => "كريم الأخلاق جزء من سعادة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "10",
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المستشفى",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "11",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثون جزءا",
                        "خمسة عشر جزءا",
                        "خمسة أجزاء",
                        "جزءا واحدا",
                    ],
                    "jawaban" => "خمسة عشر جزءا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "12",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة أقلام",
                        "قلما واحدا",
                        "ستة أقلام",
                        "قلمين",
                    ],
                    "jawaban" => "ستة أقلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "13",
                    "soal" => "",
                    "pilihan" => [
                        "لم أحضر لأني لدي أمر مهم في البيت",
                        "أنا لم أحضر إلى السوق",
                        "السوق بعيد من بيتي",
                        "لا، هو لا يريد أن يذهب إلى السوق",
                    ],
                    "jawaban" => "لم أحضر لأني لدي أمر مهم في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "14",
                    "soal" => "",
                    "pilihan" => [
                        "معالجة المرضى",
                        "مرافقة المرضى",
                        "نهي المرضى",
                        "ضرب المرضى",
                    ],
                    "jawaban" => "معالجة المرضى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "15",
                    "soal" => "",
                    "pilihan" => [
                        "الأستاذ الطلاب أن يتكاسل",
                        "الأستاذ الطلاب أن لا يتكاسل",
                        "الأستاذ كسلان",
                        "الأستاذ لا يتكاسل",
                    ],
                    "jawaban" => "الأستاذ الطلاب أن يتكاسل",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "16",
                    "soal" => "",
                    "pilihan" => [
                        "سنة واحدة",
                        "ثلاث سنوات",
                        "خمس سنوات",
                        "ست سنوات",
                    ],
                    "jawaban" => "ست سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "17",
                    "soal" => "",
                    "pilihan" => [
                        "اللغة العربية في العصر العباسي",
                        "اللغة العربية لغة عالمية",
                        "الحضارة الإسلامية",
                        "أهمية اللغة العربية",
                    ],
                    "jawaban" => "اللغة العربية لغة عالمية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "18",
                    "soal" => "",
                    "pilihan" => [
                        "هو يشتري كتابا جديدا",
                        "هو لا يشتري كتابا",
                        "هو يشتري كتابا واحدا",
                        "هو يشتري كتابا بالفلوس",
                    ],
                    "jawaban" => "هو لا يشتري كتابا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "19",
                    "soal" => "",
                    "pilihan" => [
                        "في شهر مارس",
                        "في شهر فبراير",
                        "في شهر ديسمبر",
                        "في شهر يناير",
                    ],
                    "jawaban" => "في شهر يناير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "20",
                    "soal" => "",
                    "pilihan" => [
                        "تجوز المرأة العمل كالرجال",
                        "لا تجوز المرأة العمل خارج بيتها",
                        "لا تجوز المرأة الخروج من بيتها",
                        "تجوز المرأة العمل كالرجال لكن بشرط",
                    ],
                    "jawaban" => "لا تجوز المرأة الخروج من بيتها",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "21",
                    "soal" => "",
                    "pilihan" => [
                        "الأم",
                        "الأب",
                        "الإبن",
                        "العم",
                    ],
                    "jawaban" => "الإبن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "22",
                    "soal" => "",
                    "pilihan" => [
                        "هو طبيب كريم",
                        "هو أستاذ كريم",
                        "هو تاجر غني",
                        "هو عامل كريم",
                    ],
                    "jawaban" => "هو طبيب كريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "23",
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "عشرين يوما",
                        "ثلاثين يوما",
                        "خمسة وعشرين يوما",
                    ],
                    "jawaban" => "ثلاثين يوما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "24",
                    "soal" => "",
                    "pilihan" => [
                        "يدرس بجاكرتا",
                        "يدرس بسورابايا",
                        "يدرس بمصر",
                        "يدرس بيوكجاكرتا",
                    ],
                    "jawaban" => "يدرس بمصر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "25",
                    "soal" => "",
                    "pilihan" => [
                        "نال الهدية للعمرة بسبب جماله",
                        "نال الهدية للعمرة بسبب ذكائه",
                        "نال الهدية للعمرة بسبب نجاحه",
                        "نال الهدية للعمرة بسبب والديه",
                    ],
                    "jawaban" => "نال الهدية للعمرة بسبب نجاحه",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "26",
                    "soal" => "",
                    "pilihan" => [
                        "ينتهي بعد شهرين",
                        "ينتهي بعد شهر",
                        "ينتهي بعد ثلاثة أشهر",
                        "ينتهي بعد أربعة أشهر",
                    ],
                    "jawaban" => "ينتهي بعد شهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "27",
                    "soal" => "",
                    "pilihan" => [
                        "مدّة الاشتراك سنة واحدة",
                        "في البيت مدّة الاشتراك سنتين",
                        "الجامعة مدّة الاشتراك ثلاث سنوات",
                        "مدّة الاشتراك أربع سنوات",
                    ],
                    "jawaban" => "مدّة الاشتراك سنة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "28",
                    "soal" => "",
                    "pilihan" => [
                        "عند شركة الدراجة",
                        "عند شركة الكهرباء",
                        "عند شركة السيارة",
                        "عند شركة الهاتف المحمول",
                    ],
                    "jawaban" => "عند شركة الهاتف المحمول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "29",
                    "soal" => "",
                    "pilihan" => [
                        "بثمن رخيص",
                        "بثمن غال",
                        "بدون ثمن",
                        "بثمن كمايريد",
                    ],
                    "jawaban" => "بثمن رخيص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "30",
                    "soal" => "",
                    "pilihan" => [
                        "أسمار",
                        "أثمان",
                        "ثامنية",
                        "ثمينة",
                    ],
                    "jawaban" => "أثمان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "31",
                    "soal" => "",
                    "pilihan" => [
                        "في الجامعة الإسلامية",
                        "في المدرسة المتوسطة",
                        "في الجامعة الأهلية",
                        "في المدرسة الثانوية",
                    ],
                    "jawaban" => "في الجامعة الإسلامية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "32",
                    "soal" => "",
                    "pilihan" => [
                        "بالحافلة",
                        "مشيا على الأقدام",
                        "بالدرّاجة",
                        "بالسيّارة",
                    ],
                    "jawaban" => "بالسيّارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "33",
                    "soal" => "",
                    "pilihan" => [
                        "للدراسة في المدرسة",
                        "للدراسة في الجامعة",
                        "للتجارة",
                        "لإعطاء الآخرين",
                    ],
                    "jawaban" => "للدراسة في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "34",
                    "soal" => "",
                    "pilihan" => [
                        "في البنك",
                        "في المقهى",
                        "في المسجد",
                        "في البيت",
                    ],
                    "jawaban" => "في المقهى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "35",
                    "soal" => "",
                    "pilihan" => [
                        "لونها سوداء",
                        "لونها حمراء",
                        "لونها سمراء",
                        "لونها بيضاء",
                    ],
                    "jawaban" => "لونها بيضاء",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "36",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "37",
                    "soal" => "",
                    "pilihan" => [
                        "في الفندق",
                        "في المكتبة",
                        "في الطائرة",
                        "في السوق",
                    ],
                    "jawaban" => "في الطائرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "38",
                    "soal" => "",
                    "pilihan" => [
                        "عشرون ب",
                        "ثلاثون هـ",
                        "ثلاثون ب",
                        "عشرون هـ",
                    ],
                    "jawaban" => "ثلاثون ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "39",
                    "soal" => "",
                    "pilihan" => [
                        "مضيفة",
                        "طيارة",
                        "سائقة",
                        "لاعبة",
                    ],
                    "jawaban" => "مضيفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "40",
                    "soal" => "",
                    "pilihan" => [
                        "هم داخل الطائرة",
                        "هم في مكان الانتظار",
                        "هم خارج الطائرة",
                        "هم في الملعب",
                    ],
                    "jawaban" => "هم داخل الطائرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "41",
                    "soal" => "",
                    "pilihan" => [
                        "منافع التدخين",
                        "أضرار التدخين",
                        "آثار التدخين",
                        "العادة في التدخين",
                    ],
                    "jawaban" => "أضرار التدخين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "42",
                    "soal" => "",
                    "pilihan" => [
                        "التدخين شيء مهم في الحياة",
                        "الحياة تحتاج إلى التدخين",
                        "إن التدخين يسبب إلى كثير من الأمراض",
                        "إن التدخين لا يؤثر إلى الأمراض",
                    ],
                    "jawaban" => "إن التدخين يسبب إلى كثير من الأمراض",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "43",
                    "soal" => "",
                    "pilihan" => [
                        "أمراض الحكة",
                        "أمراض القلب",
                        "أمراض الروح",
                        "أمراض الفكرة",
                    ],
                    "jawaban" => "أمراض القلب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "44",
                    "soal" => "",
                    "pilihan" => [
                        "ينبغي علينا أن ندخن قليلا",
                        "ينبغي علينا أن ندخن كثيرا",
                        "ينبغي علينا أن ندخن ولو كان قليلا",
                        "ينبغي علينا أن لا ندخن ولو كان قليلا",
                    ],
                    "jawaban" => "ينبغي علينا أن لا ندخن ولو كان قليلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "45",
                    "soal" => "",
                    "pilihan" => [
                        "يحث علينا أن نفعل شيئا يضر علينا",
                        "يحث علينا أن لا نفعل شيئا يضر علينا",
                        "يحث علينا أن نفعل شيئا ينفع علينا",
                        "يحث علينا أن نفعل شيئا لا ينفع علينا",
                    ],
                    "jawaban" => "يحث علينا أن لا نفعل شيئا يضر علينا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "46",
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في المطعم",
                        "في المقصف",
                        "في المطبخ",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "47",
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "48",
                    "soal" => "",
                    "pilihan" => [
                        "الدجاجة المقلية",
                        "البيض المغلي",
                        "الأطعمة السريعة",
                        "الفواكه",
                    ],
                    "jawaban" => "الأطعمة السريعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "49",
                    "soal" => "",
                    "pilihan" => [
                        "سيارة الركاب",
                        "سيارة الإسعاف",
                        "الدراجة النارية",
                        "الحافلة",
                    ],
                    "jawaban" => "سيارة الإسعاف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "50",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "أربعة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>فهم التراكيب والتعبيرات</b></center></p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'قال حكيم : "الكلمة إذا خرج من القلب وقعت فى القلب، وإذا خرجت من اللسان لم تجاوز الذان، الواو فى (وقعت) هي ؟',
                    "pilihan" => [
                        "حرف عطف",
                        "حرف استئناف",
                        "واو القسم",
                        "حرف أصلي من أحرف الكلمة",
                    ],
                    "jawaban" => "حرف أصلي من أحرف الكلمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'قال تعالى : (لو كان فيهما آلهة إلا الله لفسدتا) كلمة "آلهة" هي ؟',
                    "pilihan" => [
                        "خبر كان",
                        "اسم كان",
                        "مبتدأ مأخر",
                        "خبر",
                    ],
                    "jawaban" => "اسم كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'قال تعالى : (قتل أصحاب الأخدود) كلمة "أصحاب" هي ؟',
                    "pilihan" => [
                        "مبتدأ مأخر",
                        "نائب الفاعل",
                        "فاعل",
                        "مضاف اليه",
                    ],
                    "jawaban" => "نائب الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'قال رسول الله ﷺ : (أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله) فعل "يشهدوا" فى ذلك الحديث مضارع صحيح الآخر ؟',
                    "pilihan" => [
                        "منصوب وعلامة نصبه حذف النون",
                        "مرفوع وعلامة رفعه ضمة",
                        "مجزوم وعلامة جزمه حذف النون",
                        "منصوب وعلامة نصبه الف",
                    ],
                    "jawaban" => "منصوب وعلامة نصبه حذف النون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال رسول الله ﷺ : (إِنَّ الحَلاَلَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُوْرٌ مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس، فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِهِ...الخ) خبر إن من هذا الحديث هو ؟",
                    "pilihan" => [
                        "الحلال",
                        "وإن الحرام",
                        "الحرام",
                        "بين",
                    ],
                    "jawaban" => "بين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "شكر المهندس العاملتين .......تعملان بنشاط",
                    "pilihan" => [
                        "اللتان",
                        "الذين",
                        "اللتين",
                        "الذَين",
                    ],
                    "jawaban" => "اللتين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "ليس محمد .... في الجامعة الكبيرة بالمدينة ",
                    "pilihan" => [
                        "طالبا",
                        "الطالب",
                        "طالب",
                        "طالبة",
                    ],
                    "jawaban" => "طالبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "قال تعالى : كذالك وأورثناها بنى إسرائيل. مضاف اليه فى تلك الآية الكريمة هو ؟",
                    "pilihan" => [
                        "كذالك",
                        "إسرائيل",
                        "أورثناها بنى",
                        "بنى إسرائيل",
                    ],
                    "jawaban" => "إسرائيل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "....المرأة فى الماضي لا تخرج من بيتها إلا عند الضرورة",
                    "pilihan" => [
                        "جائتْ",
                        "كانتْ",
                        "لكن",
                        "كان",
                    ],
                    "jawaban" => "كانتْ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كان جنود المسلمين فى المعركة ثمانين وثلاثين ...؟",
                    "pilihan" => [
                        "ألف",
                        "ألوف",
                        "ألفا",
                        "آلاف",
                    ],
                    "jawaban" => "ألفا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "يجب أن تصل زينب وزنها إلى سبعين ......؟",
                    "pilihan" => [
                        "كيلان",
                        "كيلاً",
                        "كيلون",
                        "كيالين",
                    ],
                    "jawaban" => "كيلاً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "والذين يرمون المحصنات ثم لم يأتوا بـــــــ.......شهداء",
                    "pilihan" => [
                        "أربع",
                        "رابعة",
                        "أربعون",
                        "أربعة",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "يبلغ عدد سكان طوكيو نحو عشرة ........!",
                    "pilihan" => [
                        "ملايين",
                        "مليونان",
                        "مليون",
                        "مليونين",
                    ],
                    "jawaban" => "ملايين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'إن خروج المرأة من البيت يؤدي الى تفكك الأسرة . أي صغة لفظ "خروج"',
                    "pilihan" => [
                        "مصدر",
                        "اسم الفاعل",
                        "اسم مفعول",
                        "اسم فعل الأمر",
                    ],
                    "jawaban" => "مصدر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "ما هي الجملة الخاطئة من هذه الجملة ",
                    "pilihan" => [
                        "كان هدف الطالب طلب العلم ",
                        "كانت أهداف الطالب طلب العلم ",
                        "أخذت زينب تتناول كثيرا من الطعام",
                        "أخذ زينب تناول كثيرا من الطعام",
                    ],
                    "jawaban" => "أخذ زينب تناول كثيرا من الطعام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "دعاتْ الإسلام الى النظافة والطهارة",
                        "دعا الإسلام الى النظافة والطهارة",
                        "تدعو الإسلام الى النظافة والطهارة",
                        "دعتْ الإسلام الى النظافة والطهارة",
                    ],
                    "jawaban" => "دعا الإسلام الى النظافة والطهارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "تخطئن الأمة إذا اعتمدت على قوة الشباب وحدهم. الكلمة الخاطئة من هذه الجملة",
                    "pilihan" => [
                        "اعتمدت",
                        "الشباب",
                        "تخطئن",
                        "الأمة",
                    ],
                    "jawaban" => "تخطئن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "انتشرت الغنم بين الأعشاب الخضراء. الكلمة الخاطئة من هذه الجملة :",
                    "pilihan" => [
                        "الإعشاب",
                        "الغنم",
                        "بين",
                        "الخضراء",
                    ],
                    "jawaban" => "الغنم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "صبروا المسلمون على ما أصابهم من الوباء",
                        "صبرنا المسلمون على ما أصابهم من الوباء",
                        "صبر المسلمون على ما أصابهم من الوباء",
                        "صبرتم المسلمون على ما أصابهم من الوباء",
                    ],
                    "jawaban" => "صبر المسلمون على ما أصابهم من الوباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "..... القارئ أيات من القرآن الكريم",
                    "pilihan" => [
                        "تلا",
                        "تلى",
                        "تلو",
                        "تلأ",
                    ],
                    "jawaban" => "تلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "نعلم جميعا أن ...... المديرة يتعلمان فى الخارج",
                    "pilihan" => [
                        "بنت",
                        "ابني",
                        "ابن",
                        "بنتي",
                    ],
                    "jawaban" => "ابني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "الرجل .....قابلته صديقى الحميم",
                    "pilihan" => [
                        "التى",
                        "ما",
                        "من",
                        "الذي",
                    ],
                    "jawaban" => "الذي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كان طلاب العلم فى الماضى ....من بلد الى بلد لطلب العلم",
                    "pilihan" => [
                        "أسفرون",
                        "يسافرون",
                        "يسافرين",
                        "تتسافر",
                    ],
                    "jawaban" => "يسافرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "وقبل الالتحاق ..... الجامعة كان عمر تلميذا فى المدرسة الثانوية",
                    "pilihan" => [
                        "على",
                        "إلى",
                        "الباء",
                        "عن",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "وافق مجلس الشعب .......المشروع الكبير",
                    "pilihan" => [
                        "على",
                        "الباء",
                        "إلى",
                        "من",
                    ],
                    "jawaban" => "على",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "يعتقد المسلمون ....هو كلام الله",
                    "pilihan" => [
                        "بأن القرآن الكريم",
                        "على أن القرآن الكريم",
                        "أن القرآن الكريم",
                        "إن القرأن الكريم",
                    ],
                    "jawaban" => "أن القرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "إن اختلاف الآراء .... الفروع الفقهية لأ يدل على انحراف في الدين ما دام لم يخرج عن المقررات الشرعية المجمع عليها من السابقين",
                    "pilihan" => [
                        "من",
                        "على",
                        "الباء",
                        "في",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "أتعلم القرآن الكريم <u>حباً</u> في فهم التعاليم الإسلامية. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "المفعول لأجله",
                        "المفعول فيه",
                        "المفعول به",
                        "المفعول مطلق",
                    ],
                    "jawaban" => "المفعول لأجله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "صرتَ <u>أستاذا</u> في اللغة العربية . الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المفعول معه",
                        "المفعول لأجله",
                        "خبر صار",
                        "اسم صار",
                    ],
                    "jawaban" => "خبر صار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "أ وصلت<u>ك</u> الرسالة التى أرسلتها قبل يومين من سورابيا ؟  . الطامة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "فاعل",
                        "خبر",
                        "المفعول به",
                    ],
                    "jawaban" => "المفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "من خطبة النبى ﷺ : فإن لكم على نسائكم <u>حقاً</u>. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "خبر إن",
                        "اسم إن",
                        "المفعول المطلق",
                        "الحال",
                    ],
                    "jawaban" => "اسم إن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "للحيوان <u>أصوات</u> مختلفة.  الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "الخبر",
                        "المفعول به",
                        "الفاعل",
                    ],
                    "jawaban" => "المبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "على – أموالا – بعض – تنفق – كثيرة – النظافة – الدول",
                    "pilihan" => [
                        "النظافة تنفق أموالا كثيرة على بعض الدول",
                        "على بعض الدول تنفق النظافة أومالا كثيرة",
                        "تنفق بعض الدول أموالا كثيرة على النظافة",
                        "بعض أموالا كثيرة تنفق على النظافة الدول",
                    ],
                    "jawaban" => "تنفق بعض الدول أموالا كثيرة على النظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "من – يفضل – الناس- القراءة – كثير",
                    "pilihan" => [
                        "من يفضل كثير الناس القراءة",
                        "يفضل كثير من الناس القراءة",
                        "القراءة من كثير الناس يفضل",
                        "كثير القراءة من يفضل الناس",
                    ],
                    "jawaban" => "يفضل كثير من الناس القراءة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "الأم – وحد – ها – الوقت – معظم – تبقى –في – البيت",
                    "pilihan" => [
                        "وحد الأمها معظم الوقت فى البيت  تبقى",
                        "الأمها تبقى في معظم الوقت وحد البيت",
                        "فى معظم الوقت الأمها تبقى وحد البيت",
                        "تبقى الأم في البيت وحدها معظم الوقت",
                    ],
                    "jawaban" => "تبقى الأم في البيت وحدها معظم الوقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "يفضل فريق من الناس أن يكون قريبا من شاطئ البحر . خبر كان من هذه الجملة هي",
                    "pilihan" => [
                        "قريبا",
                        "من الناس",
                        "فريق الناس",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "قريبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "........ المشاهدون مباراة كرة القدم في الملعب الرياضي الكبير",
                    "pilihan" => [
                        "شاهدت",
                        "شاهدوا",
                        "يشهد",
                        "يشاهدون",
                    ],
                    "jawaban" => "يشهد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "العَالِمُ كَبِيْرٌ وَإِنْ كَانَ <u>حَدَثًا</u> وَالجَاهِلُ صَغِيْرٌ وَإِنْ كَانَ شَيْخًا. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "الأمر",
                        "صغير السنّ",
                        "كبير السنّ",
                        "المجالس",
                    ],
                    "jawaban" => "صغير السنّ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "لا نتظرنّ لأثواب على أحد إن <u>رمت</u> تعرفه فانظر الى الأدب. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "عرفت",
                        "كرمت",
                        "نظرت",
                        "أردت",
                    ],
                    "jawaban" => "أردت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "من لم <u>يذق</u> ذل التعلم ساعة تجرع ذل الجهل طول حياته. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "يشعر",
                        "يتعلم",
                        "يذهب",
                        "يجلس",
                    ],
                    "jawaban" => "يشعر",
                ]
            ]
        ];

        return $data;
    }

    public function get_soal_qiroahv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "<p><center><b>فهم المقروء</b></center></p>"
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان أخي إبراهيم طالبا في كلية الهندسة، بجامعة ملك سعود. دعاني أخي لقضاء أيام عيد الفطر معه وقد اتصل بي هاتفيا، قبل سفري قائلا : يا علي أرجو أن تحضر بالطائرة ولا تحاول أن تحضر بالحافلة، فالأمطار كثيرة وربما تعطلت الحافلة في الطريق بسبب المياه والوحل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين درس إبراهيم؟",
                    "pilihan" => [
                        "إندونيسيا",
                        "ماليزيا",
                        "الجزائر",
                        "السعودية",
                    ],
                    "jawaban" => "السعودية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "لماذا اقترح إبراهيم عَليًّا ليركب الطائرة؟",
                    "pilihan" => [
                        "أنّ أجرة الطائرة رخيصة",
                        "أن أجرة الحافلة غلية",
                        "أن الطائرة لا تتعطل بسبب المطر",
                        "أن الحافلة لا تتعطل بسبب المياه والوحل ",
                    ],
                    "jawaban" => "أن الطائرة لا تتعطل بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "من المتحدث لتلك القرآءة؟ ",
                    "pilihan" => [
                        "إبراهيم ",
                        "ملك سعود ",
                        "علي",
                        "أخي إبراهيم",
                    ],
                    "jawaban" => "علي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>عاشت خديجة بنت خويلد في بيت غني، وكانت محبوبة من والديها لذكائها وأدبها وعندما مات زوجها عملت بالتجارة فكسبت مالا كثيرا. كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق، فاختارته السيدة خديجة ليعمل في تجارتها، فسافر إلى الشام في رحلة تجارية وكان معه في تلك الرحلة ميسرة، خادم السيدة خديجة. عندما عادت الرحلة من الشام أخبرت ميسرة السيدة خديجة بما حدث في تلك الرحلة. أخبرها ميسرة عن  صدق محمد وأمانته، كما أخبرها بالسحابة التي كانت تحميه من حر الشمس وهي تسير فوق رأسه.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "ماذا حدث في رحلة النبي؟",
                    "pilihan" => [
                        "سار الجمل سرعة",
                        "سارت السحابة تحت قدميه",
                        "حمت السحابة رأسه",
                        "حمت السحابة رأسها",
                    ],
                    "jawaban" => "حمت السحابة رأسه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "عاشت خديجة بنت خويلد في بيت....",
                    "pilihan" => [
                        "ضيق",
                        "فاخر",
                        "صغير",
                        "بسيط",
                    ],
                    "jawaban" => "فاخر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => '"كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق". ما هو خبر (كان) من تلك الجملة؟',
                    "pilihan" => [
                        "النبي",
                        "ص",
                        "قبل النبوة",
                        "مشهورا",
                    ],
                    "jawaban" => "مشهورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لماذا اختارت السيدة خديجة النبي محمدا ليعمل في تجارتها؟",
                    "pilihan" => [
                        "لأنه مشهور بالصدق والأمانة",
                        "لأنه مشهور بالذكاء والأدب",
                        "لأنها مشهورة بالأمانة والصدق",
                        "لأنها مشهورة بذكائها وأدبها",
                    ],
                    "jawaban" => "لأنه مشهور بالصدق والأمانة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "ماذا فعلت ميسرة بعدما شاهدت شيئا غريبا في رحلتها مع النبي؟",
                    "pilihan" => [
                        "سكتت",
                        "ضحكت",
                        "تعجبت",
                        "أخبرت",
                    ],
                    "jawaban" => "أخبرت",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يفضل كثير من الناس الترويح خارج البيوت، حيث يقضون الوقت في مخيمات. ويختلف الوقت الذي يقضيه الناس في المخيمات، فقد يكون ليلة واحدة، وقد يكون عدة أسابيع. ويختلف المكان، فقد يكون على شاطئ البحر، أو في البر، أو في الغابة، أو في الصحراء، أو بين الجبال، حيث الهواء النقي.</p>
                    <p>يخرج الناس أيام العطلة إلى البر، وينصبون في مكان الترويح الخيام، ويحملون معهم الطعام والشراب، ووسائل الترويح. ويفضل فريق من الناس أن يكون قريبا من شاطئ البحر، حيث يمارسون السباحة، وأنواع الرياضة الأخرى، ويصطادون السمك. ويفضل بعض الناس مشاهدة الطيور، أو التصوير، أو المشي.</p>
                    <p>يحمل الناس معهم إلى البر خياما، وملابس، وكثيرا من الطعام. وبعض الناس يعدون الطعام في بيوتهم، ويضعونه في أوان. وهناك من يفضل إعداد الطعام في المخيمات. ويحمل الناس معهم الماء، إذا لم يكن في المكان ماء.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "ما العنوان المناسب لهذه الفقرات؟",
                    "pilihan" => [
                        "الهواية",
                        "التخييم",
                        "التنزه",
                        "الأعمال خارج البيت",
                    ],
                    "jawaban" => "التخييم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "يقضي الناس أيام عطلتهم إلى البر....؟",
                    "pilihan" => [
                        "هم ينامون في خيامهم",
                        "هم ينامون في بيوتهم",
                        "هم ينامون في فنادقهم",
                        "هم ينامون في شققهم",
                    ],
                    "jawaban" => "هم ينامون في خيامهم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ما هي المدة الأدنى في قضاء خروجهم من البيت للتنزه؟",
                    "pilihan" => [
                        "ليلة واحدة",
                        "يوما واحدا",
                        "عدة أسابيع",
                        "عدة شهور",
                    ],
                    "jawaban" => "ليلة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "أين المكان الذي لا يناسبه للتخييم؟",
                    "pilihan" => [
                        "شاطئ البحر",
                        "الجرف",
                        "الغابة",
                        "بين الجبال",
                    ],
                    "jawaban" => "الجرف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "كم يوما في أسبوع واحد؟",
                    "pilihan" => [
                        "يوما واحدا",
                        "ثلاثة أيام",
                        "عشرة أيام",
                        "سبعة أيام",
                    ],
                    "jawaban" => "سبعة أيام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p></p>أصلي العصر في المسجد وأتلو القرآن الكريم وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا من الماء ثم نصلي المغرب جماعة. وبعد الصلاة أعود إلى المنزل حيث أكمل إفطاري ثم أعود لصلاة العشاء و صلاة التراويح والوتر في المسجد.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما المرادف من كلمة (أتلو) ؟",
                    "pilihan" => [
                        "أعطى",
                        "أفتح",
                        "أقرأ",
                        "أصدق",
                    ],
                    "jawaban" => "أقرأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'ما المقصود من عبارة "وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا" ؟',
                    "pilihan" => [
                        "أنه يأكل التمر قبل الآذان",
                        "أنه يأكل التمر قبل المغرب",
                        "أنه يأكل التمر بعد صلاة المغرب",
                        "أنه يأكل التمر بعد ما سمع الآذان",
                    ],
                    "jawaban" => "أنه يأكل التمر بعد ما سمع الآذان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "وعندما يؤذن آذن المغرب <u>أتناول</u> بعض التمر. الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "استمرار",
                        "استهلاك",
                        "استشعار",
                        "استعداد",
                    ],
                    "jawaban" => "استهلاك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "ثم <u>أعود</u> لصلاة العشاء. في تلك الجملة، الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "رجع من المنزل",
                        "ذهب إلى المنزل",
                        "ح. رجع من المسجد",
                        "ذهب إلى المسجد",
                    ],
                    "jawaban" => "ذهب إلى المسجد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان حامد راعيا يرعى أغنام القرية. <u>وكان</u>  يأخذ الأغنام في الصباح الباكر. ويخرج بها إلى أطراف القرية حيث الأشجار والعشب الأخضر. كان حامد يحمل في يده اليمني عصا كبيرة وفي يده اليسرى طعامه ومزماره وكان يصحبه كلبه الذي يجري أمام الأغنام وخلفها.</p>
                    <p>عندما يصل حامد إلى المرعى يترك أغنامه ويذهب إلى شجرة كبيرة يجلس تحتها ليتناول طعامه ثم يتناول مزماره ويغني بعض الألحان الجميلة ثم ينام قليلا ويستيقظ ليتفقد أغنامه. وعند العصر يجمع أغنامه ويعود بها إلى القرية سعيدا.</p>
                    <p>فكر حامد ذات  يوم، وقال لنفسه: لماذا لا أسخر من أهل القرية؟. وأخذ يفكر في طريقة يمازح بها أهل القرية. صعد حامد إلى شجرة عالية وأخذ يصرخ بصوت عال: الذئب.... الذئب...... لقد هجم الذئب على أغنامكم.... أنقذوني... أنقذوني..</p>
                    <p>لما سمع أهل القرية نداء الراعي. أسرعوا إليه فلما وصلوا إلى مكانه أخذ ينظر إليهم ويضحك ثم قال لهم: لقد كذبت عليكم ها.. ها.. ها.. عاد الناس إلى القرية غاضبين ثم نسوا الموضوع.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "الفكرة الرئيسة في الفقرة السابقة تتحدث عن.... ",
                    "pilihan" => [
                        "عاش رجل في القرية وعنده أغنام كثيرة وهو صادق",
                        "كان راعيا كاذبا",
                        "كان الرجل راعيا صادقا",
                        "الرجل يحب الغناء",
                    ],
                    "jawaban" => "كان راعيا كاذبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أين كذب الراعي على أهل القرية؟ ",
                    "pilihan" => [
                        "في السوق",
                        "في الملعب",
                        "في المرعى",
                        "في القرية",
                    ],
                    "jawaban" => "في المرعى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "أي عبارة من العبارات الآتية لا يحتويها الموضوع؟ ",
                    "pilihan" => [
                        "حامد كان صادقا و كريما",
                        "حامد كان راعيا و كاذبا",
                        "كان حامد يغني بعض الألحان ",
                        "كان حامد يعود إلى القرية عند العصر",
                    ],
                    "jawaban" => "حامد كان صادقا و كريما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'خبر كان من عبارة "<u> وكان</u>  يأخذ الأغنام في الصباح الباكر "؟ ',
                    "pilihan" => [
                        "يأخذ",
                        "الأغنام",
                        "في الصباح ",
                        "الباكر",
                    ],
                    "jawaban" => "يأخذ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ضمير (ها) في جملة "وعند العصر يجمع أغنامه ويعود <u>بها</u> إلى القرية سعيدا." راجعا إلى.. ',
                    "pilihan" => [
                        "القرية",
                        "الأغنام",
                        "الجميلة ",
                        "الألحان ",
                    ],
                    "jawaban" => "الأغنام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>حزنت زينب حزنا شديدا. فهي لا تستطيع أن تفارق صديقتها العزيزة. لاحظ والد زينب في البيت. أن بنته حزينة طوال الوقت ولم تعد تضحك كعادتها، فسألها عن سبب ذٰلك. فأخبرته بأن صديقتها سلمى سترحل مع أسرتها إلى مدينة أخرى. لأن والدها لم يجد عملا في هذه المدينة. ابتسم والد زينب وقال لها: لن تفارقي صديقتك إن شاء الله</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "ما سبب حزنها زينب؟ ",
                    "pilihan" => [
                        "ستعود صديقتها إلى منزلها",
                        "ستزور صديقتها إلى مدينة أخرى",
                        "سترحل صديقتها إلى مدينة أخرى ",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سترحل صديقتها إلى مدينة أخرى ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "ما اسم صديقة زينب؟ ",
                    "pilihan" => [
                        "عزيزة",
                        "فاطمة",
                        "خديجة ",
                        "سلمى",
                    ],
                    "jawaban" => "سلمى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "لماذا ستذهب صديقتها وأسرتها عن مدينة قديمة؟ ",
                    "pilihan" => [
                        "لأن والد صديقتها يجد عملا في مدينة أخرى ",
                        "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                        "لأن أسرة صديقتها لا تحب  هذه المدينة ",
                        "لأن أسرة صديقتها تحب  هذه المدينة ",
                    ],
                    "jawaban" => "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>ولد أبو بكر الصديق رضي الله عنه في السنة الثانية أو الثالثة من عام الفيل وهو أصغر من النبي(ص) بنحو سنتين. وقد <b>كان</b> محبوبا في الجاهلية. لأنه كان رجلا أمينا، كريما، طيب الأخلاق، حسن السلوك، وهو لم يشرب خمرا في حياته ولم يسجد لصنم أبدا.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'الضمير هو في جملة "وقد <b>كان</b> محبوبا في الجاهلية" يعود إلى ؟',
                    "pilihan" => [
                        "النبي صلى الله عليه وسلم",
                        "أبي بكر الصديق",
                        "العام",
                        "الفيل",
                    ],
                    "jawaban" => "أبي بكر الصديق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ولد أبو بكر الصديق رضي الله عنه. "وُلِد" في هذه الجملة من فعل؟',
                    "pilihan" => [
                        "معلوم",
                        "مجهول",
                        "مرفوع",
                        "منصوب",
                    ],
                    "jawaban" => "مجهول",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>دعا النبي (ص) الناس إلى الإسلام. فتردد الكثيرون إلا أبا بكر الصديق. فقد أسلم دون تردد. وكان أول من أسلم من الرجال، وكانت السيدة خديجة أول من أسلم من النساء. أما أول من أسلم من الصبيان فهو علي بن أبي طالب رضي الله عنه.</p>
                    <p>كنّى النبي (ص) أبا بكر بالصديق لأنه صدقه عندما أخبره بقصة الإسراء به ليلا من المسجد الحرام في مكة إلى مسجد الأقصى في بيت المقدس. حيث قال تعالى : "سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله لنريه من آيتنا....."</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "لماذا كُنّيَ أبو بكر بالصديق؟ ",
                    "pilihan" => [
                        "لأنه أول من أسلم من الرجال",
                        "لأنه أول من أسلم من الصبيان",
                        "لأنه لايزال صغيرا ",
                        "لأنه صدق قصة الإسراء",
                    ],
                    "jawaban" => "لأنه صدق قصة الإسراء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "فهمنا من النص السابق أن أول الولد أسلم هو؟ ",
                    "pilihan" => [
                        "أبو بكر الصديق",
                        "السيدة خديجة ",
                        "عمر بن الخطاب",
                        "علي بن أبي طالب",
                    ],
                    "jawaban" => "علي بن أبي طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>فتردد</u> الكثيرون إلا أبا بكر الصديق". والمراد باللفظ الذي تحته خط هو ؟ ',
                    "pilihan" => [
                        "هم يريبون في قصة الإسراء ",
                        "هم يؤمنون بقصة الإسراء",
                        "هم يشكّون على دعوة النبي إلى الإسلام",
                        "هم يخونون دعوة النبي إلى الإسلام",
                    ],
                    "jawaban" => "هم يشكّون على دعوة النبي إلى الإسلام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان في إحدى المدن ملك ذكي يحكم شعبه حكما عادلا وكان للملك وزير ذكي و عادل كذلك. وقد كان الشعب يحب الملك ووزيره. كانت في وسط المدينة بئر. عذبة الماء. يشرب منها جميع السكان المدينة. لأنه لم تكن في المدينة بئر سواها. </p>
                    <p>في أحد الأيام جائت ساحرة إلى المدينة. كانت تحمل قارورة صغيرة. بها ماء. وقفت الساحرة بالقرب من البئر وكان حول البئر جمع كبير من الناس. قالت لهم الساحرة : سأقذف بسبع نقط من هذه القارورة في البئر ومن يشرب من البئر يصير مجنونا أو يمت.</p>
                    <p>في اليوم الثاني عطس سكان المدينة. فذهبوا إلى البئر وشربوا من مائها وقد كانوا خائفين من كلام الساحرة ولما شربوا من الماء لم يمت منهم أحد ولكنهم أصبحوا جميعا مجانين. </p>
                    <p>عطس الملك ولكنه خاف من الجنون والموت. وكذلك خاف وزيره وعندما سمع سكان المدينة. بأن الملك ووزيره لم يشربا من البئر. طافوا من حي إلى حي ومن شارع إلى شارع. وهم ينادون: لقد صارا ملكنا ووزيره مجنونين. </p>
                    <p>في المساء علم الملك بما فعله الناس. فاستدعاهم أمام قصره وأمر بأن تملأ له كأس ذهبية من ماء البئر. </p>
                    <p>فملأوها له في الحال وأخضروها إليه. فتناول بيده ورفعها إلى فمه وشرب من مائها ثم دفع بالكأس إلى وزيره فشرب بقية الماء. انطلق سكان المدينة في الشوارع. ينادون: لقد عاد ملكنا ووزيره إلى رشدهما</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "ما العنوان المناسب للنص السابق؟ ",
                    "pilihan" => [
                        "الملك الجائر",
                        "الساحرة الحكيمة",
                        "الملك الحكيم",
                        "الساحرة المجرمة",
                    ],
                    "jawaban" => "الملك الحكيم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "العبارات التي لا تحتوي على ذلك النص هي؟ ",
                    "pilihan" => [
                        "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                        "أصبح السكان مجنونين بسبب شرب الماء",
                        "قذفت الساحرة ماء قارورتها بسبع نقط",
                        "كان الملك ذكيا و عادلا",
                    ],
                    "jawaban" => "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا حملت الساحرة؟ ",
                    "pilihan" => [
                        "سبع نقط من القارورة ",
                        "الكأس لإملاء الماء",
                        "هي لا تحمل شيأ إلا مالا",
                        "قارورة صغيرة بها ماء",
                    ],
                    "jawaban" => "قارورة صغيرة بها ماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "ماذا ستحدث عندما شرب الناس ماء البئر التي احتوت على ماء حملته الساحرة؟ ",
                    "pilihan" => [
                        "سيكون ذكيا وماهرا",
                        "سيصبح مجنونا أو ميتا",
                        "سيصير غانيا",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سيصبح مجنونا أو ميتا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "ماذا قالت الساحرة إلى سكان المدينة؟ ",
                    "pilihan" => [
                        "إنها ستقذف بسبع نقط من دلوها في البئر ",
                        "إنها ستأخذ بعض الماء من البئر وتعطيه إلى الآخر",
                        "إنها ستعطي مالها إلى جميع السكان المدينة ",
                        "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                    ],
                    "jawaban" => "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هل تعمل المرأة خارج بيتها، أم لا تعمل؟ يختلف الناس في الإجابة عن هذا السؤال إلى ثلاث فرق؛ فريق يقول: نعم، يجب أن تعمل المرأة خارج بيتها، مثل الرجل؛ وفريق آخر يقول: لا يصح أن تعمل المرأة خارج بيتها؛ وفريق ثالث يقول: تعمل المرأة خارج بيتها، ولكن بشرط.</p>
                    <p>يقول الفريق الأول: إن المرأة نصف المجتمع، ولا يصح أن تجلس في بيتها؛ تغسل الملابس، وتعد الطعام، وتنظف البيت، وتربي الأولاد، وهي عندهم جزء من الاقتصاد، تعمل وتأخذ أجر عملها.</p>
                    <p>ويرى الفريق الثاني، أن وظيفة المرأة الأساسية أن تكون في البيت، حيث تديره، وتربي أولادها. ويرى هذا الفريق أن الراتب الذي تأخذه المرأة من عملها، تعطيه للخادمة التي تفسد الأولاد، ولا تصلحهم. ويقول هذا الفريق: إن خروج المرأة من البيت، يؤدي إلى تفكك الأسرة، وضياع الأولاد.</p>
                    <p>أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عملها الأساسي في بيتها، ولها أن تعمل خارج بيتها، بشرط أن تعمل في المجالات التي تناسبها، وتحفظ أخلاقها، وتبعدها عن مخالطة الرجال، كالعمل في المجال الطبي؛ فتعمل طبيبة، أو ممرضة، أو في المجال التعليمي؛ فتعمل معلمة، أو مربية،أو غير ذلك في مجتمع نسائي.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "الفكرة الرئيسة للفقرة الثانية هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها ",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "المرأة تعمل و تحصل أجرة كمثل الرجل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "الفكرة الرئيسة للفقرة الثالثة هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل ",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "وجدنا من تلك الفقرات أنّ المرأة.... ",
                    "pilihan" => [
                        "كانت تعمل خارج بيتها كمثل الرجل",
                        "كانت تعمل في بيتها فقط لتربية أولادها وغير ذلك",
                        "كانت تعمل في بيتها وأيضا خارج بيتها بشرط",
                        "كل الأجوبة صحيحة",
                    ],
                    "jawaban" => "كل الأجوبة صحيحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => '" أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عمل<b>ها</b> الأساسي في بيت<b>ها</b>، ول<b>ها</b> أن تعمل خارج بيت<b>ها</b>، بشرط أن تعمل في المجالات التي تناسبها " . ضمير "ها" يعود إلى ؟ ',
                    "pilihan" => [
                        "الفريق",
                        "المرأة",
                        "الثالث",
                        "العمل",
                    ],
                    "jawaban" => "المرأة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "أفضل العنوان للفقرات السابقة:",
                    "pilihan" => [
                        "عمل الصبيان",
                        "تربية الأولاد",
                        "رفاء الأسرة",
                        "عمل المرأة",
                    ],
                    "jawaban" => "عمل المرأة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>كان أبو بكر رفيق النبي (ص) في السلم وفي الحرب وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد مات. فخرج إليهم أبو بكر وقال لهم: "من كان يعبد محمدا فإن محمدا قد مات ومن كان يعبد الله فإن الله حي لا يموت"</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "المراد ب(اضطرب) هو؟",
                    "pilihan" => [
                        "فرح",
                        "قلق",
                        "صبر",
                        "بكى",
                    ],
                    "jawaban" => "قلق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "فهمنا من تلك الفقرة أن أبا بكر؟ ",
                    "pilihan" => [
                        "صحبة النبي ",
                        "لا يبكي على وفاة النبي ",
                        "يبكي على وفاة النبي ",
                        "نهي الناس ليعبد النبي ",
                    ],
                    "jawaban" => "نهي الناس ليعبد النبي ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'الفاعل من "اضطرب" في الجملة "وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد ما"ت ؟ ',
                    "pilihan" => [
                        "هو",
                        "هم",
                        "النبي",
                        "الكثيرون",
                    ],
                    "jawaban" => "الكثيرون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبح العالم – اليوم – قرية صغيرة، بسبب وسائل النقل الحديثة، ووسائل الاتصال الحديثة. كيف يعيش سكان هذه القرية الصغيرة؟ إنني أدعوك يا صاحبي لزيارة هذه القرية الصغيرة. هيا نتجول فيها، وننظر كيف يعيش سكانها. سأصحبك معي في طائرتي. إنني أملك طائرة سريعة، أسرع من الصوت. تفضل يا صاحبي، اركب الطائرة، وهيا بنا ننطلق.</p>
                    <p>نحن نطير الآن فوق دول الشمال. انظر إلى هذه الدول، إنها دول غنية، نملك القوة والعلم والمال. انظر إلى الناس، إنهم أغنياء في هذه الدول، يلبسون أجمل الثياب، وهم أصحاء، ويعيشون في بيوت جميلة. ما أكثر المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! إنهم يعيشون في أمن ورخاء.</p>
                    <p>هيا نزور الجانب الآخر من العالم. هذه دول الجنوب. إنها دول فقيرة، لا تملك القوة ولا العلم ولا المال. انظر إلى هؤلاء الناس، إنهم فقراء يلبسون ثيابًا بسيطة، ويعيشون في بيوت صغيرة، ومعظمهم مرضى. ما أقل المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! لماذا يتقاتل الناس في هذه البلاد؟ ولماذا ينتشر الفقر والمرض والجهل هنا؟ يا لها من حياة!</p>
                    <p>هل رأيت يا صاحبي هذه القرية الصغيرة؟! يعيش نصف سكانها في رخاء، ويعيش النصف الآخر في فقر وحرب. لماذا لا يعيش جميع سكان القرية في رخاء وأمن؟ هل سيحدث ذلك في يوم من الأيام؟  الله أعلم.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "ما العنوان المناسب للفقرات السابقة؟ ",
                    "pilihan" => [
                        "دول الشمال و دول الجنوب",
                        "ما أكثر المدارس في دول الشمال",
                        "ما أقل المدارس في دول الجنوب",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "دول الشمال و دول الجنوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "عرفنا الآن أنّ دول الشمال..... من دول الجنوب",
                    "pilihan" => [
                        "أكثر مجتمعا",
                        "أقل مجتمعا ",
                        "أقل تطورا",
                        "أكثر تطورا",
                    ],
                    "jawaban" => "أكثر تطورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'ما المرادف من كلمة "سكان" ؟',
                    "pilihan" => [
                        "مغترب",
                        "مستوطن",
                        "مختلس",
                        "مجدد",
                    ],
                    "jawaban" => "مستوطن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'المضادة من كلمة "الحديثة"... ؟',
                    "pilihan" => [
                        "الجديدة ",
                        "الجيدة",
                        "القادمة",
                        "القديمة",
                    ],
                    "jawaban" => "القديمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => 'ماذا تقصد من عبارة "يعيش نصف سكانها في رخاء" ؟',
                    "pilihan" => [
                        "يعيشون في السعادة",
                        "يعيشون في الحزن",
                        "يعيشون في الفقر",
                        "يعيشون في المسكين",
                    ],
                    "jawaban" => "يعيشون في السعادة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'الكلمة "المَدَارِس" جمع كلمة من... ؟',
                    "pilihan" => [
                        "مُدَرِّسة",
                        "مدرسان ",
                        "مدرسون",
                        "مَدْرَسة",
                    ],
                    "jawaban" => "مَدْرَسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'ما معنى "يحدث في الجملة "هل سيحدث ذلك في يوم من الأيام "؟',
                    "pilihan" => [
                        "يصل",
                        "يطلب",
                        "يجد",
                        "يقع",
                    ],
                    "jawaban" => "يقع",
                ]
            ],
        ];

        return $data;
    }

}
/* End of file Soal_model.php */
